#pragma once

// Paladins (3.05) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PL_AkAudio_structs.hpp"

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class AkAudio.ActorFactoryAkAmbientSound
// 0x185BB734D10
class ActorFactoryAkAmbientSound
{
public:
	unsigned char                                      UnknownData00[0x185BB734D10];                             // 0x0000(0x185BB734D10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.ActorFactoryAkAmbientSound");
		return ptr;
	}

};


// Class AkAudio.AkAmbientSound
// 0x185BB49F950
class AkAmbientSound
{
public:
	unsigned char                                      UnknownData00[0x185BB49F950];                             // 0x0000(0x185BB49F950) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.AkAmbientSound");
		return ptr;
	}

};


// Class AkAudio.AkComponent
// 0x185BB734890
class AkComponent
{
public:
	unsigned char                                      UnknownData00[0x185BB734890];                             // 0x0000(0x185BB734890) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.AkComponent");
		return ptr;
	}

};


// Class AkAudio.InterpTrackAkEvent
// 0x185BB733ED0
class InterpTrackAkEvent
{
public:
	unsigned char                                      UnknownData00[0x185BB733ED0];                             // 0x0000(0x185BB733ED0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.InterpTrackAkEvent");
		return ptr;
	}

};


// Class AkAudio.InterpTrackAkRTPC
// 0x185BB732E50
class InterpTrackAkRTPC
{
public:
	unsigned char                                      UnknownData00[0x185BB732E50];                             // 0x0000(0x185BB732E50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.InterpTrackAkRTPC");
		return ptr;
	}

};


// Class AkAudio.InterpTrackInstAkEvent
// 0x185BB732310
class InterpTrackInstAkEvent
{
public:
	unsigned char                                      UnknownData00[0x185BB732310];                             // 0x0000(0x185BB732310) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.InterpTrackInstAkEvent");
		return ptr;
	}

};


// Class AkAudio.InterpTrackInstAkRTPC
// 0x0000
class InterpTrackInstAkRTPC
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.InterpTrackInstAkRTPC");
		return ptr;
	}

};


// Class AkAudio.SeqAct_AkClearBanks
// 0x0000
class SeqAct_AkClearBanks
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.SeqAct_AkClearBanks");
		return ptr;
	}

};


// Class AkAudio.SeqAct_AkLoadBank
// 0x185BB734A10
class SeqAct_AkLoadBank
{
public:
	unsigned char                                      UnknownData00[0x185BB734A10];                             // 0x0000(0x185BB734A10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.SeqAct_AkLoadBank");
		return ptr;
	}

};


// Class AkAudio.SeqAct_AkPostEvent
// 0x185BB7326D0
class SeqAct_AkPostEvent
{
public:
	unsigned char                                      UnknownData00[0x185BB7326D0];                             // 0x0000(0x185BB7326D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.SeqAct_AkPostEvent");
		return ptr;
	}

};


// Class AkAudio.SeqAct_AkPostTrigger
// 0x185BB732850
class SeqAct_AkPostTrigger
{
public:
	unsigned char                                      UnknownData00[0x185BB732850];                             // 0x0000(0x185BB732850) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.SeqAct_AkPostTrigger");
		return ptr;
	}

};


// Class AkAudio.SeqAct_AkSetRTPCValue
// 0x185BB733510
class SeqAct_AkSetRTPCValue
{
public:
	unsigned char                                      UnknownData00[0x185BB733510];                             // 0x0000(0x185BB733510) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.SeqAct_AkSetRTPCValue");
		return ptr;
	}

};


// Class AkAudio.SeqAct_AkSetState
// 0x185BB734410
class SeqAct_AkSetState
{
public:
	unsigned char                                      UnknownData00[0x185BB734410];                             // 0x0000(0x185BB734410) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.SeqAct_AkSetState");
		return ptr;
	}

};


// Class AkAudio.SeqAct_AkSetSwitch
// 0x185BB733990
class SeqAct_AkSetSwitch
{
public:
	unsigned char                                      UnknownData00[0x185BB733990];                             // 0x0000(0x185BB733990) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.SeqAct_AkSetSwitch");
		return ptr;
	}

};


// Class AkAudio.SeqAct_AkStartAmbientSound
// 0x0000
class SeqAct_AkStartAmbientSound
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.SeqAct_AkStartAmbientSound");
		return ptr;
	}

};


// Class AkAudio.SeqAct_AkStopAll
// 0x0000
class SeqAct_AkStopAll
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.SeqAct_AkStopAll");
		return ptr;
	}

};


// Class AkAudio.AkAudioDevice
// 0x0000
class AkAudioDevice
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AkAudio.AkAudioDevice");
		return ptr;
	}

};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
