#pragma once

// Paladins (3.05) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PL_GFxUI_structs.hpp"

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GFxUI.GFxEngine
// 0x185B620DA70
class GFxEngine
{
public:
	unsigned char                                      UnknownData00[0x185B620DA70];                             // 0x0000(0x185B620DA70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxEngine");
		return ptr;
	}

};


// Class GFxUI.GFxFSCmdHandler
// 0x185B6D1E990
class GFxFSCmdHandler
{
public:
	unsigned char                                      UnknownData00[0x185B6D1E990];                             // 0x0000(0x185B6D1E990) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxFSCmdHandler");
		return ptr;
	}

};


// Class GFxUI.GFxInteraction
// 0x185B6D1F170
class GFxInteraction
{
public:
	unsigned char                                      UnknownData00[0x185B6D1F170];                             // 0x0000(0x185B6D1F170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxInteraction");
		return ptr;
	}

};


// Class GFxUI.GFxMoviePlayer
// 0x185B6D0E010
class GFxMoviePlayer
{
public:
	unsigned char                                      UnknownData00[0x185B6D0E010];                             // 0x0000(0x185B6D0E010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxMoviePlayer");
		return ptr;
	}

};


// Class GFxUI.GFxObject
// 0x185B6D18570
class GFxObject
{
public:
	unsigned char                                      UnknownData00[0x185B6D18570];                             // 0x0000(0x185B6D18570) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxObject");
		return ptr;
	}

};


// Class GFxUI.GFxRawData
// 0x185ABCA9310
class GFxRawData
{
public:
	unsigned char                                      UnknownData00[0x185ABCA9310];                             // 0x0000(0x185ABCA9310) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxRawData");
		return ptr;
	}

};


// Class GFxUI.SwfMovie
// 0x185ABCA7090
class SwfMovie
{
public:
	unsigned char                                      UnknownData00[0x185ABCA7090];                             // 0x0000(0x185ABCA7090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.SwfMovie");
		return ptr;
	}

};


// Class GFxUI.FlashMovie
// 0x0000
class FlashMovie
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.FlashMovie");
		return ptr;
	}

};


// Class GFxUI.GFxAction_CloseMovie
// 0x185B6D0EC70
class GFxAction_CloseMovie
{
public:
	unsigned char                                      UnknownData00[0x185B6D0EC70];                             // 0x0000(0x185B6D0EC70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxAction_CloseMovie");
		return ptr;
	}

};


// Class GFxUI.GFxAction_GetVariable
// 0x185B6D0B790
class GFxAction_GetVariable
{
public:
	unsigned char                                      UnknownData00[0x185B6D0B790];                             // 0x0000(0x185B6D0B790) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxAction_GetVariable");
		return ptr;
	}

};


// Class GFxUI.GFxAction_Invoke
// 0x185B6D17C70
class GFxAction_Invoke
{
public:
	unsigned char                                      UnknownData00[0x185B6D17C70];                             // 0x0000(0x185B6D17C70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxAction_Invoke");
		return ptr;
	}

};


// Class GFxUI.GFxAction_OpenMovie
// 0x185B6D163B0
class GFxAction_OpenMovie
{
public:
	unsigned char                                      UnknownData00[0x185B6D163B0];                             // 0x0000(0x185B6D163B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxAction_OpenMovie");
		return ptr;
	}

};


// Class GFxUI.GFxAction_SetCaptureKeys
// 0x185B6200AB0
class GFxAction_SetCaptureKeys
{
public:
	unsigned char                                      UnknownData00[0x185B6200AB0];                             // 0x0000(0x185B6200AB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxAction_SetCaptureKeys");
		return ptr;
	}

};


// Class GFxUI.GFxAction_SetVariable
// 0x185B6D15630
class GFxAction_SetVariable
{
public:
	unsigned char                                      UnknownData00[0x185B6D15630];                             // 0x0000(0x185B6D15630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxAction_SetVariable");
		return ptr;
	}

};


// Class GFxUI.GFxEvent_FSCommand
// 0x185B620DEF0
class GFxEvent_FSCommand
{
public:
	unsigned char                                      UnknownData00[0x185B620DEF0];                             // 0x0000(0x185B620DEF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxEvent_FSCommand");
		return ptr;
	}

};


// Class GFxUI.GFxFSCmdHandler_Kismet
// 0x185B6D1EAB0
class GFxFSCmdHandler_Kismet
{
public:
	unsigned char                                      UnknownData00[0x185B6D1EAB0];                             // 0x0000(0x185B6D1EAB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxFSCmdHandler_Kismet");
		return ptr;
	}

};


// Class GFxUI.GFxClikWidget
// 0x185B6D1E870
class GFxClikWidget
{
public:
	unsigned char                                      UnknownData00[0x185B6D1E870];                             // 0x0000(0x185B6D1E870) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GFxUI.GFxClikWidget");
		return ptr;
	}

};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
