#pragma once

// Paladins (3.05) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PL_GameFramework_structs.hpp"

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GameFramework.DynamicSpriteComponent
// 0x185BA817120
class DynamicSpriteComponent
{
public:
	unsigned char                                      UnknownData00[0x185BA817120];                             // 0x0000(0x185BA817120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.DynamicSpriteComponent");
		return ptr;
	}

};


// Class GameFramework.FrameworkGame
// 0x185BAD94D10
class FrameworkGame
{
public:
	unsigned char                                      UnknownData00[0x185BAD94D10];                             // 0x0000(0x185BAD94D10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.FrameworkGame");
		return ptr;
	}

};


// Class GameFramework.GameAIController
// 0x185BAD988B0
class GameAIController
{
public:
	unsigned char                                      UnknownData00[0x185BAD988B0];                             // 0x0000(0x185BAD988B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAIController");
		return ptr;
	}

};


// Class GameFramework.GameAICommand
// 0x185BAD97590
class GameAICommand
{
public:
	unsigned char                                      UnknownData00[0x185BAD97590];                             // 0x0000(0x185BAD97590) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAICommand");
		return ptr;
	}

};


// Class GameFramework.GameCameraBlockingVolume
// 0x0000
class GameCameraBlockingVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCameraBlockingVolume");
		return ptr;
	}

};


// Class GameFramework.GamePlayerController
// 0x185BAD915F0
class GamePlayerController
{
public:
	unsigned char                                      UnknownData00[0x185BAD915F0];                             // 0x0000(0x185BAD915F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GamePlayerController");
		return ptr;
	}

};


// Class GameFramework.GameCheatManager
// 0x185BAD99750
class GameCheatManager
{
public:
	unsigned char                                      UnknownData00[0x185BAD99750];                             // 0x0000(0x185BAD99750) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCheatManager");
		return ptr;
	}

};


// Class GameFramework.GameCrowdAgent
// 0x185BAD9DAD0
class GameCrowdAgent
{
public:
	unsigned char                                      UnknownData00[0x185BAD9DAD0];                             // 0x0000(0x185BAD9DAD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgent");
		return ptr;
	}

};


// Class GameFramework.GameCrowdAgentSkeletal
// 0x185BAD9F030
class GameCrowdAgentSkeletal
{
public:
	unsigned char                                      UnknownData00[0x185BAD9F030];                             // 0x0000(0x185BAD9F030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentSkeletal");
		return ptr;
	}

};


// Class GameFramework.GameCrowdAgentSM
// 0x185BADA2510
class GameCrowdAgentSM
{
public:
	unsigned char                                      UnknownData00[0x185BADA2510];                             // 0x0000(0x185BADA2510) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentSM");
		return ptr;
	}

};


// Class GameFramework.GameCrowdAgentBehavior
// 0x185BAD94AD0
class GameCrowdAgentBehavior
{
public:
	unsigned char                                      UnknownData00[0x185BAD94AD0];                             // 0x0000(0x185BAD94AD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentBehavior");
		return ptr;
	}

};


// Class GameFramework.GameCrowdBehavior_PlayAnimation
// 0x185BADA18B0
class GameCrowdBehavior_PlayAnimation
{
public:
	unsigned char                                      UnknownData00[0x185BADA18B0];                             // 0x0000(0x185BADA18B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_PlayAnimation");
		return ptr;
	}

};


// Class GameFramework.GameCrowdBehavior_RunFromPanic
// 0x185BADA2E10
class GameCrowdBehavior_RunFromPanic
{
public:
	unsigned char                                      UnknownData00[0x185BADA2E10];                             // 0x0000(0x185BADA2E10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_RunFromPanic");
		return ptr;
	}

};


// Class GameFramework.GameCrowdBehavior_WaitForGroup
// 0x185BADA3DD0
class GameCrowdBehavior_WaitForGroup
{
public:
	unsigned char                                      UnknownData00[0x185BADA3DD0];                             // 0x0000(0x185BADA3DD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitForGroup");
		return ptr;
	}

};


// Class GameFramework.GameCrowdBehavior_WaitInQueue
// 0x185BADA4FD0
class GameCrowdBehavior_WaitInQueue
{
public:
	unsigned char                                      UnknownData00[0x185BADA4FD0];                             // 0x0000(0x185BADA4FD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitInQueue");
		return ptr;
	}

};


// Class GameFramework.GameCrowdGroup
// 0x185BADA21B0
class GameCrowdGroup
{
public:
	unsigned char                                      UnknownData00[0x185BADA21B0];                             // 0x0000(0x185BADA21B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdGroup");
		return ptr;
	}

};


// Class GameFramework.GameCrowdInfoVolume
// 0x185BADA1F70
class GameCrowdInfoVolume
{
public:
	unsigned char                                      UnknownData00[0x185BADA1F70];                             // 0x0000(0x185BADA1F70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInfoVolume");
		return ptr;
	}

};


// Class GameFramework.GameCrowdInteractionPoint
// 0x185BAD91170
class GameCrowdInteractionPoint
{
public:
	unsigned char                                      UnknownData00[0x185BAD91170];                             // 0x0000(0x185BAD91170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInteractionPoint");
		return ptr;
	}

};


// Class GameFramework.GameCrowdBehaviorPoint
// 0x185BADA22D0
class GameCrowdBehaviorPoint
{
public:
	unsigned char                                      UnknownData00[0x185BADA22D0];                             // 0x0000(0x185BADA22D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehaviorPoint");
		return ptr;
	}

};


// Class GameFramework.GameCrowdDestination
// 0x185BAD94BF0
class GameCrowdDestination
{
public:
	unsigned char                                      UnknownData00[0x185BAD94BF0];                             // 0x0000(0x185BAD94BF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestination");
		return ptr;
	}

};


// Class GameFramework.GameCrowdDestinationQueuePoint
// 0x185BAD93D50
class GameCrowdDestinationQueuePoint
{
public:
	unsigned char                                      UnknownData00[0x185BAD93D50];                             // 0x0000(0x185BAD93D50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestinationQueuePoint");
		return ptr;
	}

};


// Class GameFramework.GameCrowdPopulationManager
// 0x185BADA7850
class GameCrowdPopulationManager
{
public:
	unsigned char                                      UnknownData00[0x185BADA7850];                             // 0x0000(0x185BADA7850) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdPopulationManager");
		return ptr;
	}

};


// Class GameFramework.GameCrowdReplicationActor
// 0x185BBA3FB90
class GameCrowdReplicationActor
{
public:
	unsigned char                                      UnknownData00[0x185BBA3FB90];                             // 0x0000(0x185BBA3FB90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdReplicationActor");
		return ptr;
	}

};


// Class GameFramework.GameCrowdSpawnRelativeActor
// 0x0000
class GameCrowdSpawnRelativeActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdSpawnRelativeActor");
		return ptr;
	}

};


// Class GameFramework.GameDestinationConnRenderingComponent
// 0x0000
class GameDestinationConnRenderingComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameDestinationConnRenderingComponent");
		return ptr;
	}

};


// Class GameFramework.GameExplosion
// 0x185BB94B0E0
class GameExplosion
{
public:
	unsigned char                                      UnknownData00[0x185BB94B0E0];                             // 0x0000(0x185BB94B0E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameExplosion");
		return ptr;
	}

};


// Class GameFramework.GameExplosionActor
// 0x185BADA96B0
class GameExplosionActor
{
public:
	unsigned char                                      UnknownData00[0x185BADA96B0];                             // 0x0000(0x185BADA96B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameExplosionActor");
		return ptr;
	}

};


// Class GameFramework.GamePawn
// 0x185BADA7070
class GamePawn
{
public:
	unsigned char                                      UnknownData00[0x185BADA7070];                             // 0x0000(0x185BADA7070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GamePawn");
		return ptr;
	}

};


// Class GameFramework.DebugCameraController
// 0x185BAD8F790
class DebugCameraController
{
public:
	unsigned char                                      UnknownData00[0x185BAD8F790];                             // 0x0000(0x185BAD8F790) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.DebugCameraController");
		return ptr;
	}

};


// Class GameFramework.GameTypes
// 0x185BAD92B50
class GameTypes
{
public:
	unsigned char                                      UnknownData00[0x185BAD92B50];                             // 0x0000(0x185BAD92B50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameTypes");
		return ptr;
	}

};


// Class GameFramework.MobileHUD
// 0x185BADAF770
class MobileHUD
{
public:
	unsigned char                                      UnknownData00[0x185BADAF770];                             // 0x0000(0x185BADAF770) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileHUD");
		return ptr;
	}

};


// Class GameFramework.MobileInputZone
// 0x185BADB5290
class MobileInputZone
{
public:
	unsigned char                                      UnknownData00[0x185BADB5290];                             // 0x0000(0x185BADB5290) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileInputZone");
		return ptr;
	}

};


// Class GameFramework.MobileMenuObject
// 0x185BADB4510
class MobileMenuObject
{
public:
	unsigned char                                      UnknownData00[0x185BADB4510];                             // 0x0000(0x185BADB4510) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuObject");
		return ptr;
	}

};


// Class GameFramework.MobileMenuImage
// 0x185BADB3310
class MobileMenuImage
{
public:
	unsigned char                                      UnknownData00[0x185BADB3310];                             // 0x0000(0x185BADB3310) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuImage");
		return ptr;
	}

};


// Class GameFramework.MobileMenuScene
// 0x185BADAE690
class MobileMenuScene
{
public:
	unsigned char                                      UnknownData00[0x185BADAE690];                             // 0x0000(0x185BADAE690) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuScene");
		return ptr;
	}

};


// Class GameFramework.MobilePlayerInput
// 0x185BADB3F70
class MobilePlayerInput
{
public:
	unsigned char                                      UnknownData00[0x185BADB3F70];                             // 0x0000(0x185BADB3F70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobilePlayerInput");
		return ptr;
	}

};


// Class GameFramework.NavMeshGoal_OutOfViewFrom
// 0x185BAD79770
class NavMeshGoal_OutOfViewFrom
{
public:
	unsigned char                                      UnknownData00[0x185BAD79770];                             // 0x0000(0x185BAD79770) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.NavMeshGoal_OutOfViewFrom");
		return ptr;
	}

};


// Class GameFramework.NavMeshPath_BiasAgainstPolysWithinDistanceOfLocations
// 0x185BAD7A2B0
class NavMeshPath_BiasAgainstPolysWithinDistanceOfLocations
{
public:
	unsigned char                                      UnknownData00[0x185BAD7A2B0];                             // 0x0000(0x185BAD7A2B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.NavMeshPath_BiasAgainstPolysWithinDistanceOfLocations");
		return ptr;
	}

};


// Class GameFramework.SecondaryViewportClient
// 0x185BAD7A4F0
class SecondaryViewportClient
{
public:
	unsigned char                                      UnknownData00[0x185BAD7A4F0];                             // 0x0000(0x185BAD7A4F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SecondaryViewportClient");
		return ptr;
	}

};


// Class GameFramework.MobileSecondaryViewportClient
// 0x185BAD79530
class MobileSecondaryViewportClient
{
public:
	unsigned char                                      UnknownData00[0x185BAD79530];                             // 0x0000(0x185BAD79530) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileSecondaryViewportClient");
		return ptr;
	}

};


// Class GameFramework.SeqAct_ControlGameMovie
// 0x185BAF49BD0
class SeqAct_ControlGameMovie
{
public:
	unsigned char                                      UnknownData00[0x185BAF49BD0];                             // 0x0000(0x185BAF49BD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_ControlGameMovie");
		return ptr;
	}

};


// Class GameFramework.SeqAct_Deproject
// 0x185BAF4B610
class SeqAct_Deproject
{
public:
	unsigned char                                      UnknownData00[0x185BAF4B610];                             // 0x0000(0x185BAF4B610) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_Deproject");
		return ptr;
	}

};


// Class GameFramework.SeqAct_GameCrowdPopulationManagerToggle
// 0x185BAD787B0
class SeqAct_GameCrowdPopulationManagerToggle
{
public:
	unsigned char                                      UnknownData00[0x185BAD787B0];                             // 0x0000(0x185BAD787B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_GameCrowdPopulationManagerToggle");
		return ptr;
	}

};


// Class GameFramework.SeqAct_GameCrowdSpawner
// 0x185BAD7C6B0
class SeqAct_GameCrowdSpawner
{
public:
	unsigned char                                      UnknownData00[0x185BAD7C6B0];                             // 0x0000(0x185BAD7C6B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_GameCrowdSpawner");
		return ptr;
	}

};


// Class GameFramework.SeqAct_MobileAddInputZones
// 0x185BAF4AB90
class SeqAct_MobileAddInputZones
{
public:
	unsigned char                                      UnknownData00[0x185BAF4AB90];                             // 0x0000(0x185BAF4AB90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_MobileAddInputZones");
		return ptr;
	}

};


// Class GameFramework.SeqAct_MobileClearInputZones
// 0x0000
class SeqAct_MobileClearInputZones
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_MobileClearInputZones");
		return ptr;
	}

};


// Class GameFramework.SeqAct_MobileRemoveInputZone
// 0x185BAF4AC50
class SeqAct_MobileRemoveInputZone
{
public:
	unsigned char                                      UnknownData00[0x185BAF4AC50];                             // 0x0000(0x185BAF4AC50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_MobileRemoveInputZone");
		return ptr;
	}

};


// Class GameFramework.SeqAct_MobileSaveLoadValue
// 0x185BAD79890
class SeqAct_MobileSaveLoadValue
{
public:
	unsigned char                                      UnknownData00[0x185BAD79890];                             // 0x0000(0x185BAD79890) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_MobileSaveLoadValue");
		return ptr;
	}

};


// Class GameFramework.SeqAct_ModifyProperty
// 0x185BAF4AF50
class SeqAct_ModifyProperty
{
public:
	unsigned char                                      UnknownData00[0x185BAF4AF50];                             // 0x0000(0x185BAF4AF50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_ModifyProperty");
		return ptr;
	}

};


// Class GameFramework.SeqAct_PlayAgentAnimation
// 0x185BAD799B0
class SeqAct_PlayAgentAnimation
{
public:
	unsigned char                                      UnknownData00[0x185BAD799B0];                             // 0x0000(0x185BAD799B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_PlayAgentAnimation");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_CrowdAgentReachedDestination
// 0x0000
class SeqEvent_CrowdAgentReachedDestination
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_CrowdAgentReachedDestination");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_HudRender
// 0x185BAD7C230
class SeqEvent_HudRender
{
public:
	unsigned char                                      UnknownData00[0x185BAD7C230];                             // 0x0000(0x185BAD7C230) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_HudRender");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileBase
// 0x185BAD79E30
class SeqEvent_MobileBase
{
public:
	unsigned char                                      UnknownData00[0x185BAD79E30];                             // 0x0000(0x185BAD79E30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileBase");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileMotion
// 0x185BAD788D0
class SeqEvent_MobileMotion
{
public:
	unsigned char                                      UnknownData00[0x185BAD788D0];                             // 0x0000(0x185BAD788D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileMotion");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileZoneBase
// 0x185BAD7C7D0
class SeqEvent_MobileZoneBase
{
public:
	unsigned char                                      UnknownData00[0x185BAD7C7D0];                             // 0x0000(0x185BAD7C7D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileZoneBase");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileButton
// 0x185BAF513D0
class SeqEvent_MobileButton
{
public:
	unsigned char                                      UnknownData00[0x185BAF513D0];                             // 0x0000(0x185BAF513D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileButton");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileInput
// 0x185BAF50E90
class SeqEvent_MobileInput
{
public:
	unsigned char                                      UnknownData00[0x185BAF50E90];                             // 0x0000(0x185BAF50E90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileInput");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileLook
// 0x185BAF4FED0
class SeqEvent_MobileLook
{
public:
	unsigned char                                      UnknownData00[0x185BAF4FED0];                             // 0x0000(0x185BAF4FED0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileLook");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileRawInput
// 0x185BAD7ACD0
class SeqEvent_MobileRawInput
{
public:
	unsigned char                                      UnknownData00[0x185BAD7ACD0];                             // 0x0000(0x185BAD7ACD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileRawInput");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileObjectPicker
// 0x185BAF51310
class SeqEvent_MobileObjectPicker
{
public:
	unsigned char                                      UnknownData00[0x185BAF51310];                             // 0x0000(0x185BAF51310) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileObjectPicker");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileSwipe
// 0x185BAF4F750
class SeqEvent_MobileSwipe
{
public:
	unsigned char                                      UnknownData00[0x185BAF4F750];                             // 0x0000(0x185BAF4F750) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileSwipe");
		return ptr;
	}

};


// Class GameFramework.GameSkelCtrl_Recoil
// 0x185BADA86F0
class GameSkelCtrl_Recoil
{
public:
	unsigned char                                      UnknownData00[0x185BADA86F0];                             // 0x0000(0x185BADA86F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameSkelCtrl_Recoil");
		return ptr;
	}

};


// Class GameFramework.GameCameraBase
// 0x185BAD9A4D0
class GameCameraBase
{
public:
	unsigned char                                      UnknownData00[0x185BAD9A4D0];                             // 0x0000(0x185BAD9A4D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCameraBase");
		return ptr;
	}

};


// Class GameFramework.GameThirdPersonCamera
// 0x185BADAA670
class GameThirdPersonCamera
{
public:
	unsigned char                                      UnknownData00[0x185BADAA670];                             // 0x0000(0x185BADAA670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameThirdPersonCamera");
		return ptr;
	}

};


// Class GameFramework.GamePlayerCamera
// 0x185BADA7730
class GamePlayerCamera
{
public:
	unsigned char                                      UnknownData00[0x185BADA7730];                             // 0x0000(0x185BADA7730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GamePlayerCamera");
		return ptr;
	}

};


// Class GameFramework.GameThirdPersonCameraMode
// 0x185BADAD370
class GameThirdPersonCameraMode
{
public:
	unsigned char                                      UnknownData00[0x185BADAD370];                             // 0x0000(0x185BADAD370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameThirdPersonCameraMode");
		return ptr;
	}

};


// Class GameFramework.GameThirdPersonCameraMode_Default
// 0x185BB2EA0F0
class GameThirdPersonCameraMode_Default
{
public:
	unsigned char                                      UnknownData00[0x185BB2EA0F0];                             // 0x0000(0x185BB2EA0F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameThirdPersonCameraMode_Default");
		return ptr;
	}

};


// Class GameFramework.GameSpecialMove
// 0x185BADAC170
class GameSpecialMove
{
public:
	unsigned char                                      UnknownData00[0x185BADAC170];                             // 0x0000(0x185BADAC170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameSpecialMove");
		return ptr;
	}

};


// Class GameFramework.GameStateObject
// 0x185BADAC950
class GameStateObject
{
public:
	unsigned char                                      UnknownData00[0x185BADAC950];                             // 0x0000(0x185BADAC950) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameStateObject");
		return ptr;
	}

};


// Class GameFramework.GameStatsAggregator
// 0x185BADA98F0
class GameStatsAggregator
{
public:
	unsigned char                                      UnknownData00[0x185BADA98F0];                             // 0x0000(0x185BADA98F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameStatsAggregator");
		return ptr;
	}

};


// Class GameFramework.SeqAct_ToggleMouseCursor
// 0x0000
class SeqAct_ToggleMouseCursor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_ToggleMouseCursor");
		return ptr;
	}

};


// Class GameFramework.GameWaveForms
// 0x185BA803DA0
class GameWaveForms
{
public:
	unsigned char                                      UnknownData00[0x185BA803DA0];                             // 0x0000(0x185BA803DA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameWaveForms");
		return ptr;
	}

};


// Class GameFramework.DebugCameraHUD
// 0x185BAD92250
class DebugCameraHUD
{
public:
	unsigned char                                      UnknownData00[0x185BAD92250];                             // 0x0000(0x185BAD92250) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.DebugCameraHUD");
		return ptr;
	}

};


// Class GameFramework.DebugCameraInput
// 0x185BAD8F0D0
class DebugCameraInput
{
public:
	unsigned char                                      UnknownData00[0x185BAD8F0D0];                             // 0x0000(0x185BAD8F0D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.DebugCameraInput");
		return ptr;
	}

};


// Class GameFramework.GameCrowdSpawnerInterface
// 0x185BAD9F6F0
class GameCrowdSpawnerInterface
{
public:
	unsigned char                                      UnknownData00[0x185BAD9F6F0];                             // 0x0000(0x185BAD9F6F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdSpawnerInterface");
		return ptr;
	}

};


// Class GameFramework.GameCrowdSpawnInterface
// 0x185BADA8810
class GameCrowdSpawnInterface
{
public:
	unsigned char                                      UnknownData00[0x185BADA8810];                             // 0x0000(0x185BADA8810) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdSpawnInterface");
		return ptr;
	}

};


// Class GameFramework.DynamicGameCrowdDestination
// 0x0000
class DynamicGameCrowdDestination
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.DynamicGameCrowdDestination");
		return ptr;
	}

};


// Class GameFramework.GameAICmd_Hover_MoveToGoal
// 0x185BAD96930
class GameAICmd_Hover_MoveToGoal
{
public:
	unsigned char                                      UnknownData00[0x185BAD96930];                             // 0x0000(0x185BAD96930) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAICmd_Hover_MoveToGoal");
		return ptr;
	}

};


// Class GameFramework.GameAICmd_Hover_MoveToGoal_Mesh
// 0x185BAD99CF0
class GameAICmd_Hover_MoveToGoal_Mesh
{
public:
	unsigned char                                      UnknownData00[0x185BAD99CF0];                             // 0x0000(0x185BAD99CF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAICmd_Hover_MoveToGoal_Mesh");
		return ptr;
	}

};


// Class GameFramework.GameCrowd_ListOfAgents
// 0x185BA825A60
class GameCrowd_ListOfAgents
{
public:
	unsigned char                                      UnknownData00[0x185BA825A60];                             // 0x0000(0x185BA825A60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowd_ListOfAgents");
		return ptr;
	}

};


// Class GameFramework.GameCrowdInteractionDestination
// 0x0000
class GameCrowdInteractionDestination
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInteractionDestination");
		return ptr;
	}

};


// Class GameFramework.GameExplosionContent
// 0x185B6242270
class GameExplosionContent
{
public:
	unsigned char                                      UnknownData00[0x185B6242270];                             // 0x0000(0x185B6242270) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameExplosionContent");
		return ptr;
	}

};


// Class GameFramework.GameFixedCamera
// 0x185BADA5D50
class GameFixedCamera
{
public:
	unsigned char                                      UnknownData00[0x185BADA5D50];                             // 0x0000(0x185BADA5D50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameFixedCamera");
		return ptr;
	}

};


// Class GameFramework.GameKActorSpawnableEffect
// 0x185BBA3F500
class GameKActorSpawnableEffect
{
public:
	unsigned char                                      UnknownData00[0x185BBA3F500];                             // 0x0000(0x185BBA3F500) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameKActorSpawnableEffect");
		return ptr;
	}

};


// Class GameFramework.MobileDebugCameraController
// 0x185BADB0A90
class MobileDebugCameraController
{
public:
	unsigned char                                      UnknownData00[0x185BADB0A90];                             // 0x0000(0x185BADB0A90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileDebugCameraController");
		return ptr;
	}

};


// Class GameFramework.MobileDebugCameraInput
// 0x185BADB5B90
class MobileDebugCameraInput
{
public:
	unsigned char                                      UnknownData00[0x185BADB5B90];                             // 0x0000(0x185BADB5B90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileDebugCameraInput");
		return ptr;
	}

};


// Class GameFramework.MobileDebugCameraHUD
// 0x185BADAEF90
class MobileDebugCameraHUD
{
public:
	unsigned char                                      UnknownData00[0x185BADAEF90];                             // 0x0000(0x185BADAEF90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileDebugCameraHUD");
		return ptr;
	}

};


// Class GameFramework.MobileMenuBar
// 0x185BADB5EF0
class MobileMenuBar
{
public:
	unsigned char                                      UnknownData00[0x185BADB5EF0];                             // 0x0000(0x185BADB5EF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuBar");
		return ptr;
	}

};


// Class GameFramework.MobileMenuBarItem
// 0x185BADB5A70
class MobileMenuBarItem
{
public:
	unsigned char                                      UnknownData00[0x185BADB5A70];                             // 0x0000(0x185BADB5A70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuBarItem");
		return ptr;
	}

};


// Class GameFramework.MobileMenuButton
// 0x185BADB41B0
class MobileMenuButton
{
public:
	unsigned char                                      UnknownData00[0x185BADB41B0];                             // 0x0000(0x185BADB41B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuButton");
		return ptr;
	}

};


// Class GameFramework.MobileMenuElement
// 0x185BADB2C50
class MobileMenuElement
{
public:
	unsigned char                                      UnknownData00[0x185BADB2C50];                             // 0x0000(0x185BADB2C50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuElement");
		return ptr;
	}

};


// Class GameFramework.MobileMenuGame
// 0x185BADB39D0
class MobileMenuGame
{
public:
	unsigned char                                      UnknownData00[0x185BADB39D0];                             // 0x0000(0x185BADB39D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuGame");
		return ptr;
	}

};


// Class GameFramework.MobileMenuPlayerController
// 0x0000
class MobileMenuPlayerController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuPlayerController");
		return ptr;
	}

};


// Class GameFramework.MobileMenuInventory
// 0x185BADB2E90
class MobileMenuInventory
{
public:
	unsigned char                                      UnknownData00[0x185BADB2E90];                             // 0x0000(0x185BADB2E90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuInventory");
		return ptr;
	}

};


// Class GameFramework.MobileMenuLabel
// 0x185BADB30D0
class MobileMenuLabel
{
public:
	unsigned char                                      UnknownData00[0x185BADB30D0];                             // 0x0000(0x185BADB30D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuLabel");
		return ptr;
	}

};


// Class GameFramework.MobileMenuList
// 0x185BADB8E30
class MobileMenuList
{
public:
	unsigned char                                      UnknownData00[0x185BADB8E30];                             // 0x0000(0x185BADB8E30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuList");
		return ptr;
	}

};


// Class GameFramework.MobileMenuListItem
// 0x185BADB8530
class MobileMenuListItem
{
public:
	unsigned char                                      UnknownData00[0x185BADB8530];                             // 0x0000(0x185BADB8530) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuListItem");
		return ptr;
	}

};


// Class GameFramework.MobileMenuObjectProxy
// 0x185BADB8D10
class MobileMenuObjectProxy
{
public:
	unsigned char                                      UnknownData00[0x185BADB8D10];                             // 0x0000(0x185BADB8D10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileMenuObjectProxy");
		return ptr;
	}

};


// Class GameFramework.MobileTouchInputVolume
// 0x185BAD7B4B0
class MobileTouchInputVolume
{
public:
	unsigned char                                      UnknownData00[0x185BAD7B4B0];                             // 0x0000(0x185BAD7B4B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.MobileTouchInputVolume");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_MobileTouchInputVolume
// 0x0000
class SeqEvent_MobileTouchInputVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_MobileTouchInputVolume");
		return ptr;
	}

};


// Class GameFramework.TouchableElement3D
// 0x185BAD7B810
class TouchableElement3D
{
public:
	unsigned char                                      UnknownData00[0x185BAD7B810];                             // 0x0000(0x185BAD7B810) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.TouchableElement3D");
		return ptr;
	}

};


// Class GameFramework.PlayerCollectorGame
// 0x185BAD78B10
class PlayerCollectorGame
{
public:
	unsigned char                                      UnknownData00[0x185BAD78B10];                             // 0x0000(0x185BAD78B10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.PlayerCollectorGame");
		return ptr;
	}

};


// Class GameFramework.PMESTG_LeaveADecalBase
// 0x185BC24E140
class PMESTG_LeaveADecalBase
{
public:
	unsigned char                                      UnknownData00[0x185BC24E140];                             // 0x0000(0x185BC24E140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.PMESTG_LeaveADecalBase");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_HudRenderImage
// 0x185BAD7B930
class SeqEvent_HudRenderImage
{
public:
	unsigned char                                      UnknownData00[0x185BAD7B930];                             // 0x0000(0x185BAD7B930) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_HudRenderImage");
		return ptr;
	}

};


// Class GameFramework.SeqEvent_HudRenderText
// 0x185BAD7BDB0
class SeqEvent_HudRenderText
{
public:
	unsigned char                                      UnknownData00[0x185BAD7BDB0];                             // 0x0000(0x185BAD7BDB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqEvent_HudRenderText");
		return ptr;
	}

};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
