#pragma once

// Paladins (3.05) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PL_IpDrv_structs.hpp"

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class IpDrv.ClientBeaconAddressResolver
// 0x185B620EAF0
class ClientBeaconAddressResolver
{
public:
	unsigned char                                      UnknownData00[0x185B620EAF0];                             // 0x0000(0x185B620EAF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.ClientBeaconAddressResolver");
		return ptr;
	}

};


// Class IpDrv.HTTPDownload
// 0x185ABC2C880
class HTTPDownload
{
public:
	unsigned char                                      UnknownData00[0x185ABC2C880];                             // 0x0000(0x185ABC2C880) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.HTTPDownload");
		return ptr;
	}

};


// Class IpDrv.InternetLink
// 0x185B6D1ECF0
class InternetLink
{
public:
	unsigned char                                      UnknownData00[0x185B6D1ECF0];                             // 0x0000(0x185B6D1ECF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.InternetLink");
		return ptr;
	}

};


// Class IpDrv.TcpLink
// 0x185BAD8DED0
class TcpLink
{
public:
	unsigned char                                      UnknownData00[0x185BAD8DED0];                             // 0x0000(0x185BAD8DED0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.TcpLink");
		return ptr;
	}

};


// Class IpDrv.McpServiceBase
// 0x185B6D1EF30
class McpServiceBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D1EF30];                             // 0x0000(0x185B6D1EF30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpServiceBase");
		return ptr;
	}

};


// Class IpDrv.MCPBase
// 0x185B62124B0
class MCPBase
{
public:
	unsigned char                                      UnknownData00[0x185B62124B0];                             // 0x0000(0x185B62124B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.MCPBase");
		return ptr;
	}

};


// Class IpDrv.OnlineEventsInterfaceMcp
// 0x185B6D3CB10
class OnlineEventsInterfaceMcp
{
public:
	unsigned char                                      UnknownData00[0x185B6D3CB10];                             // 0x0000(0x185B6D3CB10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineEventsInterfaceMcp");
		return ptr;
	}

};


// Class IpDrv.OnlineNewsInterfaceMcp
// 0x185BAD833D0
class OnlineNewsInterfaceMcp
{
public:
	unsigned char                                      UnknownData00[0x185BAD833D0];                             // 0x0000(0x185BAD833D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineNewsInterfaceMcp");
		return ptr;
	}

};


// Class IpDrv.OnlineTitleFileDownloadBase
// 0x185B6D23070
class OnlineTitleFileDownloadBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D23070];                             // 0x0000(0x185B6D23070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineTitleFileDownloadBase");
		return ptr;
	}

};


// Class IpDrv.OnlineTitleFileDownloadMcp
// 0x185BAD87510
class OnlineTitleFileDownloadMcp
{
public:
	unsigned char                                      UnknownData00[0x185BAD87510];                             // 0x0000(0x185BAD87510) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineTitleFileDownloadMcp");
		return ptr;
	}

};


// Class IpDrv.OnlineTitleFileDownloadWeb
// 0x185B6D256B0
class OnlineTitleFileDownloadWeb
{
public:
	unsigned char                                      UnknownData00[0x185B6D256B0];                             // 0x0000(0x185B6D256B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineTitleFileDownloadWeb");
		return ptr;
	}

};


// Class IpDrv.TitleFileDownloadCache
// 0x185BAD8D5D0
class TitleFileDownloadCache
{
public:
	unsigned char                                      UnknownData00[0x185BAD8D5D0];                             // 0x0000(0x185BAD8D5D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.TitleFileDownloadCache");
		return ptr;
	}

};


// Class IpDrv.McpMessageBase
// 0x185B6D2B1D0
class McpMessageBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D2B1D0];                             // 0x0000(0x185B6D2B1D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpMessageBase");
		return ptr;
	}

};


// Class IpDrv.McpMessageManager
// 0x185B6D2CCD0
class McpMessageManager
{
public:
	unsigned char                                      UnknownData00[0x185B6D2CCD0];                             // 0x0000(0x185B6D2CCD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpMessageManager");
		return ptr;
	}

};


// Class IpDrv.McpUserCloudFileDownload
// 0x185B6D32FD0
class McpUserCloudFileDownload
{
public:
	unsigned char                                      UnknownData00[0x185B6D32FD0];                             // 0x0000(0x185B6D32FD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpUserCloudFileDownload");
		return ptr;
	}

};


// Class IpDrv.MeshBeacon
// 0x185B6D365D0
class MeshBeacon
{
public:
	unsigned char                                      UnknownData00[0x185B6D365D0];                             // 0x0000(0x185B6D365D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.MeshBeacon");
		return ptr;
	}

};


// Class IpDrv.MeshBeaconClient
// 0x185B6D37590
class MeshBeaconClient
{
public:
	unsigned char                                      UnknownData00[0x185B6D37590];                             // 0x0000(0x185B6D37590) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.MeshBeaconClient");
		return ptr;
	}

};


// Class IpDrv.MeshBeaconHost
// 0x185B6D38550
class MeshBeaconHost
{
public:
	unsigned char                                      UnknownData00[0x185B6D38550];                             // 0x0000(0x185B6D38550) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.MeshBeaconHost");
		return ptr;
	}

};


// Class IpDrv.OnlineSubsystemCommonImpl
// 0x185BAD88B90
class OnlineSubsystemCommonImpl
{
public:
	unsigned char                                      UnknownData00[0x185BAD88B90];                             // 0x0000(0x185BAD88B90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineSubsystemCommonImpl");
		return ptr;
	}

};


// Class IpDrv.OnlineAuthInterfaceImpl
// 0x185B6D3C330
class OnlineAuthInterfaceImpl
{
public:
	unsigned char                                      UnknownData00[0x185B6D3C330];                             // 0x0000(0x185B6D3C330) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineAuthInterfaceImpl");
		return ptr;
	}

};


// Class IpDrv.OnlineGameInterfaceImpl
// 0x185BAD82BF0
class OnlineGameInterfaceImpl
{
public:
	unsigned char                                      UnknownData00[0x185BAD82BF0];                             // 0x0000(0x185BAD82BF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineGameInterfaceImpl");
		return ptr;
	}

};


// Class IpDrv.OnlineImageDownloaderWebHelper
// 0x185BAD83850
class OnlineImageDownloaderWebHelper
{
public:
	unsigned char                                      UnknownData00[0x185BAD83850];                             // 0x0000(0x185BAD83850) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineImageDownloaderWebHelper");
		return ptr;
	}

};


// Class IpDrv.OnlinePlaylistManager
// 0x185BAD86F70
class OnlinePlaylistManager
{
public:
	unsigned char                                      UnknownData00[0x185BAD86F70];                             // 0x0000(0x185BAD86F70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlinePlaylistManager");
		return ptr;
	}

};


// Class IpDrv.PartyBeacon
// 0x185BAD87F30
class PartyBeacon
{
public:
	unsigned char                                      UnknownData00[0x185BAD87F30];                             // 0x0000(0x185BAD87F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.PartyBeacon");
		return ptr;
	}

};


// Class IpDrv.PartyBeaconClient
// 0x185BAD87090
class PartyBeaconClient
{
public:
	unsigned char                                      UnknownData00[0x185BAD87090];                             // 0x0000(0x185BAD87090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.PartyBeaconClient");
		return ptr;
	}

};


// Class IpDrv.PartyBeaconHost
// 0x185BAD89370
class PartyBeaconHost
{
public:
	unsigned char                                      UnknownData00[0x185BAD89370];                             // 0x0000(0x185BAD89370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.PartyBeaconHost");
		return ptr;
	}

};


// Class IpDrv.TcpipConnection
// 0x0000
class TcpipConnection
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.TcpipConnection");
		return ptr;
	}

};


// Class IpDrv.TcpNetDriver
// 0x185ABC2BB00
class TcpNetDriver
{
public:
	unsigned char                                      UnknownData00[0x185ABC2BB00];                             // 0x0000(0x185ABC2BB00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.TcpNetDriver");
		return ptr;
	}

};


// Class IpDrv.WebRequest
// 0x185BAD8A570
class WebRequest
{
public:
	unsigned char                                      UnknownData00[0x185BAD8A570];                             // 0x0000(0x185BAD8A570) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.WebRequest");
		return ptr;
	}

};


// Class IpDrv.WebResponse
// 0x185BAD8FD30
class WebResponse
{
public:
	unsigned char                                      UnknownData00[0x185BAD8FD30];                             // 0x0000(0x185BAD8FD30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.WebResponse");
		return ptr;
	}

};


// Class IpDrv.OnlinePlaylistProvider
// 0x185BA7F28E0
class OnlinePlaylistProvider
{
public:
	unsigned char                                      UnknownData00[0x185BA7F28E0];                             // 0x0000(0x185BA7F28E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlinePlaylistProvider");
		return ptr;
	}

};


// Class IpDrv.UIDataStore_OnlinePlaylists
// 0x185BAD8AD50
class UIDataStore_OnlinePlaylists
{
public:
	unsigned char                                      UnknownData00[0x185BAD8AD50];                             // 0x0000(0x185BAD8AD50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.UIDataStore_OnlinePlaylists");
		return ptr;
	}

};


// Class IpDrv.WebApplication
// 0x185B6D1EBD0
class WebApplication
{
public:
	unsigned char                                      UnknownData00[0x185B6D1EBD0];                             // 0x0000(0x185B6D1EBD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.WebApplication");
		return ptr;
	}

};


// Class IpDrv.WebServer
// 0x185BAD8B530
class WebServer
{
public:
	unsigned char                                      UnknownData00[0x185BAD8B530];                             // 0x0000(0x185BAD8B530) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.WebServer");
		return ptr;
	}

};


// Class IpDrv.HelloWeb
// 0x185B6D1F3B0
class HelloWeb
{
public:
	unsigned char                                      UnknownData00[0x185B6D1F3B0];                             // 0x0000(0x185B6D1F3B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.HelloWeb");
		return ptr;
	}

};


// Class IpDrv.ImageServer
// 0x185B6D20010
class ImageServer
{
public:
	unsigned char                                      UnknownData00[0x185B6D20010];                             // 0x0000(0x185B6D20010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.ImageServer");
		return ptr;
	}

};


// Class IpDrv.McpServiceConfig
// 0x185B6D1F050
class McpServiceConfig
{
public:
	unsigned char                                      UnknownData00[0x185B6D1F050];                             // 0x0000(0x185B6D1F050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpServiceConfig");
		return ptr;
	}

};


// Class IpDrv.McpClashMobBase
// 0x185B6D24810
class McpClashMobBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D24810];                             // 0x0000(0x185B6D24810) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpClashMobBase");
		return ptr;
	}

};


// Class IpDrv.McpClashMobFileDownload
// 0x185B6D229B0
class McpClashMobFileDownload
{
public:
	unsigned char                                      UnknownData00[0x185B6D229B0];                             // 0x0000(0x185B6D229B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpClashMobFileDownload");
		return ptr;
	}

};


// Class IpDrv.McpClashMobManager
// 0x185B6D24DB0
class McpClashMobManager
{
public:
	unsigned char                                      UnknownData00[0x185B6D24DB0];                             // 0x0000(0x185B6D24DB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpClashMobManager");
		return ptr;
	}

};


// Class IpDrv.McpGroupsBase
// 0x185B6D27F30
class McpGroupsBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D27F30];                             // 0x0000(0x185B6D27F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpGroupsBase");
		return ptr;
	}

};


// Class IpDrv.McpGroupsManager
// 0x185B6D269D0
class McpGroupsManager
{
public:
	unsigned char                                      UnknownData00[0x185B6D269D0];                             // 0x0000(0x185B6D269D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpGroupsManager");
		return ptr;
	}

};


// Class IpDrv.McpIdMappingBase
// 0x185B6D29130
class McpIdMappingBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D29130];                             // 0x0000(0x185B6D29130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpIdMappingBase");
		return ptr;
	}

};


// Class IpDrv.McpIdMappingManager
// 0x185B6D273F0
class McpIdMappingManager
{
public:
	unsigned char                                      UnknownData00[0x185B6D273F0];                             // 0x0000(0x185B6D273F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpIdMappingManager");
		return ptr;
	}

};


// Class IpDrv.McpManagedValueManagerBase
// 0x185B6D284D0
class McpManagedValueManagerBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D284D0];                             // 0x0000(0x185B6D284D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpManagedValueManagerBase");
		return ptr;
	}

};


// Class IpDrv.McpManagedValueManager
// 0x185B6D2AE70
class McpManagedValueManager
{
public:
	unsigned char                                      UnknownData00[0x185B6D2AE70];                             // 0x0000(0x185B6D2AE70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpManagedValueManager");
		return ptr;
	}

};


// Class IpDrv.McpServerTimeBase
// 0x185B6D2CF10
class McpServerTimeBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D2CF10];                             // 0x0000(0x185B6D2CF10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpServerTimeBase");
		return ptr;
	}

};


// Class IpDrv.McpServerTimeManager
// 0x185B6D2D150
class McpServerTimeManager
{
public:
	unsigned char                                      UnknownData00[0x185B6D2D150];                             // 0x0000(0x185B6D2D150) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpServerTimeManager");
		return ptr;
	}

};


// Class IpDrv.McpUserInventoryBase
// 0x185B6D30F30
class McpUserInventoryBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D30F30];                             // 0x0000(0x185B6D30F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpUserInventoryBase");
		return ptr;
	}

};


// Class IpDrv.McpUserInventoryManager
// 0x185B6D35DF0
class McpUserInventoryManager
{
public:
	unsigned char                                      UnknownData00[0x185B6D35DF0];                             // 0x0000(0x185B6D35DF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpUserInventoryManager");
		return ptr;
	}

};


// Class IpDrv.McpUserManagerBase
// 0x185B6D364B0
class McpUserManagerBase
{
public:
	unsigned char                                      UnknownData00[0x185B6D364B0];                             // 0x0000(0x185B6D364B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpUserManagerBase");
		return ptr;
	}

};


// Class IpDrv.McpUserManager
// 0x185B6D35070
class McpUserManager
{
public:
	unsigned char                                      UnknownData00[0x185B6D35070];                             // 0x0000(0x185B6D35070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.McpUserManager");
		return ptr;
	}

};


// Class IpDrv.OnlineImageDownloaderWeb
// 0x185BAD83970
class OnlineImageDownloaderWeb
{
public:
	unsigned char                                      UnknownData00[0x185BAD83970];                             // 0x0000(0x185BAD83970) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.OnlineImageDownloaderWeb");
		return ptr;
	}

};


// Class IpDrv.WebConnection
// 0x185BAD8C3D0
class WebConnection
{
public:
	unsigned char                                      UnknownData00[0x185BAD8C3D0];                             // 0x0000(0x185BAD8C3D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class IpDrv.WebConnection");
		return ptr;
	}

};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
