#pragma once

// Paladins (3.05) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PL_PlatformCommon_structs.hpp"

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class PlatformCommon.PComBrowserInteraction
// 0x185BAF4FC90
class PComBrowserInteraction
{
public:
	unsigned char                                      UnknownData00[0x185BAF4FC90];                             // 0x0000(0x185BAF4FC90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComBrowserInteraction");
		return ptr;
	}

};


// Class PlatformCommon.PComBrowserManager
// 0x185BAD78210
class PComBrowserManager
{
public:
	unsigned char                                      UnknownData00[0x185BAD78210];                             // 0x0000(0x185BAD78210) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComBrowserManager");
		return ptr;
	}

};


// Class PlatformCommon.PComCheatManager
// 0x0000
class PComCheatManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComCheatManager");
		return ptr;
	}

};


// Class PlatformCommon.PComGameEngine
// 0x185BAD78690
class PComGameEngine
{
public:
	unsigned char                                      UnknownData00[0x185BAD78690];                             // 0x0000(0x185BAD78690) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComGameEngine");
		return ptr;
	}

};


// Class PlatformCommon.PComGameViewportClient
// 0x185BB479670
class PComGameViewportClient
{
public:
	unsigned char                                      UnknownData00[0x185BB479670];                             // 0x0000(0x185BB479670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComGameViewportClient");
		return ptr;
	}

};


// Class PlatformCommon.PComImageDownloader
// 0x185BB4798B0
class PComImageDownloader
{
public:
	unsigned char                                      UnknownData00[0x185BB4798B0];                             // 0x0000(0x185BB4798B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComImageDownloader");
		return ptr;
	}

};


// Class PlatformCommon.PComInputLightingEffect
// 0x185BB47CA30
class PComInputLightingEffect
{
public:
	unsigned char                                      UnknownData00[0x185BB47CA30];                             // 0x0000(0x185BB47CA30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComInputLightingEffect");
		return ptr;
	}

};


// Class PlatformCommon.PComJsonHandler
// 0x185BB47AE10
class PComJsonHandler
{
public:
	unsigned char                                      UnknownData00[0x185BB47AE10];                             // 0x0000(0x185BB47AE10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComJsonHandler");
		return ptr;
	}

};


// Class PlatformCommon.PComOpenBroadcaster
// 0x185BB47B050
class PComOpenBroadcaster
{
public:
	unsigned char                                      UnknownData00[0x185BB47B050];                             // 0x0000(0x185BB47B050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComOpenBroadcaster");
		return ptr;
	}

};


// Class PlatformCommon.PComPerformanceCaptureBase
// 0x185BB47A990
class PComPerformanceCaptureBase
{
public:
	unsigned char                                      UnknownData00[0x185BB47A990];                             // 0x0000(0x185BB47A990) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPerformanceCaptureBase");
		return ptr;
	}

};


// Class PlatformCommon.PComPerformanceCaptureGame
// 0x185BB478C50
class PComPerformanceCaptureGame
{
public:
	unsigned char                                      UnknownData00[0x185BB478C50];                             // 0x0000(0x185BB478C50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPerformanceCaptureGame");
		return ptr;
	}

};


// Class PlatformCommon.PComPerformanceCaptureNode
// 0x185B4EDF630
class PComPerformanceCaptureNode
{
public:
	unsigned char                                      UnknownData00[0x185B4EDF630];                             // 0x0000(0x185B4EDF630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPerformanceCaptureNode");
		return ptr;
	}

};


// Class PlatformCommon.PComPictureInPicture
// 0x185BB478FB0
class PComPictureInPicture
{
public:
	unsigned char                                      UnknownData00[0x185BB478FB0];                             // 0x0000(0x185BB478FB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPictureInPicture");
		return ptr;
	}

};


// Class PlatformCommon.PComPictureInPictureScene
// 0x185BB47EE30
class PComPictureInPictureScene
{
public:
	unsigned char                                      UnknownData00[0x185BB47EE30];                             // 0x0000(0x185BB47EE30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPictureInPictureScene");
		return ptr;
	}

};


// Class PlatformCommon.PComPlayerController
// 0x185BB48A7D0
class PComPlayerController
{
public:
	unsigned char                                      UnknownData00[0x185BB48A7D0];                             // 0x0000(0x185BB48A7D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPlayerController");
		return ptr;
	}

};


// Class PlatformCommon.PComPlayerInput
// 0x185BB489930
class PComPlayerInput
{
public:
	unsigned char                                      UnknownData00[0x185BB489930];                             // 0x0000(0x185BB489930) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPlayerInput");
		return ptr;
	}

};


// Class PlatformCommon.PComPlayerProfile
// 0x185BADE8150
class PComPlayerProfile
{
public:
	unsigned char                                      UnknownData00[0x185BADE8150];                             // 0x0000(0x185BADE8150) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPlayerProfile");
		return ptr;
	}

};


// Class PlatformCommon.PComPositionHistoryComponent
// 0x0000
class PComPositionHistoryComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPositionHistoryComponent");
		return ptr;
	}

};


// Class PlatformCommon.PComPositionHistoryServerComponent
// 0x185BB489B70
class PComPositionHistoryServerComponent
{
public:
	unsigned char                                      UnknownData00[0x185BB489B70];                             // 0x0000(0x185BB489B70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComPositionHistoryServerComponent");
		return ptr;
	}

};


// Class PlatformCommon.PComRepInfo_Game
// 0x185BB486E70
class PComRepInfo_Game
{
public:
	unsigned char                                      UnknownData00[0x185BB486E70];                             // 0x0000(0x185BB486E70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComRepInfo_Game");
		return ptr;
	}

};


// Class PlatformCommon.PComStructures
// 0x185BB486F90
class PComStructures
{
public:
	unsigned char                                      UnknownData00[0x185BB486F90];                             // 0x0000(0x185BB486F90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComStructures");
		return ptr;
	}

};


// Class PlatformCommon.PComSupportCommands
// 0x185BB48C090
class PComSupportCommands
{
public:
	unsigned char                                      UnknownData00[0x185BB48C090];                             // 0x0000(0x185BB48C090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComSupportCommands");
		return ptr;
	}

};


// Class PlatformCommon.PComUIManagerBase
// 0x185BB48EC70
class PComUIManagerBase
{
public:
	unsigned char                                      UnknownData00[0x185BB48EC70];                             // 0x0000(0x185BB48EC70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComUIManagerBase");
		return ptr;
	}

};


// Class PlatformCommon.PComUtilityFunctions
// 0x185BB48E250
class PComUtilityFunctions
{
public:
	unsigned char                                      UnknownData00[0x185BB48E250];                             // 0x0000(0x185BB48E250) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComUtilityFunctions");
		return ptr;
	}

};


// Class PlatformCommon.PComVideoPlayer
// 0x185BB48D830
class PComVideoPlayer
{
public:
	unsigned char                                      UnknownData00[0x185BB48D830];                             // 0x0000(0x185BB48D830) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComVideoPlayer");
		return ptr;
	}

};


// Class PlatformCommon.SearFiles
// 0x0000
class SearFiles
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.SearFiles");
		return ptr;
	}

};


// Class PlatformCommon.PComMusicTheme
// 0x185BB47C010
class PComMusicTheme
{
public:
	unsigned char                                      UnknownData00[0x185BB47C010];                             // 0x0000(0x185BB47C010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComMusicTheme");
		return ptr;
	}

};


// Class PlatformCommon.PComMusicThemeFactory
// 0x0000
class PComMusicThemeFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComMusicThemeFactory");
		return ptr;
	}

};


// Class PlatformCommon.PComMusicThemePlayer
// 0x185BB47BCB0
class PComMusicThemePlayer
{
public:
	unsigned char                                      UnknownData00[0x185BB47BCB0];                             // 0x0000(0x185BB47BCB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComMusicThemePlayer");
		return ptr;
	}

};


// Class PlatformCommon.PComMusicThemeSyncActor
// 0x185BB47C370
class PComMusicThemeSyncActor
{
public:
	unsigned char                                      UnknownData00[0x185BB47C370];                             // 0x0000(0x185BB47C370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComMusicThemeSyncActor");
		return ptr;
	}

};


// Class PlatformCommon.PComSeqAct_PlayMusicEvent
// 0x185BADEBB10
class PComSeqAct_PlayMusicEvent
{
public:
	unsigned char                                      UnknownData00[0x185BADEBB10];                             // 0x0000(0x185BADEBB10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComSeqAct_PlayMusicEvent");
		return ptr;
	}

};


// Class PlatformCommon.PComNetDriver
// 0x0000
class PComNetDriver
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComNetDriver");
		return ptr;
	}

};


// Class PlatformCommon.PComNetConn
// 0x0000
class PComNetConn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PlatformCommon.PComNetConn");
		return ptr;
	}

};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
