#pragma once

// Paladins (3.05) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PL_TgClient_structs.hpp"

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class TgClient.TgBrowserManager
// 0x185B8949A10
class TgBrowserManager
{
public:
	unsigned char                                      UnknownData00[0x185B8949A10];                             // 0x0000(0x185B8949A10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgBrowserManager");
		return ptr;
	}

};


// Class TgClient.TgChatData
// 0x185B86BDD00
class TgChatData
{
public:
	unsigned char                                      UnknownData00[0x185B86BDD00];                             // 0x0000(0x185B86BDD00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgChatData");
		return ptr;
	}

};


// Class TgClient.TgClientHUD
// 0x185B8951C90
class TgClientHUD
{
public:
	unsigned char                                      UnknownData00[0x185B8951C90];                             // 0x0000(0x185B8951C90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgClientHUD");
		return ptr;
	}

};


// Class TgClient.TgData_Cards
// 0x185B8950850
class TgData_Cards
{
public:
	unsigned char                                      UnknownData00[0x185B8950850];                             // 0x0000(0x185B8950850) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgData_Cards");
		return ptr;
	}

};


// Class TgClient.TgDataChunk
// 0x185B8950F10
class TgDataChunk
{
public:
	unsigned char                                      UnknownData00[0x185B8950F10];                             // 0x0000(0x185B8950F10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataChunk");
		return ptr;
	}

};


// Class TgClient.TgDataHandler
// 0x185B894E690
class TgDataHandler
{
public:
	unsigned char                                      UnknownData00[0x185B894E690];                             // 0x0000(0x185B894E690) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataHandler");
		return ptr;
	}

};


// Class TgClient.TgDataManager
// 0x185B59B7050
class TgDataManager
{
public:
	unsigned char                                      UnknownData00[0x185B59B7050];                             // 0x0000(0x185B59B7050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataManager");
		return ptr;
	}

};


// Class TgClient.TgGameLaunch
// 0x185B59C8750
class TgGameLaunch
{
public:
	unsigned char                                      UnknownData00[0x185B59C8750];                             // 0x0000(0x185B59C8750) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameLaunch");
		return ptr;
	}

};


// Class TgClient.TgGameViewportClient
// 0x185B895D3F0
class TgGameViewportClient
{
public:
	unsigned char                                      UnknownData00[0x185B895D3F0];                             // 0x0000(0x185B895D3F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameViewportClient");
		return ptr;
	}

};


// Class TgClient.TgGfxFriendManagement
// 0x185B663DB30
class TgGfxFriendManagement
{
public:
	unsigned char                                      UnknownData00[0x185B663DB30];                             // 0x0000(0x185B663DB30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxFriendManagement");
		return ptr;
	}

};


// Class TgClient.TgRewardCenterManager
// 0x185B6643BF0
class TgRewardCenterManager
{
public:
	unsigned char                                      UnknownData00[0x185B6643BF0];                             // 0x0000(0x185B6643BF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgRewardCenterManager");
		return ptr;
	}

};


// Class TgClient.TgStreamManager
// 0x185B664A910
class TgStreamManager
{
public:
	unsigned char                                      UnknownData00[0x185B664A910];                             // 0x0000(0x185B664A910) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgStreamManager");
		return ptr;
	}

};


// Class TgClient.TgSynchronizedTimer
// 0x185B66479D0
class TgSynchronizedTimer
{
public:
	unsigned char                                      UnknownData00[0x185B66479D0];                             // 0x0000(0x185B66479D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgSynchronizedTimer");
		return ptr;
	}

};


// Class TgClient.UIDataShop
// 0x185B664DA90
class UIDataShop
{
public:
	unsigned char                                      UnknownData00[0x185B664DA90];                             // 0x0000(0x185B664DA90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataShop");
		return ptr;
	}

};


// Class TgClient.UIHudSpectator
// 0x185B66574B0
class UIHudSpectator
{
public:
	unsigned char                                      UnknownData00[0x185B66574B0];                             // 0x0000(0x185B66574B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudSpectator");
		return ptr;
	}

};


// Class TgClient.UILandingPanelManager
// 0x185B2B8A420
class UILandingPanelManager
{
public:
	unsigned char                                      UnknownData00[0x185B2B8A420];                             // 0x0000(0x185B2B8A420) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UILandingPanelManager");
		return ptr;
	}

};


// Class TgClient.UIMoviePlayer
// 0x185B89538B0
class UIMoviePlayer
{
public:
	unsigned char                                      UnknownData00[0x185B89538B0];                             // 0x0000(0x185B89538B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIMoviePlayer");
		return ptr;
	}

};


// Class TgClient.TgDevMenuMoviePlayer
// 0x185B8953670
class TgDevMenuMoviePlayer
{
public:
	unsigned char                                      UnknownData00[0x185B8953670];                             // 0x0000(0x185B8953670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDevMenuMoviePlayer");
		return ptr;
	}

};


// Class TgClient.UIGAPeachStartup
// 0x185B6651990
class UIGAPeachStartup
{
public:
	unsigned char                                      UnknownData00[0x185B6651990];                             // 0x0000(0x185B6651990) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIGAPeachStartup");
		return ptr;
	}

};


// Class TgClient.UINotificationCenterJsonManager
// 0x185B2B4C860
class UINotificationCenterJsonManager
{
public:
	unsigned char                                      UnknownData00[0x185B2B4C860];                             // 0x0000(0x185B2B4C860) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UINotificationCenterJsonManager");
		return ptr;
	}

};


// Class TgClient.UIObject
// 0x0000
class UIObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIObject");
		return ptr;
	}

};


// Class TgClient.UIPatchNotesJsonManager
// 0x185B2B4B7E0
class UIPatchNotesJsonManager
{
public:
	unsigned char                                      UnknownData00[0x185B2B4B7E0];                             // 0x0000(0x185B2B4B7E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPatchNotesJsonManager");
		return ptr;
	}

};


// Class TgClient.UIData
// 0x0000
class UIData
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData");
		return ptr;
	}

};


// Class TgClient.TgDataObject
// 0x185B59AFF10
class TgDataObject
{
public:
	unsigned char                                      UnknownData00[0x185B59AFF10];                             // 0x0000(0x185B59AFF10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataObject");
		return ptr;
	}

};


// Class TgClient.TgData_EOM
// 0x185B59B2A90
class TgData_EOM
{
public:
	unsigned char                                      UnknownData00[0x185B59B2A90];                             // 0x0000(0x185B59B2A90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgData_EOM");
		return ptr;
	}

};


// Class TgClient.TgData_Notifications
// 0x185B59B3510
class TgData_Notifications
{
public:
	unsigned char                                      UnknownData00[0x185B59B3510];                             // 0x0000(0x185B59B3510) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgData_Notifications");
		return ptr;
	}

};


// Class TgClient.UIData_Accolade
// 0x185B9915C30
class UIData_Accolade
{
public:
	unsigned char                                      UnknownData00[0x185B9915C30];                             // 0x0000(0x185B9915C30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Accolade");
		return ptr;
	}

};


// Class TgClient.UIData_BattlePassLevel
// 0x185B9914370
class UIData_BattlePassLevel
{
public:
	unsigned char                                      UnknownData00[0x185B9914370];                             // 0x0000(0x185B9914370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_BattlePassLevel");
		return ptr;
	}

};


// Class TgClient.UIData_BattlePassTier
// 0x185B9915330
class UIData_BattlePassTier
{
public:
	unsigned char                                      UnknownData00[0x185B9915330];                             // 0x0000(0x185B9915330) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_BattlePassTier");
		return ptr;
	}

};


// Class TgClient.UIData_Challenge
// 0x185B9914970
class UIData_Challenge
{
public:
	unsigned char                                      UnknownData00[0x185B9914970];                             // 0x0000(0x185B9914970) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Challenge");
		return ptr;
	}

};


// Class TgClient.UIData_ChampionChests
// 0x185B9914BB0
class UIData_ChampionChests
{
public:
	unsigned char                                      UnknownData00[0x185B9914BB0];                             // 0x0000(0x185B9914BB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ChampionChests");
		return ptr;
	}

};


// Class TgClient.UIData_ChestDataWithCTA
// 0x185B8286B00
class UIData_ChestDataWithCTA
{
public:
	unsigned char                                      UnknownData00[0x185B8286B00];                             // 0x0000(0x185B8286B00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ChestDataWithCTA");
		return ptr;
	}

};


// Class TgClient.UIData_ChestDataWithItem
// 0x185B8287040
class UIData_ChestDataWithItem
{
public:
	unsigned char                                      UnknownData00[0x185B8287040];                             // 0x0000(0x185B8287040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ChestDataWithItem");
		return ptr;
	}

};


// Class TgClient.UIData_ChestExclusive
// 0x185B9914A30
class UIData_ChestExclusive
{
public:
	unsigned char                                      UnknownData00[0x185B9914A30];                             // 0x0000(0x185B9914A30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ChestExclusive");
		return ptr;
	}

};


// Class TgClient.UIData_ChestExtended
// 0x185B9916170
class UIData_ChestExtended
{
public:
	unsigned char                                      UnknownData00[0x185B9916170];                             // 0x0000(0x185B9916170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ChestExtended");
		return ptr;
	}

};


// Class TgClient.UIData_Commendation
// 0x185B8285FC0
class UIData_Commendation
{
public:
	unsigned char                                      UnknownData00[0x185B8285FC0];                             // 0x0000(0x185B8285FC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Commendation");
		return ptr;
	}

};


// Class TgClient.UIData_CustomGameManager
// 0x185B9916EF0
class UIData_CustomGameManager
{
public:
	unsigned char                                      UnknownData00[0x185B9916EF0];                             // 0x0000(0x185B9916EF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_CustomGameManager");
		return ptr;
	}

};


// Class TgClient.UIData_Default
// 0x0000
class UIData_Default
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Default");
		return ptr;
	}

};


// Class TgClient.UIData_DLCItem
// 0x185B6649CB0
class UIData_DLCItem
{
public:
	unsigned char                                      UnknownData00[0x185B6649CB0];                             // 0x0000(0x185B6649CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_DLCItem");
		return ptr;
	}

};


// Class TgClient.UIData_RealMoneyItem
// 0x185B664A130
class UIData_RealMoneyItem
{
public:
	unsigned char                                      UnknownData00[0x185B664A130];                             // 0x0000(0x185B664A130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_RealMoneyItem");
		return ptr;
	}

};


// Class TgClient.UIData_Empty
// 0x0000
class UIData_Empty
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Empty");
		return ptr;
	}

};


// Class TgClient.UIData_EventEmoteButton
// 0x185B9919170
class UIData_EventEmoteButton
{
public:
	unsigned char                                      UnknownData00[0x185B9919170];                             // 0x0000(0x185B9919170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_EventEmoteButton");
		return ptr;
	}

};


// Class TgClient.UIData_Goal
// 0x185B9918030
class UIData_Goal
{
public:
	unsigned char                                      UnknownData00[0x185B9918030];                             // 0x0000(0x185B9918030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Goal");
		return ptr;
	}

};


// Class TgClient.UIData_HeaderTab
// 0x185B9919230
class UIData_HeaderTab
{
public:
	unsigned char                                      UnknownData00[0x185B9919230];                             // 0x0000(0x185B9919230) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_HeaderTab");
		return ptr;
	}

};


// Class TgClient.UIData_Index
// 0x185B991A070
class UIData_Index
{
public:
	unsigned char                                      UnknownData00[0x185B991A070];                             // 0x0000(0x185B991A070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Index");
		return ptr;
	}

};


// Class TgClient.UIData_JsonFeature
// 0x185B99187B0
class UIData_JsonFeature
{
public:
	unsigned char                                      UnknownData00[0x185B99187B0];                             // 0x0000(0x185B99187B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_JsonFeature");
		return ptr;
	}

};


// Class TgClient.UIData_JsonFeatures
// 0x185B99175B0
class UIData_JsonFeatures
{
public:
	unsigned char                                      UnknownData00[0x185B99175B0];                             // 0x0000(0x185B99175B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_JsonFeatures");
		return ptr;
	}

};


// Class TgClient.UIData_LastDamageDone
// 0x185B8287DC0
class UIData_LastDamageDone
{
public:
	unsigned char                                      UnknownData00[0x185B8287DC0];                             // 0x0000(0x185B8287DC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LastDamageDone");
		return ptr;
	}

};


// Class TgClient.UIData_LastDamageDoneInstance
// 0x185B8285840
class UIData_LastDamageDoneInstance
{
public:
	unsigned char                                      UnknownData00[0x185B8285840];                             // 0x0000(0x185B8285840) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LastDamageDoneInstance");
		return ptr;
	}

};


// Class TgClient.UIData_LeaderboardPlayer
// 0x185B99199B0
class UIData_LeaderboardPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B99199B0];                             // 0x0000(0x185B99199B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LeaderboardPlayer");
		return ptr;
	}

};


// Class TgClient.UIData_LeagueEOM
// 0x185B9917BB0
class UIData_LeagueEOM
{
public:
	unsigned char                                      UnknownData00[0x185B9917BB0];                             // 0x0000(0x185B9917BB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LeagueEOM");
		return ptr;
	}

};


// Class TgClient.UIData_LeagueTierChange
// 0x185B991B6F0
class UIData_LeagueTierChange
{
public:
	unsigned char                                      UnknownData00[0x185B991B6F0];                             // 0x0000(0x185B991B6F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LeagueTierChange");
		return ptr;
	}

};


// Class TgClient.UIData_List
// 0x185B991B0F0
class UIData_List
{
public:
	unsigned char                                      UnknownData00[0x185B991B0F0];                             // 0x0000(0x185B991B0F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_List");
		return ptr;
	}

};


// Class TgClient.UIData_List_TitleIcon
// 0x185B991AF70
class UIData_List_TitleIcon
{
public:
	unsigned char                                      UnknownData00[0x185B991AF70];                             // 0x0000(0x185B991AF70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_List_TitleIcon");
		return ptr;
	}

};


// Class TgClient.UIData_List_PrimaryQueues
// 0x185B991B1B0
class UIData_List_PrimaryQueues
{
public:
	unsigned char                                      UnknownData00[0x185B991B1B0];                             // 0x0000(0x185B991B1B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_List_PrimaryQueues");
		return ptr;
	}

};


// Class TgClient.UIData_Loadout
// 0x185B991B630
class UIData_Loadout
{
public:
	unsigned char                                      UnknownData00[0x185B991B630];                             // 0x0000(0x185B991B630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Loadout");
		return ptr;
	}

};


// Class TgClient.UIData_LoadoutCategory
// 0x185B991B330
class UIData_LoadoutCategory
{
public:
	unsigned char                                      UnknownData00[0x185B991B330];                             // 0x0000(0x185B991B330) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LoadoutCategory");
		return ptr;
	}

};


// Class TgClient.UIData_LoadoutItem
// 0x185B991B9F0
class UIData_LoadoutItem
{
public:
	unsigned char                                      UnknownData00[0x185B991B9F0];                             // 0x0000(0x185B991B9F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LoadoutItem");
		return ptr;
	}

};


// Class TgClient.UIData_LoadoutPrebuilt
// 0x185B991A4F0
class UIData_LoadoutPrebuilt
{
public:
	unsigned char                                      UnknownData00[0x185B991A4F0];                             // 0x0000(0x185B991A4F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LoadoutPrebuilt");
		return ptr;
	}

};


// Class TgClient.UIData_LobbySlotItem
// 0x185B9CBEE70
class UIData_LobbySlotItem
{
public:
	unsigned char                                      UnknownData00[0x185B9CBEE70];                             // 0x0000(0x185B9CBEE70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LobbySlotItem");
		return ptr;
	}

};


// Class TgClient.UIData_LootTableItem
// 0x185B991ADF0
class UIData_LootTableItem
{
public:
	unsigned char                                      UnknownData00[0x185B991ADF0];                             // 0x0000(0x185B991ADF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LootTableItem");
		return ptr;
	}

};


// Class TgClient.UIData_LTIAggregate
// 0x185B991BCF0
class UIData_LTIAggregate
{
public:
	unsigned char                                      UnknownData00[0x185B991BCF0];                             // 0x0000(0x185B991BCF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LTIAggregate");
		return ptr;
	}

};


// Class TgClient.UIData_MasteryReward
// 0x185B991BE70
class UIData_MasteryReward
{
public:
	unsigned char                                      UnknownData00[0x185B991BE70];                             // 0x0000(0x185B991BE70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MasteryReward");
		return ptr;
	}

};


// Class TgClient.UIData_MatchBoosterActivated
// 0x185B991A970
class UIData_MatchBoosterActivated
{
public:
	unsigned char                                      UnknownData00[0x185B991A970];                             // 0x0000(0x185B991A970) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MatchBoosterActivated");
		return ptr;
	}

};


// Class TgClient.UIData_MatchInvitePlayerState
// 0x185B991ECF0
class UIData_MatchInvitePlayerState
{
public:
	unsigned char                                      UnknownData00[0x185B991ECF0];                             // 0x0000(0x185B991ECF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MatchInvitePlayerState");
		return ptr;
	}

};


// Class TgClient.UIData_MatchLobbyChampion
// 0x185B8286740
class UIData_MatchLobbyChampion
{
public:
	unsigned char                                      UnknownData00[0x185B8286740];                             // 0x0000(0x185B8286740) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MatchLobbyChampion");
		return ptr;
	}

};


// Class TgClient.UIData_MatchMember
// 0x185B6649EF0
class UIData_MatchMember
{
public:
	unsigned char                                      UnknownData00[0x185B6649EF0];                             // 0x0000(0x185B6649EF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MatchMember");
		return ptr;
	}

};


// Class TgClient.UIData_MultiQueue
// 0x185B991DAF0
class UIData_MultiQueue
{
public:
	unsigned char                                      UnknownData00[0x185B991DAF0];                             // 0x0000(0x185B991DAF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MultiQueue");
		return ptr;
	}

};


// Class TgClient.UIData_MVP
// 0x185B991F2F0
class UIData_MVP
{
public:
	unsigned char                                      UnknownData00[0x185B991F2F0];                             // 0x0000(0x185B991F2F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MVP");
		return ptr;
	}

};


// Class TgClient.UIData_Notification
// 0x185B8288780
class UIData_Notification
{
public:
	unsigned char                                      UnknownData00[0x185B8288780];                             // 0x0000(0x185B8288780) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Notification");
		return ptr;
	}

};


// Class TgClient.UIData_Pair
// 0x185B991D370
class UIData_Pair
{
public:
	unsigned char                                      UnknownData00[0x185B991D370];                             // 0x0000(0x185B991D370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Pair");
		return ptr;
	}

};


// Class TgClient.UIData_PartyKick
// 0x185B991D5B0
class UIData_PartyKick
{
public:
	unsigned char                                      UnknownData00[0x185B991D5B0];                             // 0x0000(0x185B991D5B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_PartyKick");
		return ptr;
	}

};


// Class TgClient.UIData_PlayerMatchRecord
// 0x185B554EBC0
class UIData_PlayerMatchRecord
{
public:
	unsigned char                                      UnknownData00[0x185B554EBC0];                             // 0x0000(0x185B554EBC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_PlayerMatchRecord");
		return ptr;
	}

};


// Class TgClient.UIData_PopupGeneric
// 0x185B554E8A0
class UIData_PopupGeneric
{
public:
	unsigned char                                      UnknownData00[0x185B554E8A0];                             // 0x0000(0x185B554E8A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_PopupGeneric");
		return ptr;
	}

};


// Class TgClient.UIData_PopupInput
// 0x185B554EC60
class UIData_PopupInput
{
public:
	unsigned char                                      UnknownData00[0x185B554EC60];                             // 0x0000(0x185B554EC60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_PopupInput");
		return ptr;
	}

};


// Class TgClient.UIData_PreviewItems
// 0x185B8289E00
class UIData_PreviewItems
{
public:
	unsigned char                                      UnknownData00[0x185B8289E00];                             // 0x0000(0x185B8289E00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_PreviewItems");
		return ptr;
	}

};


// Class TgClient.UIData_Quest
// 0x185B99186F0
class UIData_Quest
{
public:
	unsigned char                                      UnknownData00[0x185B99186F0];                             // 0x0000(0x185B99186F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Quest");
		return ptr;
	}

};


// Class TgClient.UIData_SpecialEvent
// 0x185B99174F0
class UIData_SpecialEvent
{
public:
	unsigned char                                      UnknownData00[0x185B99174F0];                             // 0x0000(0x185B99174F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_SpecialEvent");
		return ptr;
	}

};


// Class TgClient.UIData_ItemQuest
// 0x185B9918AB0
class UIData_ItemQuest
{
public:
	unsigned char                                      UnknownData00[0x185B9918AB0];                             // 0x0000(0x185B9918AB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ItemQuest");
		return ptr;
	}

};


// Class TgClient.UIData_Queue
// 0x185B9921C30
class UIData_Queue
{
public:
	unsigned char                                      UnknownData00[0x185B9921C30];                             // 0x0000(0x185B9921C30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Queue");
		return ptr;
	}

};


// Class TgClient.UIData_RadialEquipMenu
// 0x185B9920130
class UIData_RadialEquipMenu
{
public:
	unsigned char                                      UnknownData00[0x185B9920130];                             // 0x0000(0x185B9920130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_RadialEquipMenu");
		return ptr;
	}

};


// Class TgClient.UIData_RebindCommand
// 0x185B9923670
class UIData_RebindCommand
{
public:
	unsigned char                                      UnknownData00[0x185B9923670];                             // 0x0000(0x185B9923670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_RebindCommand");
		return ptr;
	}

};


// Class TgClient.UIData_ReferralTimeRemaining
// 0x0000
class UIData_ReferralTimeRemaining
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ReferralTimeRemaining");
		return ptr;
	}

};


// Class TgClient.UIData_RentSprayPopup
// 0x185B9925D70
class UIData_RentSprayPopup
{
public:
	unsigned char                                      UnknownData00[0x185B9925D70];                             // 0x0000(0x185B9925D70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_RentSprayPopup");
		return ptr;
	}

};


// Class TgClient.UIData_ReportPlayer
// 0x185B9923430
class UIData_ReportPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B9923430];                             // 0x0000(0x185B9923430) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ReportPlayer");
		return ptr;
	}

};


// Class TgClient.UIData_RewardPanel
// 0x185B9925170
class UIData_RewardPanel
{
public:
	unsigned char                                      UnknownData00[0x185B9925170];                             // 0x0000(0x185B9925170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_RewardPanel");
		return ptr;
	}

};


// Class TgClient.UIData_RewardPanelEntry
// 0x185B9924630
class UIData_RewardPanelEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9924630];                             // 0x0000(0x185B9924630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_RewardPanelEntry");
		return ptr;
	}

};


// Class TgClient.UIData_SearchListEntry
// 0x185B9923EB0
class UIData_SearchListEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9923EB0];                             // 0x0000(0x185B9923EB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_SearchListEntry");
		return ptr;
	}

};


// Class TgClient.UIData_Site
// 0x185B9924B70
class UIData_Site
{
public:
	unsigned char                                      UnknownData00[0x185B9924B70];                             // 0x0000(0x185B9924B70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Site");
		return ptr;
	}

};


// Class TgClient.UIData_SocialAction
// 0x185B99238B0
class UIData_SocialAction
{
public:
	unsigned char                                      UnknownData00[0x185B99238B0];                             // 0x0000(0x185B99238B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_SocialAction");
		return ptr;
	}

};


// Class TgClient.UIData_SprayRental
// 0x185B9925470
class UIData_SprayRental
{
public:
	unsigned char                                      UnknownData00[0x185B9925470];                             // 0x0000(0x185B9925470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_SprayRental");
		return ptr;
	}

};


// Class TgClient.UIData_StoreItemFilter
// 0x185B9925B30
class UIData_StoreItemFilter
{
public:
	unsigned char                                      UnknownData00[0x185B9925B30];                             // 0x0000(0x185B9925B30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_StoreItemFilter");
		return ptr;
	}

};


// Class TgClient.UIData_StoreItemTab
// 0x185B9925E30
class UIData_StoreItemTab
{
public:
	unsigned char                                      UnknownData00[0x185B9925E30];                             // 0x0000(0x185B9925E30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_StoreItemTab");
		return ptr;
	}

};


// Class TgClient.UIData_StreamSettings
// 0x185B9923F70
class UIData_StreamSettings
{
public:
	unsigned char                                      UnknownData00[0x185B9923F70];                             // 0x0000(0x185B9923F70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_StreamSettings");
		return ptr;
	}

};


// Class TgClient.UIData_String
// 0x185B99261F0
class UIData_String
{
public:
	unsigned char                                      UnknownData00[0x185B99261F0];                             // 0x0000(0x185B99261F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_String");
		return ptr;
	}

};


// Class TgClient.UIData_StringWithCount
// 0x185B99279F0
class UIData_StringWithCount
{
public:
	unsigned char                                      UnknownData00[0x185B99279F0];                             // 0x0000(0x185B99279F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_StringWithCount");
		return ptr;
	}

};


// Class TgClient.UIData_String_Localized
// 0x185B9928BF0
class UIData_String_Localized
{
public:
	unsigned char                                      UnknownData00[0x185B9928BF0];                             // 0x0000(0x185B9928BF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_String_Localized");
		return ptr;
	}

};


// Class TgClient.UIData_StringList
// 0x185B9928A70
class UIData_StringList
{
public:
	unsigned char                                      UnknownData00[0x185B9928A70];                             // 0x0000(0x185B9928A70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_StringList");
		return ptr;
	}

};


// Class TgClient.UIData_TitleQuantity
// 0x185B9929070
class UIData_TitleQuantity
{
public:
	unsigned char                                      UnknownData00[0x185B9929070];                             // 0x0000(0x185B9929070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_TitleQuantity");
		return ptr;
	}

};


// Class TgClient.UIData_TreasureRoll
// 0x185B99273F0
class UIData_TreasureRoll
{
public:
	unsigned char                                      UnknownData00[0x185B99273F0];                             // 0x0000(0x185B99273F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_TreasureRoll");
		return ptr;
	}

};


// Class TgClient.UIData_TreasureRoll_Item
// 0x185B9926BB0
class UIData_TreasureRoll_Item
{
public:
	unsigned char                                      UnknownData00[0x185B9926BB0];                             // 0x0000(0x185B9926BB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_TreasureRoll_Item");
		return ptr;
	}

};


// Class TgClient.UIData_Vendor
// 0x185B99282F0
class UIData_Vendor
{
public:
	unsigned char                                      UnknownData00[0x185B99282F0];                             // 0x0000(0x185B99282F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Vendor");
		return ptr;
	}

};


// Class TgClient.UIData_VGSEntry
// 0x185B828AAC0
class UIData_VGSEntry
{
public:
	unsigned char                                      UnknownData00[0x185B828AAC0];                             // 0x0000(0x185B828AAC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_VGSEntry");
		return ptr;
	}

};


// Class TgClient.UIDataAcquisition
// 0x185B9927C30
class UIDataAcquisition
{
public:
	unsigned char                                      UnknownData00[0x185B9927C30];                             // 0x0000(0x185B9927C30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataAcquisition");
		return ptr;
	}

};


// Class TgClient.UIDataAcquisitionQueue
// 0x185B9928470
class UIDataAcquisitionQueue
{
public:
	unsigned char                                      UnknownData00[0x185B9928470];                             // 0x0000(0x185B9928470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataAcquisitionQueue");
		return ptr;
	}

};


// Class TgClient.UIDataItem
// 0x185B664A250
class UIDataItem
{
public:
	unsigned char                                      UnknownData00[0x185B664A250];                             // 0x0000(0x185B664A250) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataItem");
		return ptr;
	}

};


// Class TgClient.UIDataLeague
// 0x185B9931A70
class UIDataLeague
{
public:
	unsigned char                                      UnknownData00[0x185B9931A70];                             // 0x0000(0x185B9931A70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataLeague");
		return ptr;
	}

};


// Class TgClient.UIDataLeaguePlayer
// 0x185B9930DB0
class UIDataLeaguePlayer
{
public:
	unsigned char                                      UnknownData00[0x185B9930DB0];                             // 0x0000(0x185B9930DB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataLeaguePlayer");
		return ptr;
	}

};


// Class TgClient.UIDataLeagueTier
// 0x185B992F970
class UIDataLeagueTier
{
public:
	unsigned char                                      UnknownData00[0x185B992F970];                             // 0x0000(0x185B992F970) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataLeagueTier");
		return ptr;
	}

};


// Class TgClient.UIDataObject
// 0x185B991C0B0
class UIDataObject
{
public:
	unsigned char                                      UnknownData00[0x185B991C0B0];                             // 0x0000(0x185B991C0B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataObject");
		return ptr;
	}

};


// Class TgClient.UIData_CustomMatch
// 0x185B8287940
class UIData_CustomMatch
{
public:
	unsigned char                                      UnknownData00[0x185B8287940];                             // 0x0000(0x185B8287940) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_CustomMatch");
		return ptr;
	}

};


// Class TgClient.UIData_CustomQueue
// 0x185B8286800
class UIData_CustomQueue
{
public:
	unsigned char                                      UnknownData00[0x185B8286800];                             // 0x0000(0x185B8286800) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_CustomQueue");
		return ptr;
	}

};


// Class TgClient.UIData_Match
// 0x185B554EDA0
class UIData_Match
{
public:
	unsigned char                                      UnknownData00[0x185B554EDA0];                             // 0x0000(0x185B554EDA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Match");
		return ptr;
	}

};


// Class TgClient.UIData_PortalAccount
// 0x185B9921F30
class UIData_PortalAccount
{
public:
	unsigned char                                      UnknownData00[0x185B9921F30];                             // 0x0000(0x185B9921F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_PortalAccount");
		return ptr;
	}

};


// Class TgClient.UIDataAcquisitionManager
// 0x0000
class UIDataAcquisitionManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataAcquisitionManager");
		return ptr;
	}

};


// Class TgClient.UIDataChampion
// 0x185B554DD60
class UIDataChampion
{
public:
	unsigned char                                      UnknownData00[0x185B554DD60];                             // 0x0000(0x185B554DD60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataChampion");
		return ptr;
	}

};


// Class TgClient.UIDataChampions
// 0x185B992A0F0
class UIDataChampions
{
public:
	unsigned char                                      UnknownData00[0x185B992A0F0];                             // 0x0000(0x185B992A0F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataChampions");
		return ptr;
	}

};


// Class TgClient.UIDataChatManager
// 0x185B664AB50
class UIDataChatManager
{
public:
	unsigned char                                      UnknownData00[0x185B664AB50];                             // 0x0000(0x185B664AB50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataChatManager");
		return ptr;
	}

};


// Class TgClient.UIDataCommon
// 0x185B992D4B0
class UIDataCommon
{
public:
	unsigned char                                      UnknownData00[0x185B992D4B0];                             // 0x0000(0x185B992D4B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataCommon");
		return ptr;
	}

};


// Class TgClient.UIDataDirector
// 0x185B992D630
class UIDataDirector
{
public:
	unsigned char                                      UnknownData00[0x185B992D630];                             // 0x0000(0x185B992D630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataDirector");
		return ptr;
	}

};


// Class TgClient.UIDataGoals
// 0x185B664E930
class UIDataGoals
{
public:
	unsigned char                                      UnknownData00[0x185B664E930];                             // 0x0000(0x185B664E930) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataGoals");
		return ptr;
	}

};


// Class TgClient.UIDataLeagueManager
// 0x185B9931CB0
class UIDataLeagueManager
{
public:
	unsigned char                                      UnknownData00[0x185B9931CB0];                             // 0x0000(0x185B9931CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataLeagueManager");
		return ptr;
	}

};


// Class TgClient.UIDataLoadouts
// 0x185B473DA90
class UIDataLoadouts
{
public:
	unsigned char                                      UnknownData00[0x185B473DA90];                             // 0x0000(0x185B473DA90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataLoadouts");
		return ptr;
	}

};


// Class TgClient.UIDataManager
// 0x185B664F590
class UIDataManager
{
public:
	unsigned char                                      UnknownData00[0x185B664F590];                             // 0x0000(0x185B664F590) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataManager");
		return ptr;
	}

};


// Class TgClient.UIDataQueues
// 0x185B9934A70
class UIDataQueues
{
public:
	unsigned char                                      UnknownData00[0x185B9934A70];                             // 0x0000(0x185B9934A70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataQueues");
		return ptr;
	}

};


// Class TgClient.UIDataSocial
// 0x185B99373B0
class UIDataSocial
{
public:
	unsigned char                                      UnknownData00[0x185B99373B0];                             // 0x0000(0x185B99373B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataSocial");
		return ptr;
	}

};


// Class TgClient.UIDataVGSMaps
// 0x185B8288F00
class UIDataVGSMaps
{
public:
	unsigned char                                      UnknownData00[0x185B8288F00];                             // 0x0000(0x185B8288F00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataVGSMaps");
		return ptr;
	}

};


// Class TgClient.UIDataPlayer
// 0x185B9934E30
class UIDataPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B9934E30];                             // 0x0000(0x185B9934E30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataPlayer");
		return ptr;
	}

};


// Class TgClient.UIDataPrice
// 0x185B9932670
class UIDataPrice
{
public:
	unsigned char                                      UnknownData00[0x185B9932670];                             // 0x0000(0x185B9932670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataPrice");
		return ptr;
	}

};


// Class TgClient.UIDataRedeemableAcquisition
// 0x185B8288600
class UIDataRedeemableAcquisition
{
public:
	unsigned char                                      UnknownData00[0x185B8288600];                             // 0x0000(0x185B8288600) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataRedeemableAcquisition");
		return ptr;
	}

};


// Class TgClient.UIData_LoadoutInterface
// 0x0000
class UIData_LoadoutInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LoadoutInterface");
		return ptr;
	}

};


// Class TgClient.UIDataInterface_Name
// 0x0000
class UIDataInterface_Name
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataInterface_Name");
		return ptr;
	}

};


// Class TgClient.TgThreatModel
// 0x185B59EA050
class TgThreatModel
{
public:
	unsigned char                                      UnknownData00[0x185B59EA050];                             // 0x0000(0x185B59EA050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgThreatModel");
		return ptr;
	}

};


// Class TgClient.InputContext
// 0x185B86B7C40
class InputContext
{
public:
	unsigned char                                      UnknownData00[0x185B86B7C40];                             // 0x0000(0x185B86B7C40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.InputContext");
		return ptr;
	}

};


// Class TgClient.InputContextManager
// 0x185B86B80C0
class InputContextManager
{
public:
	unsigned char                                      UnknownData00[0x185B86B80C0];                             // 0x0000(0x185B86B80C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.InputContextManager");
		return ptr;
	}

};


// Class TgClient.InputGroup
// 0x185B894C950
class InputGroup
{
public:
	unsigned char                                      UnknownData00[0x185B894C950];                             // 0x0000(0x185B894C950) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.InputGroup");
		return ptr;
	}

};


// Class TgClient.InputAction
// 0x185B894AE50
class InputAction
{
public:
	unsigned char                                      UnknownData00[0x185B894AE50];                             // 0x0000(0x185B894AE50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.InputAction");
		return ptr;
	}

};


// Class TgClient.TgBlinder
// 0x185B894B090
class TgBlinder
{
public:
	unsigned char                                      UnknownData00[0x185B894B090];                             // 0x0000(0x185B894B090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgBlinder");
		return ptr;
	}

};


// Class TgClient.TgGameHUD
// 0x185B895CC10
class TgGameHUD
{
public:
	unsigned char                                      UnknownData00[0x185B895CC10];                             // 0x0000(0x185B895CC10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameHUD");
		return ptr;
	}

};


// Class TgClient.TgSpectatorHUD
// 0x185B6645930
class TgSpectatorHUD
{
public:
	unsigned char                                      UnknownData00[0x185B6645930];                             // 0x0000(0x185B6645930) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgSpectatorHUD");
		return ptr;
	}

};


// Class TgClient.TgDataGroup_Game
// 0x185B8952230
class TgDataGroup_Game
{
public:
	unsigned char                                      UnknownData00[0x185B8952230];                             // 0x0000(0x185B8952230) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataGroup_Game");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Device
// 0x185B8956B50
class TgGameDC_Device
{
public:
	unsigned char                                      UnknownData00[0x185B8956B50];                             // 0x0000(0x185B8956B50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Device");
		return ptr;
	}

};


// Class TgClient.TgGameDC_DeviceList
// 0x185B8959610
class TgGameDC_DeviceList
{
public:
	unsigned char                                      UnknownData00[0x185B8959610];                             // 0x0000(0x185B8959610) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_DeviceList");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Effect
// 0x185B89580B0
class TgGameDC_Effect
{
public:
	unsigned char                                      UnknownData00[0x185B89580B0];                             // 0x0000(0x185B89580B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Effect");
		return ptr;
	}

};


// Class TgClient.TgGameDC_EffectList
// 0x185B8957E70
class TgGameDC_EffectList
{
public:
	unsigned char                                      UnknownData00[0x185B8957E70];                             // 0x0000(0x185B8957E70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_EffectList");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Game
// 0x185B895B590
class TgGameDC_Game
{
public:
	unsigned char                                      UnknownData00[0x185B895B590];                             // 0x0000(0x185B895B590) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Game");
		return ptr;
	}

};


// Class TgClient.TgGameDC_MapEntity
// 0x185B89594F0
class TgGameDC_MapEntity
{
public:
	unsigned char                                      UnknownData00[0x185B89594F0];                             // 0x0000(0x185B89594F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_MapEntity");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Guardian
// 0x0000
class TgGameDC_Guardian
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Guardian");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Player
// 0x185B89593D0
class TgGameDC_Player
{
public:
	unsigned char                                      UnknownData00[0x185B89593D0];                             // 0x0000(0x185B89593D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Player");
		return ptr;
	}

};


// Class TgClient.TgGameDC_LocalPlayer
// 0x185B895B7D0
class TgGameDC_LocalPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B895B7D0];                             // 0x0000(0x185B895B7D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_LocalPlayer");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Minion
// 0x0000
class TgGameDC_Minion
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Minion");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Turret
// 0x0000
class TgGameDC_Turret
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Turret");
		return ptr;
	}

};


// Class TgClient.TgGameDC_PlayerVitals
// 0x185B8957690
class TgGameDC_PlayerVitals
{
public:
	unsigned char                                      UnknownData00[0x185B8957690];                             // 0x0000(0x185B8957690) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_PlayerVitals");
		return ptr;
	}

};


// Class TgClient.TgGameDC_RespawnLocation
// 0x0000
class TgGameDC_RespawnLocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_RespawnLocation");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Tower
// 0x185B8959850
class TgGameDC_Tower
{
public:
	unsigned char                                      UnknownData00[0x185B8959850];                             // 0x0000(0x185B8959850) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Tower");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Target
// 0x185B8959CD0
class TgGameDC_Target
{
public:
	unsigned char                                      UnknownData00[0x185B8959CD0];                             // 0x0000(0x185B8959CD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Target");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Team
// 0x185B8958F50
class TgGameDC_Team
{
public:
	unsigned char                                      UnknownData00[0x185B8958F50];                             // 0x0000(0x185B8958F50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Team");
		return ptr;
	}

};


// Class TgClient.TgGameDataHandler
// 0x185B89539D0
class TgGameDataHandler
{
public:
	unsigned char                                      UnknownData00[0x185B89539D0];                             // 0x0000(0x185B89539D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDataHandler");
		return ptr;
	}

};


// Class TgClient.TgGameDC_Chat
// 0x185B8953C10
class TgGameDC_Chat
{
public:
	unsigned char                                      UnknownData00[0x185B8953C10];                             // 0x0000(0x185B8953C10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameDC_Chat");
		return ptr;
	}

};


// Class TgClient.TgMiniMap
// 0x185B66427B0
class TgMiniMap
{
public:
	unsigned char                                      UnknownData00[0x185B66427B0];                             // 0x0000(0x185B66427B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgMiniMap");
		return ptr;
	}

};


// Class TgClient.TgMiniMap_Targeting
// 0x185B59E17D0
class TgMiniMap_Targeting
{
public:
	unsigned char                                      UnknownData00[0x185B59E17D0];                             // 0x0000(0x185B59E17D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgMiniMap_Targeting");
		return ptr;
	}

};


// Class TgClient.UIGameMoviePlayer
// 0x185B6652EF0
class UIGameMoviePlayer
{
public:
	unsigned char                                      UnknownData00[0x185B6652EF0];                             // 0x0000(0x185B6652EF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIGameMoviePlayer");
		return ptr;
	}

};


// Class TgClient.TgLobbyHUD
// 0x185B66429F0
class TgLobbyHUD
{
public:
	unsigned char                                      UnknownData00[0x185B66429F0];                             // 0x0000(0x185B66429F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgLobbyHUD");
		return ptr;
	}

};


// Class TgClient.TgSetting
// 0x185B59E2FD0
class TgSetting
{
public:
	unsigned char                                      UnknownData00[0x185B59E2FD0];                             // 0x0000(0x185B59E2FD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgSetting");
		return ptr;
	}

};


// Class TgClient.TgSettingsManager
// 0x185B6643410
class TgSettingsManager
{
public:
	unsigned char                                      UnknownData00[0x185B6643410];                             // 0x0000(0x185B6643410) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgSettingsManager");
		return ptr;
	}

};


// Class TgClient.AcquisitionHandler
// 0x0000
class AcquisitionHandler
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.AcquisitionHandler");
		return ptr;
	}

};


// Class TgClient.DelayQueueInterface
// 0x0000
class DelayQueueInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.DelayQueueInterface");
		return ptr;
	}

};


// Class TgClient.UIComponent
// 0x185B895C550
class UIComponent
{
public:
	unsigned char                                      UnknownData00[0x185B895C550];                             // 0x0000(0x185B895C550) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent");
		return ptr;
	}

};


// Class TgClient.UIComponent_AnimSet
// 0x185B665BA70
class UIComponent_AnimSet
{
public:
	unsigned char                                      UnknownData00[0x185B665BA70];                             // 0x0000(0x185B665BA70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_AnimSet");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassBanner
// 0x185B8266100
class UIComponent_BattlePassBanner
{
public:
	unsigned char                                      UnknownData00[0x185B8266100];                             // 0x0000(0x185B8266100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassBanner");
		return ptr;
	}

};


// Class TgClient.UIComponent_Chests
// 0x185B82688C0
class UIComponent_Chests
{
public:
	unsigned char                                      UnknownData00[0x185B82688C0];                             // 0x0000(0x185B82688C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Chests");
		return ptr;
	}

};


// Class TgClient.UIComponent_Display
// 0x185B9CAEA30
class UIComponent_Display
{
public:
	unsigned char                                      UnknownData00[0x185B9CAEA30];                             // 0x0000(0x185B9CAEA30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Display");
		return ptr;
	}

};


// Class TgClient.UIComponent_AbilityPointsPool
// 0x185B9CAF330
class UIComponent_AbilityPointsPool
{
public:
	unsigned char                                      UnknownData00[0x185B9CAF330];                             // 0x0000(0x185B9CAF330) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_AbilityPointsPool");
		return ptr;
	}

};


// Class TgClient.UIComponent_Accolade
// 0x185B9CAE670
class UIComponent_Accolade
{
public:
	unsigned char                                      UnknownData00[0x185B9CAE670];                             // 0x0000(0x185B9CAE670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Accolade");
		return ptr;
	}

};


// Class TgClient.UIComponent_AnimatedText
// 0x185B9CB17F0
class UIComponent_AnimatedText
{
public:
	unsigned char                                      UnknownData00[0x185B9CB17F0];                             // 0x0000(0x185B9CB17F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_AnimatedText");
		return ptr;
	}

};


// Class TgClient.UIComponent_AsiaticEventHome
// 0x185B9CB62F0
class UIComponent_AsiaticEventHome
{
public:
	unsigned char                                      UnknownData00[0x185B9CB62F0];                             // 0x0000(0x185B9CB62F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_AsiaticEventHome");
		return ptr;
	}

};


// Class TgClient.UIComponent_AsiaticEventInfo
// 0x0000
class UIComponent_AsiaticEventInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_AsiaticEventInfo");
		return ptr;
	}

};


// Class TgClient.UIComponent_AsiaticEventQuests
// 0x185B9CB4A30
class UIComponent_AsiaticEventQuests
{
public:
	unsigned char                                      UnknownData00[0x185B9CB4A30];                             // 0x0000(0x185B9CB4A30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_AsiaticEventQuests");
		return ptr;
	}

};


// Class TgClient.UIComponent_Avatar
// 0x185B9CB5630
class UIComponent_Avatar
{
public:
	unsigned char                                      UnknownData00[0x185B9CB5630];                             // 0x0000(0x185B9CB5630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Avatar");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassChallenges
// 0x185B9CB54B0
class UIComponent_BattlePassChallenges
{
public:
	unsigned char                                      UnknownData00[0x185B9CB54B0];                             // 0x0000(0x185B9CB54B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassChallenges");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassHome
// 0x185B9CB7C70
class UIComponent_BattlePassHome
{
public:
	unsigned char                                      UnknownData00[0x185B9CB7C70];                             // 0x0000(0x185B9CB7C70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassHome");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassPurchasePanel
// 0x185B9CB7430
class UIComponent_BattlePassPurchasePanel
{
public:
	unsigned char                                      UnknownData00[0x185B9CB7430];                             // 0x0000(0x185B9CB7430) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassPurchasePanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassRewardJoinedLevels
// 0x185B9CB9E30
class UIComponent_BattlePassRewardJoinedLevels
{
public:
	unsigned char                                      UnknownData00[0x185B9CB9E30];                             // 0x0000(0x185B9CB9E30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassRewardJoinedLevels");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassRewardLevel
// 0x185B9CB8630
class UIComponent_BattlePassRewardLevel
{
public:
	unsigned char                                      UnknownData00[0x185B9CB8630];                             // 0x0000(0x185B9CB8630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassRewardLevel");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassRewardsInfoPanel
// 0x185B9CB9BF0
class UIComponent_BattlePassRewardsInfoPanel
{
public:
	unsigned char                                      UnknownData00[0x185B9CB9BF0];                             // 0x0000(0x185B9CB9BF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassRewardsInfoPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassRewardTier
// 0x185B9CB8CF0
class UIComponent_BattlePassRewardTier
{
public:
	unsigned char                                      UnknownData00[0x185B9CB8CF0];                             // 0x0000(0x185B9CB8CF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassRewardTier");
		return ptr;
	}

};


// Class TgClient.UIComponent_BoosterItemBenefits
// 0x185B9CB8FF0
class UIComponent_BoosterItemBenefits
{
public:
	unsigned char                                      UnknownData00[0x185B9CB8FF0];                             // 0x0000(0x185B9CB8FF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BoosterItemBenefits");
		return ptr;
	}

};


// Class TgClient.UIComponent_BoosterItemInfo
// 0x185B9CB72B0
class UIComponent_BoosterItemInfo
{
public:
	unsigned char                                      UnknownData00[0x185B9CB72B0];                             // 0x0000(0x185B9CB72B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BoosterItemInfo");
		return ptr;
	}

};


// Class TgClient.UIComponent_BurnCard
// 0x185B8266AC0
class UIComponent_BurnCard
{
public:
	unsigned char                                      UnknownData00[0x185B8266AC0];                             // 0x0000(0x185B8266AC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BurnCard");
		return ptr;
	}

};


// Class TgClient.UIComponent_CalendarEventEvents
// 0x185B8264E40
class UIComponent_CalendarEventEvents
{
public:
	unsigned char                                      UnknownData00[0x185B8264E40];                             // 0x0000(0x185B8264E40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CalendarEventEvents");
		return ptr;
	}

};


// Class TgClient.UIComponent_CalendarEventOverview
// 0x185B8264A80
class UIComponent_CalendarEventOverview
{
public:
	unsigned char                                      UnknownData00[0x185B8264A80];                             // 0x0000(0x185B8264A80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CalendarEventOverview");
		return ptr;
	}

};


// Class TgClient.UIComponent_Card
// 0x185B9CBC3B0
class UIComponent_Card
{
public:
	unsigned char                                      UnknownData00[0x185B9CBC3B0];                             // 0x0000(0x185B9CBC3B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Card");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChampionAbilities
// 0x185B9CBEF30
class UIComponent_ChampionAbilities
{
public:
	unsigned char                                      UnknownData00[0x185B9CBEF30];                             // 0x0000(0x185B9CBEF30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChampionAbilities");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChampionLoadouts
// 0x185B9CBE1B0
class UIComponent_ChampionLoadouts
{
public:
	unsigned char                                      UnknownData00[0x185B9CBE1B0];                             // 0x0000(0x185B9CBE1B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChampionLoadouts");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChampionOverview
// 0x185B9CBDC70
class UIComponent_ChampionOverview
{
public:
	unsigned char                                      UnknownData00[0x185B9CBDC70];                             // 0x0000(0x185B9CBDC70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChampionOverview");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChampionSelectChampion
// 0x185B8267300
class UIComponent_ChampionSelectChampion
{
public:
	unsigned char                                      UnknownData00[0x185B8267300];                             // 0x0000(0x185B8267300) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChampionSelectChampion");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChampionSelectRoleTab
// 0x185B8265EC0
class UIComponent_ChampionSelectRoleTab
{
public:
	unsigned char                                      UnknownData00[0x185B8265EC0];                             // 0x0000(0x185B8265EC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChampionSelectRoleTab");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChampionSkins
// 0x185B9CC2BF0
class UIComponent_ChampionSkins
{
public:
	unsigned char                                      UnknownData00[0x185B9CC2BF0];                             // 0x0000(0x185B9CC2BF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChampionSkins");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChestDisplay
// 0x185B9CC1F30
class UIComponent_ChestDisplay
{
public:
	unsigned char                                      UnknownData00[0x185B9CC1F30];                             // 0x0000(0x185B9CC1F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChestDisplay");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChestDisplayWithCTA
// 0x185B8264F00
class UIComponent_ChestDisplayWithCTA
{
public:
	unsigned char                                      UnknownData00[0x185B8264F00];                             // 0x0000(0x185B8264F00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChestDisplayWithCTA");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChestItemButton
// 0x185B8268740
class UIComponent_ChestItemButton
{
public:
	unsigned char                                      UnknownData00[0x185B8268740];                             // 0x0000(0x185B8268740) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChestItemButton");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChestPanelTencent
// 0x185B9CC1030
class UIComponent_ChestPanelTencent
{
public:
	unsigned char                                      UnknownData00[0x185B9CC1030];                             // 0x0000(0x185B9CC1030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChestPanelTencent");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChestTab
// 0x185B826A300
class UIComponent_ChestTab
{
public:
	unsigned char                                      UnknownData00[0x185B826A300];                             // 0x0000(0x185B826A300) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChestTab");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChestTooltip
// 0x185B9CC1270
class UIComponent_ChestTooltip
{
public:
	unsigned char                                      UnknownData00[0x185B9CC1270];                             // 0x0000(0x185B9CC1270) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChestTooltip");
		return ptr;
	}

};


// Class TgClient.UIComponent_CommendationHistoryPanel
// 0x185B8268B00
class UIComponent_CommendationHistoryPanel
{
public:
	unsigned char                                      UnknownData00[0x185B8268B00];                             // 0x0000(0x185B8268B00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CommendationHistoryPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_CommendationToastEntry
// 0x185B826CD00
class UIComponent_CommendationToastEntry
{
public:
	unsigned char                                      UnknownData00[0x185B826CD00];                             // 0x0000(0x185B826CD00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CommendationToastEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_CorrupterCorruptionUI
// 0x185B5559DE0
class UIComponent_CorrupterCorruptionUI
{
public:
	unsigned char                                      UnknownData00[0x185B5559DE0];                             // 0x0000(0x185B5559DE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CorrupterCorruptionUI");
		return ptr;
	}

};


// Class TgClient.UIComponent_CorvusMark
// 0x185B826CE80
class UIComponent_CorvusMark
{
public:
	unsigned char                                      UnknownData00[0x185B826CE80];                             // 0x0000(0x185B826CE80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CorvusMark");
		return ptr;
	}

};


// Class TgClient.UIComponent_CorvusMarkTeam
// 0x185B826ACC0
class UIComponent_CorvusMarkTeam
{
public:
	unsigned char                                      UnknownData00[0x185B826ACC0];                             // 0x0000(0x185B826ACC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CorvusMarkTeam");
		return ptr;
	}

};


// Class TgClient.UIComponent_CountdownText
// 0x185B9CC46F0
class UIComponent_CountdownText
{
public:
	unsigned char                                      UnknownData00[0x185B9CC46F0];                             // 0x0000(0x185B9CC46F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CountdownText");
		return ptr;
	}

};


// Class TgClient.UIComponent_CrossPlayIcon
// 0x0000
class UIComponent_CrossPlayIcon
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CrossPlayIcon");
		return ptr;
	}

};


// Class TgClient.UIComponent_CTA
// 0x185B9CC3BB0
class UIComponent_CTA
{
public:
	unsigned char                                      UnknownData00[0x185B9CC3BB0];                             // 0x0000(0x185B9CC3BB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CTA");
		return ptr;
	}

};


// Class TgClient.UIComponent_Currency
// 0x185B9CC5770
class UIComponent_Currency
{
public:
	unsigned char                                      UnknownData00[0x185B9CC5770];                             // 0x0000(0x185B9CC5770) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Currency");
		return ptr;
	}

};


// Class TgClient.UIComponent_CurrencyIcon
// 0x0000
class UIComponent_CurrencyIcon
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CurrencyIcon");
		return ptr;
	}

};


// Class TgClient.UIComponent_CustomMatch
// 0x185B826AC00
class UIComponent_CustomMatch
{
public:
	unsigned char                                      UnknownData00[0x185B826AC00];                             // 0x0000(0x185B826AC00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CustomMatch");
		return ptr;
	}

};


// Class TgClient.UIComponent_CustomMatchMember
// 0x185B826BEC0
class UIComponent_CustomMatchMember
{
public:
	unsigned char                                      UnknownData00[0x185B826BEC0];                             // 0x0000(0x185B826BEC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CustomMatchMember");
		return ptr;
	}

};


// Class TgClient.UIComponent_DeathRecapPlayer
// 0x185B826CA00
class UIComponent_DeathRecapPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B826CA00];                             // 0x0000(0x185B826CA00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_DeathRecapPlayer");
		return ptr;
	}

};


// Class TgClient.UIComponent_DeathRecapPlayerSkill
// 0x185B826EC80
class UIComponent_DeathRecapPlayerSkill
{
public:
	unsigned char                                      UnknownData00[0x185B826EC80];                             // 0x0000(0x185B826EC80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_DeathRecapPlayerSkill");
		return ptr;
	}

};


// Class TgClient.UIComponent_DemonTeleportTimer
// 0x185B9CC3F70
class UIComponent_DemonTeleportTimer
{
public:
	unsigned char                                      UnknownData00[0x185B9CC3F70];                             // 0x0000(0x185B9CC3F70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_DemonTeleportTimer");
		return ptr;
	}

};


// Class TgClient.UIComponent_DisplayOption
// 0x185B826EF80
class UIComponent_DisplayOption
{
public:
	unsigned char                                      UnknownData00[0x185B826EF80];                             // 0x0000(0x185B826EF80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_DisplayOption");
		return ptr;
	}

};


// Class TgClient.UIComponent_DLCPack
// 0x185B9CC3AF0
class UIComponent_DLCPack
{
public:
	unsigned char                                      UnknownData00[0x185B9CC3AF0];                             // 0x0000(0x185B9CC3AF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_DLCPack");
		return ptr;
	}

};


// Class TgClient.UIComponent_DruidGuardianInfo
// 0x185B826E8C0
class UIComponent_DruidGuardianInfo
{
public:
	unsigned char                                      UnknownData00[0x185B826E8C0];                             // 0x0000(0x185B826E8C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_DruidGuardianInfo");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndOfMatchLobbyBestClass
// 0x185B9CC6A30
class UIComponent_EndOfMatchLobbyBestClass
{
public:
	unsigned char                                      UnknownData00[0x185B9CC6A30];                             // 0x0000(0x185B9CC6A30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndOfMatchLobbyBestClass");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndOfMatchLobbyChallenges
// 0x185B9CC8530
class UIComponent_EndOfMatchLobbyChallenges
{
public:
	unsigned char                                      UnknownData00[0x185B9CC8530];                             // 0x0000(0x185B9CC8530) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndOfMatchLobbyChallenges");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndOfMatchLobbyQuests
// 0x185B9CC71B0
class UIComponent_EndOfMatchLobbyQuests
{
public:
	unsigned char                                      UnknownData00[0x185B9CC71B0];                             // 0x0000(0x185B9CC71B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndOfMatchLobbyQuests");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndOfMatchLobbyRewards
// 0x185B9CC88F0
class UIComponent_EndOfMatchLobbyRewards
{
public:
	unsigned char                                      UnknownData00[0x185B9CC88F0];                             // 0x0000(0x185B9CC88F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndOfMatchLobbyRewards");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndOfMatchLobbyScoreboard
// 0x185B9CC7270
class UIComponent_EndOfMatchLobbyScoreboard
{
public:
	unsigned char                                      UnknownData00[0x185B9CC7270];                             // 0x0000(0x185B9CC7270) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndOfMatchLobbyScoreboard");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndTimesEventOverview
// 0x185B826F280
class UIComponent_EndTimesEventOverview
{
public:
	unsigned char                                      UnknownData00[0x185B826F280];                             // 0x0000(0x185B826F280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndTimesEventOverview");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndTimesEventQuests
// 0x185B826F4C0
class UIComponent_EndTimesEventQuests
{
public:
	unsigned char                                      UnknownData00[0x185B826F4C0];                             // 0x0000(0x185B826F4C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndTimesEventQuests");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndTimesEventRewards
// 0x185B826D9C0
class UIComponent_EndTimesEventRewards
{
public:
	unsigned char                                      UnknownData00[0x185B826D9C0];                             // 0x0000(0x185B826D9C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndTimesEventRewards");
		return ptr;
	}

};


// Class TgClient.UIComponent_EntryToggle
// 0x185B9CC8CB0
class UIComponent_EntryToggle
{
public:
	unsigned char                                      UnknownData00[0x185B9CC8CB0];                             // 0x0000(0x185B9CC8CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EntryToggle");
		return ptr;
	}

};


// Class TgClient.UIComponent_EventBonusPanel
// 0x185B9CC6F70
class UIComponent_EventBonusPanel
{
public:
	unsigned char                                      UnknownData00[0x185B9CC6F70];                             // 0x0000(0x185B9CC6F70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EventBonusPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_EventBundleButton
// 0x185B9CC85F0
class UIComponent_EventBundleButton
{
public:
	unsigned char                                      UnknownData00[0x185B9CC85F0];                             // 0x0000(0x185B9CC85F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EventBundleButton");
		return ptr;
	}

};


// Class TgClient.UIComponent_EventBundlePanel
// 0x185B9CC7630
class UIComponent_EventBundlePanel
{
public:
	unsigned char                                      UnknownData00[0x185B9CC7630];                             // 0x0000(0x185B9CC7630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EventBundlePanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_EventBundlePanelWithRewards
// 0x185B82700C0
class UIComponent_EventBundlePanelWithRewards
{
public:
	unsigned char                                      UnknownData00[0x185B82700C0];                             // 0x0000(0x185B82700C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EventBundlePanelWithRewards");
		return ptr;
	}

};


// Class TgClient.UIComponent_EventPlayPanel
// 0x185B9CC9C70
class UIComponent_EventPlayPanel
{
public:
	unsigned char                                      UnknownData00[0x185B9CC9C70];                             // 0x0000(0x185B9CC9C70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EventPlayPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_EventVault
// 0x185B6649050
class UIComponent_EventVault
{
public:
	unsigned char                                      UnknownData00[0x185B6649050];                             // 0x0000(0x185B6649050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EventVault");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndTimesEventHome
// 0x185B826E500
class UIComponent_EndTimesEventHome
{
public:
	unsigned char                                      UnknownData00[0x185B826E500];                             // 0x0000(0x185B826E500) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndTimesEventHome");
		return ptr;
	}

};


// Class TgClient.UIComponent_ExclusiveItemInfo
// 0x185B9CC9370
class UIComponent_ExclusiveItemInfo
{
public:
	unsigned char                                      UnknownData00[0x185B9CC9370];                             // 0x0000(0x185B9CC9370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ExclusiveItemInfo");
		return ptr;
	}

};


// Class TgClient.UIComponent_ExpandableTextBox
// 0x185B8270480
class UIComponent_ExpandableTextBox
{
public:
	unsigned char                                      UnknownData00[0x185B8270480];                             // 0x0000(0x185B8270480) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ExpandableTextBox");
		return ptr;
	}

};


// Class TgClient.UIComponent_FuriaHolyWrathBar
// 0x185B9CCBB30
class UIComponent_FuriaHolyWrathBar
{
public:
	unsigned char                                      UnknownData00[0x185B9CCBB30];                             // 0x0000(0x185B9CCBB30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_FuriaHolyWrathBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_GemPack
// 0x185B9CCB470
class UIComponent_GemPack
{
public:
	unsigned char                                      UnknownData00[0x185B9CCB470];                             // 0x0000(0x185B9CCB470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_GemPack");
		return ptr;
	}

};


// Class TgClient.UIComponent_GenericTitleButtons
// 0x185B9CCAC30
class UIComponent_GenericTitleButtons
{
public:
	unsigned char                                      UnknownData00[0x185B9CCAC30];                             // 0x0000(0x185B9CCAC30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_GenericTitleButtons");
		return ptr;
	}

};


// Class TgClient.UIComponent_GenericTitleInputButtons
// 0x185B9CCF070
class UIComponent_GenericTitleInputButtons
{
public:
	unsigned char                                      UnknownData00[0x185B9CCF070];                             // 0x0000(0x185B9CCF070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_GenericTitleInputButtons");
		return ptr;
	}

};


// Class TgClient.UIComponent_HalloweenEventHome
// 0x185B9CCCA30
class UIComponent_HalloweenEventHome
{
public:
	unsigned char                                      UnknownData00[0x185B9CCCA30];                             // 0x0000(0x185B9CCCA30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HalloweenEventHome");
		return ptr;
	}

};


// Class TgClient.UIComponent_HalloweenEventOverview
// 0x185B9CCDE70
class UIComponent_HalloweenEventOverview
{
public:
	unsigned char                                      UnknownData00[0x185B9CCDE70];                             // 0x0000(0x185B9CCDE70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HalloweenEventOverview");
		return ptr;
	}

};


// Class TgClient.UIComponent_HalloweenEventStore
// 0x185B9CCE770
class UIComponent_HalloweenEventStore
{
public:
	unsigned char                                      UnknownData00[0x185B9CCE770];                             // 0x0000(0x185B9CCE770) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HalloweenEventStore");
		return ptr;
	}

};


// Class TgClient.UIComponent_HealFeed
// 0x185B664A6D0
class UIComponent_HealFeed
{
public:
	unsigned char                                      UnknownData00[0x185B664A6D0];                             // 0x0000(0x185B664A6D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HealFeed");
		return ptr;
	}

};


// Class TgClient.UIComponent_HealFeedEntry
// 0x185B554C8C0
class UIComponent_HealFeedEntry
{
public:
	unsigned char                                      UnknownData00[0x185B554C8C0];                             // 0x0000(0x185B554C8C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HealFeedEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_HealthBar
// 0x185B9CD1CB0
class UIComponent_HealthBar
{
public:
	unsigned char                                      UnknownData00[0x185B9CD1CB0];                             // 0x0000(0x185B9CD1CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HealthBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_HealthBar_Overlay
// 0x185B9CD22B0
class UIComponent_HealthBar_Overlay
{
public:
	unsigned char                                      UnknownData00[0x185B9CD22B0];                             // 0x0000(0x185B9CD22B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HealthBar_Overlay");
		return ptr;
	}

};


// Class TgClient.UIComponent_HealthBar_Overlay_Deployable
// 0x185B9CD3570
class UIComponent_HealthBar_Overlay_Deployable
{
public:
	unsigned char                                      UnknownData00[0x185B9CD3570];                             // 0x0000(0x185B9CD3570) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HealthBar_Overlay_Deployable");
		return ptr;
	}

};


// Class TgClient.UIComponent_HealthBar_Overlay_Player
// 0x185B9CD3930
class UIComponent_HealthBar_Overlay_Player
{
public:
	unsigned char                                      UnknownData00[0x185B9CD3930];                             // 0x0000(0x185B9CD3930) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HealthBar_Overlay_Player");
		return ptr;
	}

};


// Class TgClient.UIComponent_HealthBar_Player
// 0x185B9CD5370
class UIComponent_HealthBar_Player
{
public:
	unsigned char                                      UnknownData00[0x185B9CD5370];                             // 0x0000(0x185B9CD5370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HealthBar_Player");
		return ptr;
	}

};


// Class TgClient.UIComponent_HealthBarDamageOverlay
// 0x185B9CD57F0
class UIComponent_HealthBarDamageOverlay
{
public:
	unsigned char                                      UnknownData00[0x185B9CD57F0];                             // 0x0000(0x185B9CD57F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HealthBarDamageOverlay");
		return ptr;
	}

};


// Class TgClient.UIComponent_HnHEventHome
// 0x185B9CD55B0
class UIComponent_HnHEventHome
{
public:
	unsigned char                                      UnknownData00[0x185B9CD55B0];                             // 0x0000(0x185B9CD55B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HnHEventHome");
		return ptr;
	}

};


// Class TgClient.UIComponent_HnHEventOverview
// 0x185B9CD5BB0
class UIComponent_HnHEventOverview
{
public:
	unsigned char                                      UnknownData00[0x185B9CD5BB0];                             // 0x0000(0x185B9CD5BB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HnHEventOverview");
		return ptr;
	}

};


// Class TgClient.UIComponent_HnHEventQuests
// 0x185B9CD64B0
class UIComponent_HnHEventQuests
{
public:
	unsigned char                                      UnknownData00[0x185B9CD64B0];                             // 0x0000(0x185B9CD64B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HnHEventQuests");
		return ptr;
	}

};


// Class TgClient.UIComponent_HnHEventStore
// 0x185B9CD8730
class UIComponent_HnHEventStore
{
public:
	unsigned char                                      UnknownData00[0x185B9CD8730];                             // 0x0000(0x185B9CD8730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HnHEventStore");
		return ptr;
	}

};


// Class TgClient.UIComponent_HoldPrompt
// 0x185B9CDA230
class UIComponent_HoldPrompt
{
public:
	unsigned char                                      UnknownData00[0x185B9CDA230];                             // 0x0000(0x185B9CDA230) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HoldPrompt");
		return ptr;
	}

};


// Class TgClient.UIComponent_HudScoreHH
// 0x185B9CD8670
class UIComponent_HudScoreHH
{
public:
	unsigned char                                      UnknownData00[0x185B9CD8670];                             // 0x0000(0x185B9CD8670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HudScoreHH");
		return ptr;
	}

};


// Class TgClient.UIComponent_HudScoreHH_Climb
// 0x185B9CD8D30
class UIComponent_HudScoreHH_Climb
{
public:
	unsigned char                                      UnknownData00[0x185B9CD8D30];                             // 0x0000(0x185B9CD8D30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HudScoreHH_Climb");
		return ptr;
	}

};


// Class TgClient.UIComponent_HudScoreTDM
// 0x185B9CDDE30
class UIComponent_HudScoreTDM
{
public:
	unsigned char                                      UnknownData00[0x185B9CDDE30];                             // 0x0000(0x185B9CDDE30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HudScoreTDM");
		return ptr;
	}

};


// Class TgClient.UIComponent_HudScoreHH_TDM
// 0x0000
class UIComponent_HudScoreHH_TDM
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HudScoreHH_TDM");
		return ptr;
	}

};


// Class TgClient.UIComponent_HudSkillCardCooldown
// 0x185B9CDDCB0
class UIComponent_HudSkillCardCooldown
{
public:
	unsigned char                                      UnknownData00[0x185B9CDDCB0];                             // 0x0000(0x185B9CDDCB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HudSkillCardCooldown");
		return ptr;
	}

};


// Class TgClient.UIComponent_HudSkillIcon
// 0x185B9CDCAB0
class UIComponent_HudSkillIcon
{
public:
	unsigned char                                      UnknownData00[0x185B9CDCAB0];                             // 0x0000(0x185B9CDCAB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HudSkillIcon");
		return ptr;
	}

};


// Class TgClient.UIComponent_HudSkillIcon_Ult
// 0x185B9CDCB70
class UIComponent_HudSkillIcon_Ult
{
public:
	unsigned char                                      UnknownData00[0x185B9CDCB70];                             // 0x0000(0x185B9CDCB70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HudSkillIcon_Ult");
		return ptr;
	}

};


// Class TgClient.UIComponent_ImaniManaBar
// 0x185B8273480
class UIComponent_ImaniManaBar
{
public:
	unsigned char                                      UnknownData00[0x185B8273480];                             // 0x0000(0x185B8273480) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ImaniManaBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_Item
// 0x185B9CE06B0
class UIComponent_Item
{
public:
	unsigned char                                      UnknownData00[0x185B9CE06B0];                             // 0x0000(0x185B9CE06B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Item");
		return ptr;
	}

};


// Class TgClient.UIComponent_Item_Card
// 0x185B9CE0FB0
class UIComponent_Item_Card
{
public:
	unsigned char                                      UnknownData00[0x185B9CE0FB0];                             // 0x0000(0x185B9CE0FB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Item_Card");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemColorPicker
// 0x185B8272940
class UIComponent_ItemColorPicker
{
public:
	unsigned char                                      UnknownData00[0x185B8272940];                             // 0x0000(0x185B8272940) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemColorPicker");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemColorPickerEntry
// 0x185B8270D80
class UIComponent_ItemColorPickerEntry
{
public:
	unsigned char                                      UnknownData00[0x185B8270D80];                             // 0x0000(0x185B8270D80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemColorPickerEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemCustomize
// 0x185B9CE09B0
class UIComponent_ItemCustomize
{
public:
	unsigned char                                      UnknownData00[0x185B9CE09B0];                             // 0x0000(0x185B9CE09B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemCustomize");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemDisplay
// 0x185B9CDEA30
class UIComponent_ItemDisplay
{
public:
	unsigned char                                      UnknownData00[0x185B9CDEA30];                             // 0x0000(0x185B9CDEA30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemDisplay");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemGeneric
// 0x185B9CDFFF0
class UIComponent_ItemGeneric
{
public:
	unsigned char                                      UnknownData00[0x185B9CDFFF0];                             // 0x0000(0x185B9CDFFF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemGeneric");
		return ptr;
	}

};


// Class TgClient.UIComponent_EndTimesEventRewardItem
// 0x185B826FB80
class UIComponent_EndTimesEventRewardItem
{
public:
	unsigned char                                      UnknownData00[0x185B826FB80];                             // 0x0000(0x185B826FB80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EndTimesEventRewardItem");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemHint
// 0x185B8270FC0
class UIComponent_ItemHint
{
public:
	unsigned char                                      UnknownData00[0x185B8270FC0];                             // 0x0000(0x185B8270FC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemHint");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemIconInventory
// 0x185B9CE1670
class UIComponent_ItemIconInventory
{
public:
	unsigned char                                      UnknownData00[0x185B9CE1670];                             // 0x0000(0x185B9CE1670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemIconInventory");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemObtainabilityBanner
// 0x185B9CE1730
class UIComponent_ItemObtainabilityBanner
{
public:
	unsigned char                                      UnknownData00[0x185B9CE1730];                             // 0x0000(0x185B9CE1730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemObtainabilityBanner");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemPreviewStack
// 0x185B9CE1BB0
class UIComponent_ItemPreviewStack
{
public:
	unsigned char                                      UnknownData00[0x185B9CE1BB0];                             // 0x0000(0x185B9CE1BB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemPreviewStack");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemPurchaseButton
// 0x185B82721C0
class UIComponent_ItemPurchaseButton
{
public:
	unsigned char                                      UnknownData00[0x185B82721C0];                             // 0x0000(0x185B82721C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemPurchaseButton");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemRadialMenu
// 0x185B9CE4070
class UIComponent_ItemRadialMenu
{
public:
	unsigned char                                      UnknownData00[0x185B9CE4070];                             // 0x0000(0x185B9CE4070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemRadialMenu");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemRadialMenu_Icon
// 0x185B9CE35F0
class UIComponent_ItemRadialMenu_Icon
{
public:
	unsigned char                                      UnknownData00[0x185B9CE35F0];                             // 0x0000(0x185B9CE35F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemRadialMenu_Icon");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemRadialMenu_Text
// 0x185B9CE30B0
class UIComponent_ItemRadialMenu_Text
{
public:
	unsigned char                                      UnknownData00[0x185B9CE30B0];                             // 0x0000(0x185B9CE30B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemRadialMenu_Text");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemRadialMenuVGS
// 0x185B8272280
class UIComponent_ItemRadialMenuVGS
{
public:
	unsigned char                                      UnknownData00[0x185B8272280];                             // 0x0000(0x185B8272280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemRadialMenuVGS");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemStats
// 0x185B9CE3A70
class UIComponent_ItemStats
{
public:
	unsigned char                                      UnknownData00[0x185B9CE3A70];                             // 0x0000(0x185B9CE3A70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemStats");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemStatsEntry
// 0x185B9CE39B0
class UIComponent_ItemStatsEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9CE39B0];                             // 0x0000(0x185B9CE39B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemStatsEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemTooltip
// 0x185B9CE15B0
class UIComponent_ItemTooltip
{
public:
	unsigned char                                      UnknownData00[0x185B9CE15B0];                             // 0x0000(0x185B9CE15B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemTooltip");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemUIChampion
// 0x185B8275700
class UIComponent_ItemUIChampion
{
public:
	unsigned char                                      UnknownData00[0x185B8275700];                             // 0x0000(0x185B8275700) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemUIChampion");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemWithPrice
// 0x185B9CE33B0
class UIComponent_ItemWithPrice
{
public:
	unsigned char                                      UnknownData00[0x185B9CE33B0];                             // 0x0000(0x185B9CE33B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemWithPrice");
		return ptr;
	}

};


// Class TgClient.UIComponent_LexTarget
// 0x185B9CE41F0
class UIComponent_LexTarget
{
public:
	unsigned char                                      UnknownData00[0x185B9CE41F0];                             // 0x0000(0x185B9CE41F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LexTarget");
		return ptr;
	}

};


// Class TgClient.UIComponent_LexVengeance
// 0x185B9CE7970
class UIComponent_LexVengeance
{
public:
	unsigned char                                      UnknownData00[0x185B9CE7970];                             // 0x0000(0x185B9CE7970) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LexVengeance");
		return ptr;
	}

};


// Class TgClient.UIComponent_Loadout
// 0x185B9CE9EF0
class UIComponent_Loadout
{
public:
	unsigned char                                      UnknownData00[0x185B9CE9EF0];                             // 0x0000(0x185B9CE9EF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Loadout");
		return ptr;
	}

};


// Class TgClient.UIComponent_LootItem
// 0x185B9CE7DF0
class UIComponent_LootItem
{
public:
	unsigned char                                      UnknownData00[0x185B9CE7DF0];                             // 0x0000(0x185B9CE7DF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LootItem");
		return ptr;
	}

};


// Class TgClient.UIComponent_MasteryRewards
// 0x185B9CE8C30
class UIComponent_MasteryRewards
{
public:
	unsigned char                                      UnknownData00[0x185B9CE8C30];                             // 0x0000(0x185B9CE8C30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MasteryRewards");
		return ptr;
	}

};


// Class TgClient.UIComponent_MasteryRewardsEntry
// 0x185B9CEB4B0
class UIComponent_MasteryRewardsEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9CEB4B0];                             // 0x0000(0x185B9CEB4B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MasteryRewardsEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchDisplay
// 0x185B554AB60
class UIComponent_MatchDisplay
{
public:
	unsigned char                                      UnknownData00[0x185B554AB60];                             // 0x0000(0x185B554AB60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchDisplay");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyBans
// 0x185B8275F40
class UIComponent_MatchLobbyBans
{
public:
	unsigned char                                      UnknownData00[0x185B8275F40];                             // 0x0000(0x185B8275F40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyBans");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyBansChampion
// 0x185B8273C00
class UIComponent_MatchLobbyBansChampion
{
public:
	unsigned char                                      UnknownData00[0x185B8273C00];                             // 0x0000(0x185B8273C00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyBansChampion");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyChampion
// 0x185B5559980
class UIComponent_MatchLobbyChampion
{
public:
	unsigned char                                      UnknownData00[0x185B5559980];                             // 0x0000(0x185B5559980) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyChampion");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyChampionList
// 0x185B8275640
class UIComponent_MatchLobbyChampionList
{
public:
	unsigned char                                      UnknownData00[0x185B8275640];                             // 0x0000(0x185B8275640) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyChampionList");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyHeader
// 0x185B8276B40
class UIComponent_MatchLobbyHeader
{
public:
	unsigned char                                      UnknownData00[0x185B8276B40];                             // 0x0000(0x185B8276B40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyHeader");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyMap
// 0x185B8278E80
class UIComponent_MatchLobbyMap
{
public:
	unsigned char                                      UnknownData00[0x185B8278E80];                             // 0x0000(0x185B8278E80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyMap");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyPickNotification
// 0x185B8276F00
class UIComponent_MatchLobbyPickNotification
{
public:
	unsigned char                                      UnknownData00[0x185B8276F00];                             // 0x0000(0x185B8276F00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyPickNotification");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyRoleIndicator
// 0x185B8277500
class UIComponent_MatchLobbyRoleIndicator
{
public:
	unsigned char                                      UnknownData00[0x185B8277500];                             // 0x0000(0x185B8277500) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyRoleIndicator");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyRoleTab
// 0x185B8276CC0
class UIComponent_MatchLobbyRoleTab
{
public:
	unsigned char                                      UnknownData00[0x185B8276CC0];                             // 0x0000(0x185B8276CC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyRoleTab");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbySoundCues
// 0x185B8277680
class UIComponent_MatchLobbySoundCues
{
public:
	unsigned char                                      UnknownData00[0x185B8277680];                             // 0x0000(0x185B8277680) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbySoundCues");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyTeamChampion
// 0x185B8278C40
class UIComponent_MatchLobbyTeamChampion
{
public:
	unsigned char                                      UnknownData00[0x185B8278C40];                             // 0x0000(0x185B8278C40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyTeamChampion");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyTeamTip
// 0x185B827C0C0
class UIComponent_MatchLobbyTeamTip
{
public:
	unsigned char                                      UnknownData00[0x185B827C0C0];                             // 0x0000(0x185B827C0C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyTeamTip");
		return ptr;
	}

};


// Class TgClient.UIComponent_MojiCounter
// 0x185B6649830
class UIComponent_MojiCounter
{
public:
	unsigned char                                      UnknownData00[0x185B6649830];                             // 0x0000(0x185B6649830) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MojiCounter");
		return ptr;
	}

};


// Class TgClient.UIComponent_MVP
// 0x185B98FA7B0
class UIComponent_MVP
{
public:
	unsigned char                                      UnknownData00[0x185B98FA7B0];                             // 0x0000(0x185B98FA7B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MVP");
		return ptr;
	}

};


// Class TgClient.UIComponent_MVPCommendationPanel
// 0x185B827A140
class UIComponent_MVPCommendationPanel
{
public:
	unsigned char                                      UnknownData00[0x185B827A140];                             // 0x0000(0x185B827A140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MVPCommendationPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_NotificationCenterCoupons
// 0x185B827B940
class UIComponent_NotificationCenterCoupons
{
public:
	unsigned char                                      UnknownData00[0x185B827B940];                             // 0x0000(0x185B827B940) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_NotificationCenterCoupons");
		return ptr;
	}

};


// Class TgClient.UIComponent_NotificationCenterNotifications
// 0x185B827BB80
class UIComponent_NotificationCenterNotifications
{
public:
	unsigned char                                      UnknownData00[0x185B827BB80];                             // 0x0000(0x185B827BB80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_NotificationCenterNotifications");
		return ptr;
	}

};


// Class TgClient.UIComponent_NotificationCenterPatchNotes
// 0x185B473D8F0
class UIComponent_NotificationCenterPatchNotes
{
public:
	unsigned char                                      UnknownData00[0x185B473D8F0];                             // 0x0000(0x185B473D8F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_NotificationCenterPatchNotes");
		return ptr;
	}

};


// Class TgClient.UIComponent_OracleSoulCharges
// 0x185B554CBE0
class UIComponent_OracleSoulCharges
{
public:
	unsigned char                                      UnknownData00[0x185B554CBE0];                             // 0x0000(0x185B554CBE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_OracleSoulCharges");
		return ptr;
	}

};


// Class TgClient.UIComponent_OwlStealthBar
// 0x185B98FAE70
class UIComponent_OwlStealthBar
{
public:
	unsigned char                                      UnknownData00[0x185B98FAE70];                             // 0x0000(0x185B98FAE70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_OwlStealthBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_PingIndicator
// 0x185B827CE40
class UIComponent_PingIndicator
{
public:
	unsigned char                                      UnknownData00[0x185B827CE40];                             // 0x0000(0x185B827CE40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PingIndicator");
		return ptr;
	}

};


// Class TgClient.UIComponent_PityTimer
// 0x0000
class UIComponent_PityTimer
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PityTimer");
		return ptr;
	}

};


// Class TgClient.UIComponent_PlayCustom
// 0x185B827FE40
class UIComponent_PlayCustom
{
public:
	unsigned char                                      UnknownData00[0x185B827FE40];                             // 0x0000(0x185B827FE40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PlayCustom");
		return ptr;
	}

};


// Class TgClient.UIComponent_PlayDevQueues
// 0x185B8281A00
class UIComponent_PlayDevQueues
{
public:
	unsigned char                                      UnknownData00[0x185B8281A00];                             // 0x0000(0x185B8281A00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PlayDevQueues");
		return ptr;
	}

};


// Class TgClient.UIComponent_PlayerCurrency
// 0x185B98FC070
class UIComponent_PlayerCurrency
{
public:
	unsigned char                                      UnknownData00[0x185B98FC070];                             // 0x0000(0x185B98FC070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PlayerCurrency");
		return ptr;
	}

};


// Class TgClient.UIComponent_PlayQuickPlay
// 0x185B8281280
class UIComponent_PlayQuickPlay
{
public:
	unsigned char                                      UnknownData00[0x185B8281280];                             // 0x0000(0x185B8281280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PlayQuickPlay");
		return ptr;
	}

};


// Class TgClient.UIComponent_PlayRanked
// 0x185B827F6C0
class UIComponent_PlayRanked
{
public:
	unsigned char                                      UnknownData00[0x185B827F6C0];                             // 0x0000(0x185B827F6C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PlayRanked");
		return ptr;
	}

};


// Class TgClient.UIComponent_PlayTraining
// 0x185B8281040
class UIComponent_PlayTraining
{
public:
	unsigned char                                      UnknownData00[0x185B8281040];                             // 0x0000(0x185B8281040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PlayTraining");
		return ptr;
	}

};


// Class TgClient.UIComponent_PurchaseOption
// 0x185B98FF1F0
class UIComponent_PurchaseOption
{
public:
	unsigned char                                      UnknownData00[0x185B98FF1F0];                             // 0x0000(0x185B98FF1F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PurchaseOption");
		return ptr;
	}

};


// Class TgClient.UIComponent_RadialEquipMenu
// 0x185B99022B0
class UIComponent_RadialEquipMenu
{
public:
	unsigned char                                      UnknownData00[0x185B99022B0];                             // 0x0000(0x185B99022B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RadialEquipMenu");
		return ptr;
	}

};


// Class TgClient.UIComponent_RankedSnapshotPlayer
// 0x185B82808C0
class UIComponent_RankedSnapshotPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B82808C0];                             // 0x0000(0x185B82808C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RankedSnapshotPlayer");
		return ptr;
	}

};


// Class TgClient.UIComponent_RatingTooltip
// 0x0000
class UIComponent_RatingTooltip
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RatingTooltip");
		return ptr;
	}

};


// Class TgClient.UIComponent_RaumSoulCharges
// 0x185B8280440
class UIComponent_RaumSoulCharges
{
public:
	unsigned char                                      UnknownData00[0x185B8280440];                             // 0x0000(0x185B8280440) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RaumSoulCharges");
		return ptr;
	}

};


// Class TgClient.UIComponent_ReportPopup
// 0x185B9903870
class UIComponent_ReportPopup
{
public:
	unsigned char                                      UnknownData00[0x185B9903870];                             // 0x0000(0x185B9903870) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ReportPopup");
		return ptr;
	}

};


// Class TgClient.UIComponent_RewardPanel
// 0x185B9905370
class UIComponent_RewardPanel
{
public:
	unsigned char                                      UnknownData00[0x185B9905370];                             // 0x0000(0x185B9905370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RewardPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_RewardPanelEntry
// 0x185B99076B0
class UIComponent_RewardPanelEntry
{
public:
	unsigned char                                      UnknownData00[0x185B99076B0];                             // 0x0000(0x185B99076B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RewardPanelEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_Rotator
// 0x185B99066F0
class UIComponent_Rotator
{
public:
	unsigned char                                      UnknownData00[0x185B99066F0];                             // 0x0000(0x185B99066F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Rotator");
		return ptr;
	}

};


// Class TgClient.UIComponent_ScrollableText
// 0x185B82811C0
class UIComponent_ScrollableText
{
public:
	unsigned char                                      UnknownData00[0x185B82811C0];                             // 0x0000(0x185B82811C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ScrollableText");
		return ptr;
	}

};


// Class TgClient.UIComponent_ShieldBar
// 0x185B9CE62F0
class UIComponent_ShieldBar
{
public:
	unsigned char                                      UnknownData00[0x185B9CE62F0];                             // 0x0000(0x185B9CE62F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ShieldBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_LazarusShieldBar
// 0x185B66493B0
class UIComponent_LazarusShieldBar
{
public:
	unsigned char                                      UnknownData00[0x185B66493B0];                             // 0x0000(0x185B66493B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LazarusShieldBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_TorvaldShieldBar
// 0x0000
class UIComponent_TorvaldShieldBar
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TorvaldShieldBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_VanguardShieldBar
// 0x185B9912AB0
class UIComponent_VanguardShieldBar
{
public:
	unsigned char                                      UnknownData00[0x185B9912AB0];                             // 0x0000(0x185B9912AB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_VanguardShieldBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_SiteSelectEntry
// 0x185B9907EF0
class UIComponent_SiteSelectEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9907EF0];                             // 0x0000(0x185B9907EF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_SiteSelectEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_StoreAccount
// 0x185B990AFB0
class UIComponent_StoreAccount
{
public:
	unsigned char                                      UnknownData00[0x185B990AFB0];                             // 0x0000(0x185B990AFB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StoreAccount");
		return ptr;
	}

};


// Class TgClient.UIComponent_StoreBountyItems
// 0x185B8285300
class UIComponent_StoreBountyItems
{
public:
	unsigned char                                      UnknownData00[0x185B8285300];                             // 0x0000(0x185B8285300) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StoreBountyItems");
		return ptr;
	}

};


// Class TgClient.UIComponent_StoreDLC
// 0x185B9909DB0
class UIComponent_StoreDLC
{
public:
	unsigned char                                      UnknownData00[0x185B9909DB0];                             // 0x0000(0x185B9909DB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StoreDLC");
		return ptr;
	}

};


// Class TgClient.UIComponent_StoreFeatured
// 0x185B9909030
class UIComponent_StoreFeatured
{
public:
	unsigned char                                      UnknownData00[0x185B9909030];                             // 0x0000(0x185B9909030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StoreFeatured");
		return ptr;
	}

};


// Class TgClient.UIComponent_StoreHiddenDLC
// 0x185B9909C30
class UIComponent_StoreHiddenDLC
{
public:
	unsigned char                                      UnknownData00[0x185B9909C30];                             // 0x0000(0x185B9909C30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StoreHiddenDLC");
		return ptr;
	}

};


// Class TgClient.UIComponent_StoreItems
// 0x185B990A6B0
class UIComponent_StoreItems
{
public:
	unsigned char                                      UnknownData00[0x185B990A6B0];                             // 0x0000(0x185B990A6B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StoreItems");
		return ptr;
	}

};


// Class TgClient.UIComponent_StoreItemTab
// 0x185B9908670
class UIComponent_StoreItemTab
{
public:
	unsigned char                                      UnknownData00[0x185B9908670];                             // 0x0000(0x185B9908670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StoreItemTab");
		return ptr;
	}

};


// Class TgClient.UIComponent_StoreMixerItems
// 0x185B82847C0
class UIComponent_StoreMixerItems
{
public:
	unsigned char                                      UnknownData00[0x185B82847C0];                             // 0x0000(0x185B82847C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StoreMixerItems");
		return ptr;
	}

};


// Class TgClient.UIComponent_StreetStyleEventHome
// 0x185B8284F40
class UIComponent_StreetStyleEventHome
{
public:
	unsigned char                                      UnknownData00[0x185B8284F40];                             // 0x0000(0x185B8284F40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StreetStyleEventHome");
		return ptr;
	}

};


// Class TgClient.UIComponent_StreetStyleEventOverview
// 0x185B8282FC0
class UIComponent_StreetStyleEventOverview
{
public:
	unsigned char                                      UnknownData00[0x185B8282FC0];                             // 0x0000(0x185B8282FC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StreetStyleEventOverview");
		return ptr;
	}

};


// Class TgClient.UIComponent_StreetStyleEventQuests
// 0x185B8284340
class UIComponent_StreetStyleEventQuests
{
public:
	unsigned char                                      UnknownData00[0x185B8284340];                             // 0x0000(0x185B8284340) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StreetStyleEventQuests");
		return ptr;
	}

};


// Class TgClient.UIComponent_StreetStyleEventRewards
// 0x185B8283EC0
class UIComponent_StreetStyleEventRewards
{
public:
	unsigned char                                      UnknownData00[0x185B8283EC0];                             // 0x0000(0x185B8283EC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StreetStyleEventRewards");
		return ptr;
	}

};


// Class TgClient.UIComponent_SummerEventHome
// 0x185B990B430
class UIComponent_SummerEventHome
{
public:
	unsigned char                                      UnknownData00[0x185B990B430];                             // 0x0000(0x185B990B430) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_SummerEventHome");
		return ptr;
	}

};


// Class TgClient.UIComponent_SummerEventOverview
// 0x185B990DFB0
class UIComponent_SummerEventOverview
{
public:
	unsigned char                                      UnknownData00[0x185B990DFB0];                             // 0x0000(0x185B990DFB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_SummerEventOverview");
		return ptr;
	}

};


// Class TgClient.UIComponent_SummerEventRewards
// 0x185B990BF70
class UIComponent_SummerEventRewards
{
public:
	unsigned char                                      UnknownData00[0x185B990BF70];                             // 0x0000(0x185B990BF70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_SummerEventRewards");
		return ptr;
	}

};


// Class TgClient.UIComponent_Talent
// 0x185B990CCF0
class UIComponent_Talent
{
public:
	unsigned char                                      UnknownData00[0x185B990CCF0];                             // 0x0000(0x185B990CCF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Talent");
		return ptr;
	}

};


// Class TgClient.UIComponent_TalentSelection
// 0x185B990C1B0
class UIComponent_TalentSelection
{
public:
	unsigned char                                      UnknownData00[0x185B990C1B0];                             // 0x0000(0x185B990C1B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TalentSelection");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter
// 0x185B990DA70
class UIComponent_Targeter
{
public:
	unsigned char                                      UnknownData00[0x185B990DA70];                             // 0x0000(0x185B990DA70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_BracketTargeter
// 0x185B990B1F0
class UIComponent_Targeter_BracketTargeter
{
public:
	unsigned char                                      UnknownData00[0x185B990B1F0];                             // 0x0000(0x185B990B1F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_BracketTargeter");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_AstralMark
// 0x0000
class UIComponent_Targeter_AstralMark
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_AstralMark");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_CorvusMark
// 0x0000
class UIComponent_Targeter_CorvusMark
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_CorvusMark");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_HuntersMark
// 0x0000
class UIComponent_Targeter_HuntersMark
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_HuntersMark");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_Protection
// 0x0000
class UIComponent_Targeter_Protection
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_Protection");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_PointTargeter
// 0x0000
class UIComponent_Targeter_PointTargeter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_PointTargeter");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_DimensionalLink
// 0x0000
class UIComponent_Targeter_DimensionalLink
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_DimensionalLink");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_DruidFoxAggro
// 0x0000
class UIComponent_Targeter_DruidFoxAggro
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_DruidFoxAggro");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_DruidGuidedArrow
// 0x0000
class UIComponent_Targeter_DruidGuidedArrow
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_DruidGuidedArrow");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_Headhunter
// 0x185B990B5B0
class UIComponent_Targeter_Headhunter
{
public:
	unsigned char                                      UnknownData00[0x185B990B5B0];                             // 0x0000(0x185B990B5B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_Headhunter");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_Nullify
// 0x0000
class UIComponent_Targeter_Nullify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_Nullify");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_RestoreSoul
// 0x0000
class UIComponent_Targeter_RestoreSoul
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_RestoreSoul");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_Rider
// 0x185B6647550
class UIComponent_Targeter_Rider
{
public:
	unsigned char                                      UnknownData00[0x185B6647550];                             // 0x0000(0x185B6647550) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_Rider");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_VanguardGrab
// 0x0000
class UIComponent_Targeter_VanguardGrab
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_VanguardGrab");
		return ptr;
	}

};


// Class TgClient.UIComponent_Targeter_VanguardUlt
// 0x0000
class UIComponent_Targeter_VanguardUlt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Targeter_VanguardUlt");
		return ptr;
	}

};


// Class TgClient.UIComponent_TargeterManager
// 0x185B990C570
class UIComponent_TargeterManager
{
public:
	unsigned char                                      UnknownData00[0x185B990C570];                             // 0x0000(0x185B990C570) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TargeterManager");
		return ptr;
	}

};


// Class TgClient.UIComponent_TeamPortraits
// 0x185B990E130
class UIComponent_TeamPortraits
{
public:
	unsigned char                                      UnknownData00[0x185B990E130];                             // 0x0000(0x185B990E130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TeamPortraits");
		return ptr;
	}

};


// Class TgClient.UIComponent_TelepunchTarget
// 0x185B9910830
class UIComponent_TelepunchTarget
{
public:
	unsigned char                                      UnknownData00[0x185B9910830];                             // 0x0000(0x185B9910830) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TelepunchTarget");
		return ptr;
	}

};


// Class TgClient.UIComponent_TencentJsonPanel
// 0x185B990F330
class UIComponent_TencentJsonPanel
{
public:
	unsigned char                                      UnknownData00[0x185B990F330];                             // 0x0000(0x185B990F330) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TencentJsonPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_TitlesView
// 0x185B6647AF0
class UIComponent_TitlesView
{
public:
	unsigned char                                      UnknownData00[0x185B6647AF0];                             // 0x0000(0x185B6647AF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TitlesView");
		return ptr;
	}

};


// Class TgClient.UIComponent_TitleTooltip
// 0x185B99109B0
class UIComponent_TitleTooltip
{
public:
	unsigned char                                      UnknownData00[0x185B99109B0];                             // 0x0000(0x185B99109B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TitleTooltip");
		return ptr;
	}

};


// Class TgClient.UIComponent_ToastEntry
// 0x185B9911130
class UIComponent_ToastEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9911130];                             // 0x0000(0x185B9911130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ToastEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_Tooltip
// 0x185B9911EB0
class UIComponent_Tooltip
{
public:
	unsigned char                                      UnknownData00[0x185B9911EB0];                             // 0x0000(0x185B9911EB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Tooltip");
		return ptr;
	}

};


// Class TgClient.UIComponent_TorvaldShieldText
// 0x185B99120F0
class UIComponent_TorvaldShieldText
{
public:
	unsigned char                                      UnknownData00[0x185B99120F0];                             // 0x0000(0x185B99120F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TorvaldShieldText");
		return ptr;
	}

};


// Class TgClient.UIComponent_VGSListEntry
// 0x185B8284940
class UIComponent_VGSListEntry
{
public:
	unsigned char                                      UnknownData00[0x185B8284940];                             // 0x0000(0x185B8284940) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_VGSListEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_WinterEventEvents
// 0x185B82826C0
class UIComponent_WinterEventEvents
{
public:
	unsigned char                                      UnknownData00[0x185B82826C0];                             // 0x0000(0x185B82826C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_WinterEventEvents");
		return ptr;
	}

};


// Class TgClient.UIComponent_WinterEventHome
// 0x185B8284640
class UIComponent_WinterEventHome
{
public:
	unsigned char                                      UnknownData00[0x185B8284640];                             // 0x0000(0x185B8284640) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_WinterEventHome");
		return ptr;
	}

};


// Class TgClient.UIComponent_WinterEventOverview
// 0x185B8283080
class UIComponent_WinterEventOverview
{
public:
	unsigned char                                      UnknownData00[0x185B8283080];                             // 0x0000(0x185B8283080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_WinterEventOverview");
		return ptr;
	}

};


// Class TgClient.UIComponent_WinterEventStore
// 0x185B82859C0
class UIComponent_WinterEventStore
{
public:
	unsigned char                                      UnknownData00[0x185B82859C0];                             // 0x0000(0x185B82859C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_WinterEventStore");
		return ptr;
	}

};


// Class TgClient.UIScene
// 0x185B6658470
class UIScene
{
public:
	unsigned char                                      UnknownData00[0x185B6658470];                             // 0x0000(0x185B6658470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene");
		return ptr;
	}

};


// Class TgClient.UIScene_TeamInvite
// 0x0000
class UIScene_TeamInvite
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_TeamInvite");
		return ptr;
	}

};


// Class TgClient.UIScene_UIAccessories
// 0x185B828C200
class UIScene_UIAccessories
{
public:
	unsigned char                                      UnknownData00[0x185B828C200];                             // 0x0000(0x185B828C200) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIAccessories");
		return ptr;
	}

};


// Class TgClient.UIScene_UIAccountLink
// 0x185B5E105E0
class UIScene_UIAccountLink
{
public:
	unsigned char                                      UnknownData00[0x185B5E105E0];                             // 0x0000(0x185B5E105E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIAccountLink");
		return ptr;
	}

};


// Class TgClient.UIScene_UIAcquisition
// 0x185B5E0F860
class UIScene_UIAcquisition
{
public:
	unsigned char                                      UnknownData00[0x185B5E0F860];                             // 0x0000(0x185B5E0F860) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIAcquisition");
		return ptr;
	}

};


// Class TgClient.UIScene_UIAsiaticEvent
// 0x185B5E133A0
class UIScene_UIAsiaticEvent
{
public:
	unsigned char                                      UnknownData00[0x185B5E133A0];                             // 0x0000(0x185B5E133A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIAsiaticEvent");
		return ptr;
	}

};


// Class TgClient.UIScene_UIBattlePass
// 0x185B5E126E0
class UIScene_UIBattlePass
{
public:
	unsigned char                                      UnknownData00[0x185B5E126E0];                             // 0x0000(0x185B5E126E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIBattlePass");
		return ptr;
	}

};


// Class TgClient.UIScene_UIBattlePassXPPurchase
// 0x185B5E139A0
class UIScene_UIBattlePassXPPurchase
{
public:
	unsigned char                                      UnknownData00[0x185B5E139A0];                             // 0x0000(0x185B5E139A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIBattlePassXPPurchase");
		return ptr;
	}

};


// Class TgClient.UIScene_UICalendarEvent
// 0x185B828B6C0
class UIScene_UICalendarEvent
{
public:
	unsigned char                                      UnknownData00[0x185B828B6C0];                             // 0x0000(0x185B828B6C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UICalendarEvent");
		return ptr;
	}

};


// Class TgClient.UIScene_UIChampion
// 0x185B5E15FE0
class UIScene_UIChampion
{
public:
	unsigned char                                      UnknownData00[0x185B5E15FE0];                             // 0x0000(0x185B5E15FE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIChampion");
		return ptr;
	}

};


// Class TgClient.UIScene_UIChampionMastery
// 0x185B5E16E20
class UIScene_UIChampionMastery
{
public:
	unsigned char                                      UnknownData00[0x185B5E16E20];                             // 0x0000(0x185B5E16E20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIChampionMastery");
		return ptr;
	}

};


// Class TgClient.UIScene_UIChampionSelect
// 0x185B5E15020
class UIScene_UIChampionSelect
{
public:
	unsigned char                                      UnknownData00[0x185B5E15020];                             // 0x0000(0x185B5E15020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIChampionSelect");
		return ptr;
	}

};


// Class TgClient.UIScene_UIChatScene
// 0x0000
class UIScene_UIChatScene
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIChatScene");
		return ptr;
	}

};


// Class TgClient.UIScene_UICommendationRewards
// 0x185B828D400
class UIScene_UICommendationRewards
{
public:
	unsigned char                                      UnknownData00[0x185B828D400];                             // 0x0000(0x185B828D400) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UICommendationRewards");
		return ptr;
	}

};


// Class TgClient.UIScene_UICompetitive
// 0x185B5E15560
class UIScene_UICompetitive
{
public:
	unsigned char                                      UnknownData00[0x185B5E15560];                             // 0x0000(0x185B5E15560) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UICompetitive");
		return ptr;
	}

};


// Class TgClient.UIScene_UICompetitivePopupWelcome
// 0x185B5E166A0
class UIScene_UICompetitivePopupWelcome
{
public:
	unsigned char                                      UnknownData00[0x185B5E166A0];                             // 0x0000(0x185B5E166A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UICompetitivePopupWelcome");
		return ptr;
	}

};


// Class TgClient.UIScene_UICompetitiveRankChange
// 0x0000
class UIScene_UICompetitiveRankChange
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UICompetitiveRankChange");
		return ptr;
	}

};


// Class TgClient.UIScene_UICompetitiveRankDecay
// 0x0000
class UIScene_UICompetitiveRankDecay
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UICompetitiveRankDecay");
		return ptr;
	}

};


// Class TgClient.UIScene_UICouponAcquisition
// 0x185B5E142A0
class UIScene_UICouponAcquisition
{
public:
	unsigned char                                      UnknownData00[0x185B5E142A0];                             // 0x0000(0x185B5E142A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UICouponAcquisition");
		return ptr;
	}

};


// Class TgClient.UIScene_UICredits
// 0x185B828C140
class UIScene_UICredits
{
public:
	unsigned char                                      UnknownData00[0x185B828C140];                             // 0x0000(0x185B828C140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UICredits");
		return ptr;
	}

};


// Class TgClient.UIScene_UIDiscardQuestPopup
// 0x185B5E15860
class UIScene_UIDiscardQuestPopup
{
public:
	unsigned char                                      UnknownData00[0x185B5E15860];                             // 0x0000(0x185B5E15860) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIDiscardQuestPopup");
		return ptr;
	}

};


// Class TgClient.UIScene_UIEditLoadouts
// 0x185B5E1BFE0
class UIScene_UIEditLoadouts
{
public:
	unsigned char                                      UnknownData00[0x185B5E1BFE0];                             // 0x0000(0x185B5E1BFE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIEditLoadouts");
		return ptr;
	}

};


// Class TgClient.UIScene_UIEndOfMatchLobby
// 0x185B5E1C220
class UIScene_UIEndOfMatchLobby
{
public:
	unsigned char                                      UnknownData00[0x185B5E1C220];                             // 0x0000(0x185B5E1C220) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIEndOfMatchLobby");
		return ptr;
	}

};


// Class TgClient.UIScene_UIEndTimesEvent
// 0x185B828BD80
class UIScene_UIEndTimesEvent
{
public:
	unsigned char                                      UnknownData00[0x185B828BD80];                             // 0x0000(0x185B828BD80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIEndTimesEvent");
		return ptr;
	}

};


// Class TgClient.UIScene_UIEOMLAcquisition
// 0x185B6654690
class UIScene_UIEOMLAcquisition
{
public:
	unsigned char                                      UnknownData00[0x185B6654690];                             // 0x0000(0x185B6654690) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIEOMLAcquisition");
		return ptr;
	}

};


// Class TgClient.UIScene_UIFacebookLivePopup
// 0x185B5E1DEA0
class UIScene_UIFacebookLivePopup
{
public:
	unsigned char                                      UnknownData00[0x185B5E1DEA0];                             // 0x0000(0x185B5E1DEA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIFacebookLivePopup");
		return ptr;
	}

};


// Class TgClient.UIScene_UIFooter
// 0x0000
class UIScene_UIFooter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIFooter");
		return ptr;
	}

};


// Class TgClient.UIScene_UIFooterGamepad
// 0x185B6654C30
class UIScene_UIFooterGamepad
{
public:
	unsigned char                                      UnknownData00[0x185B6654C30];                             // 0x0000(0x185B6654C30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIFooterGamepad");
		return ptr;
	}

};


// Class TgClient.UIScene_UIFullScreenBattlePass
// 0x185B828B840
class UIScene_UIFullScreenBattlePass
{
public:
	unsigned char                                      UnknownData00[0x185B828B840];                             // 0x0000(0x185B828B840) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIFullScreenBattlePass");
		return ptr;
	}

};


// Class TgClient.UIScene_UIFullScreenPopup
// 0x185B5E1D5A0
class UIScene_UIFullScreenPopup
{
public:
	unsigned char                                      UnknownData00[0x185B5E1D5A0];                             // 0x0000(0x185B5E1D5A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIFullScreenPopup");
		return ptr;
	}

};


// Class TgClient.UIScene_UIGameMenu
// 0x185B5E1DBA0
class UIScene_UIGameMenu
{
public:
	unsigned char                                      UnknownData00[0x185B5E1DBA0];                             // 0x0000(0x185B5E1DBA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIGameMenu");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHalloweenEvent
// 0x185B5E1D120
class UIScene_UIHalloweenEvent
{
public:
	unsigned char                                      UnknownData00[0x185B5E1D120];                             // 0x0000(0x185B5E1D120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHalloweenEvent");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHeader
// 0x185B5E1F220
class UIScene_UIHeader
{
public:
	unsigned char                                      UnknownData00[0x185B5E1F220];                             // 0x0000(0x185B5E1F220) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHeader");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHnHAcquisition
// 0x185B6656190
class UIScene_UIHnHAcquisition
{
public:
	unsigned char                                      UnknownData00[0x185B6656190];                             // 0x0000(0x185B6656190) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHnHAcquisition");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHnHEvent
// 0x185B5E20720
class UIScene_UIHnHEvent
{
public:
	unsigned char                                      UnknownData00[0x185B5E20720];                             // 0x0000(0x185B5E20720) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHnHEvent");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHome
// 0x185B5558D00
class UIScene_UIHome
{
public:
	unsigned char                                      UnknownData00[0x185B5558D00];                             // 0x0000(0x185B5558D00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHome");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudAtlas
// 0x185B828E000
class UIScene_UIHudAtlas
{
public:
	unsigned char                                      UnknownData00[0x185B828E000];                             // 0x0000(0x185B828E000) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudAtlas");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudBurns
// 0x0000
class UIScene_UIHudBurns
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudBurns");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudBurnsConquest
// 0x0000
class UIScene_UIHudBurnsConquest
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudBurnsConquest");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudCenter
// 0x185B5E22B20
class UIScene_UIHudCenter
{
public:
	unsigned char                                      UnknownData00[0x185B5E22B20];                             // 0x0000(0x185B5E22B20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudCenter");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudChomp
// 0x185B5E205A0
class UIScene_UIHudChomp
{
public:
	unsigned char                                      UnknownData00[0x185B5E205A0];                             // 0x0000(0x185B5E205A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudChomp");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudDecks
// 0x185B5E216E0
class UIScene_UIHudDecks
{
public:
	unsigned char                                      UnknownData00[0x185B5E216E0];                             // 0x0000(0x185B5E216E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudDecks");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudDruid
// 0x185B828DB80
class UIScene_UIHudDruid
{
public:
	unsigned char                                      UnknownData00[0x185B828DB80];                             // 0x0000(0x185B828DB80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudDruid");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudImani
// 0x185B828F5C0
class UIScene_UIHudImani
{
public:
	unsigned char                                      UnknownData00[0x185B828F5C0];                             // 0x0000(0x185B828F5C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudImani");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudKoga
// 0x185B5E23420
class UIScene_UIHudKoga
{
public:
	unsigned char                                      UnknownData00[0x185B5E23420];                             // 0x0000(0x185B5E23420) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudKoga");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudMap
// 0x185B5E241A0
class UIScene_UIHudMap
{
public:
	unsigned char                                      UnknownData00[0x185B5E241A0];                             // 0x0000(0x185B5E241A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudMap");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudRecap
// 0x185B828E540
class UIScene_UIHudRecap
{
public:
	unsigned char                                      UnknownData00[0x185B828E540];                             // 0x0000(0x185B828E540) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudRecap");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudScore
// 0x185B5E238A0
class UIScene_UIHudScore
{
public:
	unsigned char                                      UnknownData00[0x185B5E238A0];                             // 0x0000(0x185B5E238A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudScore");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudScoreboard
// 0x0000
class UIScene_UIHudScoreboard
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudScoreboard");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudSkills
// 0x185B5E240E0
class UIScene_UIHudSkills
{
public:
	unsigned char                                      UnknownData00[0x185B5E240E0];                             // 0x0000(0x185B5E240E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudSkills");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudSkills3P
// 0x185B5E23660
class UIScene_UIHudSkills3P
{
public:
	unsigned char                                      UnknownData00[0x185B5E23660];                             // 0x0000(0x185B5E23660) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudSkills3P");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudStrix
// 0x185B5E23DE0
class UIScene_UIHudStrix
{
public:
	unsigned char                                      UnknownData00[0x185B5E23DE0];                             // 0x0000(0x185B5E23DE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudStrix");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudTiberius
// 0x185B828E600
class UIScene_UIHudTiberius
{
public:
	unsigned char                                      UnknownData00[0x185B828E600];                             // 0x0000(0x185B828E600) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudTiberius");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudVGS
// 0x185B5E24C20
class UIScene_UIHudVGS
{
public:
	unsigned char                                      UnknownData00[0x185B5E24C20];                             // 0x0000(0x185B5E24C20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudVGS");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudVora
// 0x185B555A600
class UIScene_UIHudVora
{
public:
	unsigned char                                      UnknownData00[0x185B555A600];                             // 0x0000(0x185B555A600) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudVora");
		return ptr;
	}

};


// Class TgClient.UIScene_UIHudYagorath
// 0x185B8290280
class UIScene_UIHudYagorath
{
public:
	unsigned char                                      UnknownData00[0x185B8290280];                             // 0x0000(0x185B8290280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIHudYagorath");
		return ptr;
	}

};


// Class TgClient.UIScene_UIKeybindPopup
// 0x0000
class UIScene_UIKeybindPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIKeybindPopup");
		return ptr;
	}

};


// Class TgClient.UIScene_UILeaderboard
// 0x185B5E255E0
class UIScene_UILeaderboard
{
public:
	unsigned char                                      UnknownData00[0x185B5E255E0];                             // 0x0000(0x185B5E255E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UILeaderboard");
		return ptr;
	}

};


// Class TgClient.UIScene_UILobbyBoosterActivation
// 0x185B5E25BE0
class UIScene_UILobbyBoosterActivation
{
public:
	unsigned char                                      UnknownData00[0x185B5E25BE0];                             // 0x0000(0x185B5E25BE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UILobbyBoosterActivation");
		return ptr;
	}

};


// Class TgClient.UIScene_UILobbyBoosterSelect
// 0x185B5E28EE0
class UIScene_UILobbyBoosterSelect
{
public:
	unsigned char                                      UnknownData00[0x185B5E28EE0];                             // 0x0000(0x185B5E28EE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UILobbyBoosterSelect");
		return ptr;
	}

};


// Class TgClient.UIScene_UILobbyChat
// 0x185B6654D50
class UIScene_UILobbyChat
{
public:
	unsigned char                                      UnknownData00[0x185B6654D50];                             // 0x0000(0x185B6654D50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UILobbyChat");
		return ptr;
	}

};


// Class TgClient.UIScene_UILogin
// 0x0000
class UIScene_UILogin
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UILogin");
		return ptr;
	}

};


// Class TgClient.UIScene_UIMatchInvite
// 0x185B5E28820
class UIScene_UIMatchInvite
{
public:
	unsigned char                                      UnknownData00[0x185B5E28820];                             // 0x0000(0x185B5E28820) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIMatchInvite");
		return ptr;
	}

};


// Class TgClient.UIScene_UIMatchLobby
// 0x185B5E280A0
class UIScene_UIMatchLobby
{
public:
	unsigned char                                      UnknownData00[0x185B5E280A0];                             // 0x0000(0x185B5E280A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIMatchLobby");
		return ptr;
	}

};


// Class TgClient.UIScene_UIMatchLobbyTradePopup
// 0x185B8291000
class UIScene_UIMatchLobbyTradePopup
{
public:
	unsigned char                                      UnknownData00[0x185B8291000];                             // 0x0000(0x185B8291000) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIMatchLobbyTradePopup");
		return ptr;
	}

};


// Class TgClient.UIScene_UINotificationCenter
// 0x185B5E27CE0
class UIScene_UINotificationCenter
{
public:
	unsigned char                                      UnknownData00[0x185B5E27CE0];                             // 0x0000(0x185B5E27CE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UINotificationCenter");
		return ptr;
	}

};


// Class TgClient.UIScene_UINotificationToasts
// 0x185B5E288E0
class UIScene_UINotificationToasts
{
public:
	unsigned char                                      UnknownData00[0x185B5E288E0];                             // 0x0000(0x185B5E288E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UINotificationToasts");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPatchNotesPopup
// 0x185B5E264E0
class UIScene_UIPatchNotesPopup
{
public:
	unsigned char                                      UnknownData00[0x185B5E264E0];                             // 0x0000(0x185B5E264E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPatchNotesPopup");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPlay
// 0x185B5557220
class UIScene_UIPlay
{
public:
	unsigned char                                      UnknownData00[0x185B5557220];                             // 0x0000(0x185B5557220) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPlay");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPopupChampionLevelUp
// 0x185B5E2AC20
class UIScene_UIPopupChampionLevelUp
{
public:
	unsigned char                                      UnknownData00[0x185B5E2AC20];                             // 0x0000(0x185B5E2AC20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPopupChampionLevelUp");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPopupDeal
// 0x185B5E29420
class UIScene_UIPopupDeal
{
public:
	unsigned char                                      UnknownData00[0x185B5E29420];                             // 0x0000(0x185B5E29420) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPopupDeal");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPopupGeneric
// 0x0000
class UIScene_UIPopupGeneric
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPopupGeneric");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPopupInput
// 0x0000
class UIScene_UIPopupInput
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPopupInput");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPopupPartyManager
// 0x185B5E295A0
class UIScene_UIPopupPartyManager
{
public:
	unsigned char                                      UnknownData00[0x185B5E295A0];                             // 0x0000(0x185B5E295A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPopupPartyManager");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPopupPlaySettings
// 0x185B5E2ADA0
class UIScene_UIPopupPlaySettings
{
public:
	unsigned char                                      UnknownData00[0x185B5E2ADA0];                             // 0x0000(0x185B5E2ADA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPopupPlaySettings");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPopupRealMoneyPurchase
// 0x185B5E2A3E0
class UIScene_UIPopupRealMoneyPurchase
{
public:
	unsigned char                                      UnknownData00[0x185B5E2A3E0];                             // 0x0000(0x185B5E2A3E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPopupRealMoneyPurchase");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPopupTwitchPrime
// 0x185B5E298A0
class UIScene_UIPopupTwitchPrime
{
public:
	unsigned char                                      UnknownData00[0x185B5E298A0];                             // 0x0000(0x185B5E298A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPopupTwitchPrime");
		return ptr;
	}

};


// Class TgClient.UIScene_UIProfile
// 0x185B5E2E6A0
class UIScene_UIProfile
{
public:
	unsigned char                                      UnknownData00[0x185B5E2E6A0];                             // 0x0000(0x185B5E2E6A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIProfile");
		return ptr;
	}

};


// Class TgClient.UIScene_UIProfileMini
// 0x0000
class UIScene_UIProfileMini
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIProfileMini");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPurchase
// 0x0000
class UIScene_UIPurchase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPurchase");
		return ptr;
	}

};


// Class TgClient.UIScene_UIPurchaseGems
// 0x185B5E2E160
class UIScene_UIPurchaseGems
{
public:
	unsigned char                                      UnknownData00[0x185B5E2E160];                             // 0x0000(0x185B5E2E160) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIPurchaseGems");
		return ptr;
	}

};


// Class TgClient.UIScene_UIQuests
// 0x185B5E2EB20
class UIScene_UIQuests
{
public:
	unsigned char                                      UnknownData00[0x185B5E2EB20];                             // 0x0000(0x185B5E2EB20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIQuests");
		return ptr;
	}

};


// Class TgClient.UIScene_UIRadialMenu
// 0x185B5E316A0
class UIScene_UIRadialMenu
{
public:
	unsigned char                                      UnknownData00[0x185B5E316A0];                             // 0x0000(0x185B5E316A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIRadialMenu");
		return ptr;
	}

};


// Class TgClient.UIScene_UIRadialMenuEquip
// 0x185B5E30920
class UIScene_UIRadialMenuEquip
{
public:
	unsigned char                                      UnknownData00[0x185B5E30920];                             // 0x0000(0x185B5E30920) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIRadialMenuEquip");
		return ptr;
	}

};


// Class TgClient.UIScene_UIRadialMenuVGS
// 0x185B8293F40
class UIScene_UIRadialMenuVGS
{
public:
	unsigned char                                      UnknownData00[0x185B8293F40];                             // 0x0000(0x185B8293F40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIRadialMenuVGS");
		return ptr;
	}

};


// Class TgClient.UIScene_UIReferredRewardsPopup
// 0x185B5E2FC60
class UIScene_UIReferredRewardsPopup
{
public:
	unsigned char                                      UnknownData00[0x185B5E2FC60];                             // 0x0000(0x185B5E2FC60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIReferredRewardsPopup");
		return ptr;
	}

};


// Class TgClient.UIScene_UISafeFrame
// 0x0000
class UIScene_UISafeFrame
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UISafeFrame");
		return ptr;
	}

};


// Class TgClient.UIScene_UISendGift
// 0x185B8294300
class UIScene_UISendGift
{
public:
	unsigned char                                      UnknownData00[0x185B8294300];                             // 0x0000(0x185B8294300) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UISendGift");
		return ptr;
	}

};


// Class TgClient.UIScene_UISettings
// 0x185B5E315E0
class UIScene_UISettings
{
public:
	unsigned char                                      UnknownData00[0x185B5E315E0];                             // 0x0000(0x185B5E315E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UISettings");
		return ptr;
	}

};


// Class TgClient.UIScene_UISkills
// 0x185B5E30FE0
class UIScene_UISkills
{
public:
	unsigned char                                      UnknownData00[0x185B5E30FE0];                             // 0x0000(0x185B5E30FE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UISkills");
		return ptr;
	}

};


// Class TgClient.UIScene_UISocial
// 0x185B5E32360
class UIScene_UISocial
{
public:
	unsigned char                                      UnknownData00[0x185B5E32360];                             // 0x0000(0x185B5E32360) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UISocial");
		return ptr;
	}

};


// Class TgClient.UIScene_UIStore
// 0x185B66598B0
class UIScene_UIStore
{
public:
	unsigned char                                      UnknownData00[0x185B66598B0];                             // 0x0000(0x185B66598B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIStore");
		return ptr;
	}

};


// Class TgClient.UIScene_UIStoreDetail
// 0x185B5E339E0
class UIScene_UIStoreDetail
{
public:
	unsigned char                                      UnknownData00[0x185B5E339E0];                             // 0x0000(0x185B5E339E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIStoreDetail");
		return ptr;
	}

};


// Class TgClient.UIScene_UIStoreFilterPopup
// 0x185B5E33320
class UIScene_UIStoreFilterPopup
{
public:
	unsigned char                                      UnknownData00[0x185B5E33320];                             // 0x0000(0x185B5E33320) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIStoreFilterPopup");
		return ptr;
	}

};


// Class TgClient.UIScene_UIStoreRentSprayPopup
// 0x185B5E34A60
class UIScene_UIStoreRentSprayPopup
{
public:
	unsigned char                                      UnknownData00[0x185B5E34A60];                             // 0x0000(0x185B5E34A60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIStoreRentSprayPopup");
		return ptr;
	}

};


// Class TgClient.UIScene_UIStreetStyleEvent
// 0x185B8292140
class UIScene_UIStreetStyleEvent
{
public:
	unsigned char                                      UnknownData00[0x185B8292140];                             // 0x0000(0x185B8292140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIStreetStyleEvent");
		return ptr;
	}

};


// Class TgClient.UIScene_UISummerEvent
// 0x185B5E378E0
class UIScene_UISummerEvent
{
public:
	unsigned char                                      UnknownData00[0x185B5E378E0];                             // 0x0000(0x185B5E378E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UISummerEvent");
		return ptr;
	}

};


// Class TgClient.UIScene_UITalents
// 0x185B8291C00
class UIScene_UITalents
{
public:
	unsigned char                                      UnknownData00[0x185B8291C00];                             // 0x0000(0x185B8291C00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UITalents");
		return ptr;
	}

};


// Class TgClient.UIScene_UIWebBrowser
// 0x0000
class UIScene_UIWebBrowser
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIWebBrowser");
		return ptr;
	}

};


// Class TgClient.UIScene_UIWinterEvent
// 0x185B8292740
class UIScene_UIWinterEvent
{
public:
	unsigned char                                      UnknownData00[0x185B8292740];                             // 0x0000(0x185B8292740) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIWinterEvent");
		return ptr;
	}

};


// Class TgClient.UIComponent_DualButtonPanel
// 0x185B9CC82F0
class UIComponent_DualButtonPanel
{
public:
	unsigned char                                      UnknownData00[0x185B9CC82F0];                             // 0x0000(0x185B9CC82F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_DualButtonPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_HomeGoToItem
// 0x185B9CDABF0
class UIComponent_HomeGoToItem
{
public:
	unsigned char                                      UnknownData00[0x185B9CDABF0];                             // 0x0000(0x185B9CDABF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HomeGoToItem");
		return ptr;
	}

};


// Class TgClient.UIComponent_HomeGoToBattlePass
// 0x0000
class UIComponent_HomeGoToBattlePass
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HomeGoToBattlePass");
		return ptr;
	}

};


// Class TgClient.UIComponent_HomeGoToChest
// 0x185B9CD8A30
class UIComponent_HomeGoToChest
{
public:
	unsigned char                                      UnknownData00[0x185B9CD8A30];                             // 0x0000(0x185B9CD8A30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HomeGoToChest");
		return ptr;
	}

};


// Class TgClient.UIComponent_HomeGoToEvent
// 0x0000
class UIComponent_HomeGoToEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HomeGoToEvent");
		return ptr;
	}

};


// Class TgClient.UIComponent_Interactable
// 0x185B9CB4070
class UIComponent_Interactable
{
public:
	unsigned char                                      UnknownData00[0x185B9CB4070];                             // 0x0000(0x185B9CB4070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Interactable");
		return ptr;
	}

};


// Class TgClient.UIComponent_AcquisitionCarousel
// 0x185B9CB1730
class UIComponent_AcquisitionCarousel
{
public:
	unsigned char                                      UnknownData00[0x185B9CB1730];                             // 0x0000(0x185B9CB1730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_AcquisitionCarousel");
		return ptr;
	}

};


// Class TgClient.UIComponent_BannerButton
// 0x185B8265B00
class UIComponent_BannerButton
{
public:
	unsigned char                                      UnknownData00[0x185B8265B00];                             // 0x0000(0x185B8265B00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BannerButton");
		return ptr;
	}

};


// Class TgClient.UIComponent_OptionEntryBase
// 0x185B827A500
class UIComponent_OptionEntryBase
{
public:
	unsigned char                                      UnknownData00[0x185B827A500];                             // 0x0000(0x185B827A500) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_OptionEntryBase");
		return ptr;
	}

};


// Class TgClient.UIComponent_OptionEntryPaged
// 0x185B82796C0
class UIComponent_OptionEntryPaged
{
public:
	unsigned char                                      UnknownData00[0x185B82796C0];                             // 0x0000(0x185B82796C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_OptionEntryPaged");
		return ptr;
	}

};


// Class TgClient.UIComponent_OptionEntryText
// 0x185B827A5C0
class UIComponent_OptionEntryText
{
public:
	unsigned char                                      UnknownData00[0x185B827A5C0];                             // 0x0000(0x185B827A5C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_OptionEntryText");
		return ptr;
	}

};


// Class TgClient.UIComponent_PreviewRotator
// 0x185B98FC4F0
class UIComponent_PreviewRotator
{
public:
	unsigned char                                      UnknownData00[0x185B98FC4F0];                             // 0x0000(0x185B98FC4F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PreviewRotator");
		return ptr;
	}

};


// Class TgClient.UIComponent_RatingInteractable
// 0x185B99042F0
class UIComponent_RatingInteractable
{
public:
	unsigned char                                      UnknownData00[0x185B99042F0];                             // 0x0000(0x185B99042F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RatingInteractable");
		return ptr;
	}

};


// Class TgClient.UIComponent_ScrollBar
// 0x185B9905AF0
class UIComponent_ScrollBar
{
public:
	unsigned char                                      UnknownData00[0x185B9905AF0];                             // 0x0000(0x185B9905AF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ScrollBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_ScrollBarDisplay
// 0x0000
class UIComponent_ScrollBarDisplay
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ScrollBarDisplay");
		return ptr;
	}

};


// Class TgClient.UIComponent_StoreFilterToggle
// 0x185B9909AB0
class UIComponent_StoreFilterToggle
{
public:
	unsigned char                                      UnknownData00[0x185B9909AB0];                             // 0x0000(0x185B9909AB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StoreFilterToggle");
		return ptr;
	}

};


// Class TgClient.UIComponent_TitlesViewEntry
// 0x185B9910530
class UIComponent_TitlesViewEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9910530];                             // 0x0000(0x185B9910530) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TitlesViewEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_Toggle
// 0x185B9912930
class UIComponent_Toggle
{
public:
	unsigned char                                      UnknownData00[0x185B9912930];                             // 0x0000(0x185B9912930) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Toggle");
		return ptr;
	}

};


// Class TgClient.UIInteractable_BattlePassBanner
// 0x185B828B180
class UIInteractable_BattlePassBanner
{
public:
	unsigned char                                      UnknownData00[0x185B828B180];                             // 0x0000(0x185B828B180) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_BattlePassBanner");
		return ptr;
	}

};


// Class TgClient.UIInteractable_Button
// 0x0000
class UIInteractable_Button
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_Button");
		return ptr;
	}

};


// Class TgClient.UIInteractable_Button_Currency
// 0x185B2B86EE0
class UIInteractable_Button_Currency
{
public:
	unsigned char                                      UnknownData00[0x185B2B86EE0];                             // 0x0000(0x185B2B86EE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_Button_Currency");
		return ptr;
	}

};


// Class TgClient.UIInteractable_Button_Price
// 0x185B2B86E20
class UIInteractable_Button_Price
{
public:
	unsigned char                                      UnknownData00[0x185B2B86E20];                             // 0x0000(0x185B2B86E20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_Button_Price");
		return ptr;
	}

};


// Class TgClient.UIInteractable_Button_Panel
// 0x0000
class UIInteractable_Button_Panel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_Button_Panel");
		return ptr;
	}

};


// Class TgClient.UIInteractable_DailyDeal
// 0x185B6654210
class UIInteractable_DailyDeal
{
public:
	unsigned char                                      UnknownData00[0x185B6654210];                             // 0x0000(0x185B6654210) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_DailyDeal");
		return ptr;
	}

};


// Class TgClient.UIInteractable_HighlightSizeOnly
// 0x185B828A100
class UIInteractable_HighlightSizeOnly
{
public:
	unsigned char                                      UnknownData00[0x185B828A100];                             // 0x0000(0x185B828A100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_HighlightSizeOnly");
		return ptr;
	}

};


// Class TgClient.UIInteractable_Item
// 0x185B55538A0
class UIInteractable_Item
{
public:
	unsigned char                                      UnknownData00[0x185B55538A0];                             // 0x0000(0x185B55538A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_Item");
		return ptr;
	}

};


// Class TgClient.UIInteractable_JsonPanel
// 0x185B2B87120
class UIInteractable_JsonPanel
{
public:
	unsigned char                                      UnknownData00[0x185B2B87120];                             // 0x0000(0x185B2B87120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_JsonPanel");
		return ptr;
	}

};


// Class TgClient.UIInteractable_DailyDeal_JsonCarousel
// 0x185B8289EC0
class UIInteractable_DailyDeal_JsonCarousel
{
public:
	unsigned char                                      UnknownData00[0x185B8289EC0];                             // 0x0000(0x185B8289EC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_DailyDeal_JsonCarousel");
		return ptr;
	}

};


// Class TgClient.UIInteractable_JsonPanel_Carousel
// 0x185B2B87960
class UIInteractable_JsonPanel_Carousel
{
public:
	unsigned char                                      UnknownData00[0x185B2B87960];                             // 0x0000(0x185B2B87960) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_JsonPanel_Carousel");
		return ptr;
	}

};


// Class TgClient.UIInteractable_NavPanel
// 0x185B2B883E0
class UIInteractable_NavPanel
{
public:
	unsigned char                                      UnknownData00[0x185B2B883E0];                             // 0x0000(0x185B2B883E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_NavPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchInvite
// 0x185B9CEA370
class UIComponent_MatchInvite
{
public:
	unsigned char                                      UnknownData00[0x185B9CEA370];                             // 0x0000(0x185B9CEA370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchInvite");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchInviteWithJoin
// 0x185B9CEABB0
class UIComponent_MatchInviteWithJoin
{
public:
	unsigned char                                      UnknownData00[0x185B9CEABB0];                             // 0x0000(0x185B9CEABB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchInviteWithJoin");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyCustomize
// 0x185B8276000
class UIComponent_MatchLobbyCustomize
{
public:
	unsigned char                                      UnknownData00[0x185B8276000];                             // 0x0000(0x185B8276000) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyCustomize");
		return ptr;
	}

};


// Class TgClient.UIComponent_MeshActorLobbyControl
// 0x185B665B290
class UIComponent_MeshActorLobbyControl
{
public:
	unsigned char                                      UnknownData00[0x185B665B290];                             // 0x0000(0x185B665B290) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MeshActorLobbyControl");
		return ptr;
	}

};


// Class TgClient.UIComponent_PopupManager
// 0x185B98FE2F0
class UIComponent_PopupManager
{
public:
	unsigned char                                      UnknownData00[0x185B98FE2F0];                             // 0x0000(0x185B98FE2F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PopupManager");
		return ptr;
	}

};


// Class TgClient.UIComponentPool
// 0x185B9913830
class UIComponentPool
{
public:
	unsigned char                                      UnknownData00[0x185B9913830];                             // 0x0000(0x185B9913830) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponentPool");
		return ptr;
	}

};


// Class TgClient.UIInteractable_Button_GamepadPrompt
// 0x185B2B85020
class UIInteractable_Button_GamepadPrompt
{
public:
	unsigned char                                      UnknownData00[0x185B2B85020];                             // 0x0000(0x185B2B85020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractable_Button_GamepadPrompt");
		return ptr;
	}

};


// Class TgClient.UIInteractableInterface_JsonCarousel
// 0x0000
class UIInteractableInterface_JsonCarousel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInteractableInterface_JsonCarousel");
		return ptr;
	}

};


// Class TgClient.UIComponent_AccountLinkIcon
// 0x185B9CAF570
class UIComponent_AccountLinkIcon
{
public:
	unsigned char                                      UnknownData00[0x185B9CAF570];                             // 0x0000(0x185B9CAF570) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_AccountLinkIcon");
		return ptr;
	}

};


// Class TgClient.UIComponent_ArcadeRankedProgress
// 0x185B9CB3FB0
class UIComponent_ArcadeRankedProgress
{
public:
	unsigned char                                      UnknownData00[0x185B9CB3FB0];                             // 0x0000(0x185B9CB3FB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ArcadeRankedProgress");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassChallenge
// 0x185B9CB5C30
class UIComponent_BattlePassChallenge
{
public:
	unsigned char                                      UnknownData00[0x185B9CB5C30];                             // 0x0000(0x185B9CB5C30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassChallenge");
		return ptr;
	}

};


// Class TgClient.UIComponent_BattlePassChallengeLarge
// 0x185B8265D40
class UIComponent_BattlePassChallengeLarge
{
public:
	unsigned char                                      UnknownData00[0x185B8265D40];                             // 0x0000(0x185B8265D40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BattlePassChallengeLarge");
		return ptr;
	}

};


// Class TgClient.UIComponent_ButtonDisplay
// 0x0000
class UIComponent_ButtonDisplay
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ButtonDisplay");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChallengeGoal
// 0x185B9CBCFB0
class UIComponent_ChallengeGoal
{
public:
	unsigned char                                      UnknownData00[0x185B9CBCFB0];                             // 0x0000(0x185B9CBCFB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChallengeGoal");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChampionRankRow
// 0x185B9CBE3F0
class UIComponent_ChampionRankRow
{
public:
	unsigned char                                      UnknownData00[0x185B9CBE3F0];                             // 0x0000(0x185B9CBE3F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChampionRankRow");
		return ptr;
	}

};


// Class TgClient.UIComponent_ChampionSimple
// 0x185B9CBE630
class UIComponent_ChampionSimple
{
public:
	unsigned char                                      UnknownData00[0x185B9CBE630];                             // 0x0000(0x185B9CBE630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ChampionSimple");
		return ptr;
	}

};


// Class TgClient.UIComponent_CollectToUnlock
// 0x185B9CC20B0
class UIComponent_CollectToUnlock
{
public:
	unsigned char                                      UnknownData00[0x185B9CC20B0];                             // 0x0000(0x185B9CC20B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CollectToUnlock");
		return ptr;
	}

};


// Class TgClient.UIComponent_CommendationReward
// 0x185B8268BC0
class UIComponent_CommendationReward
{
public:
	unsigned char                                      UnknownData00[0x185B8268BC0];                             // 0x0000(0x185B8268BC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CommendationReward");
		return ptr;
	}

};


// Class TgClient.UIComponent_CompetitiveRankChange
// 0x185B9CC2470
class UIComponent_CompetitiveRankChange
{
public:
	unsigned char                                      UnknownData00[0x185B9CC2470];                             // 0x0000(0x185B9CC2470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CompetitiveRankChange");
		return ptr;
	}

};


// Class TgClient.UIComponent_CompetitiveRankedDecay
// 0x185B9CC37F0
class UIComponent_CompetitiveRankedDecay
{
public:
	unsigned char                                      UnknownData00[0x185B9CC37F0];                             // 0x0000(0x185B9CC37F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CompetitiveRankedDecay");
		return ptr;
	}

};


// Class TgClient.UIComponent_CustomizeSlot
// 0x185B826CAC0
class UIComponent_CustomizeSlot
{
public:
	unsigned char                                      UnknownData00[0x185B826CAC0];                             // 0x0000(0x185B826CAC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_CustomizeSlot");
		return ptr;
	}

};


// Class TgClient.UIComponent_Dropdown
// 0x185B9CC7B70
class UIComponent_Dropdown
{
public:
	unsigned char                                      UnknownData00[0x185B9CC7B70];                             // 0x0000(0x185B9CC7B70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Dropdown");
		return ptr;
	}

};


// Class TgClient.UIComponent_EventDay
// 0x185B826EE00
class UIComponent_EventDay
{
public:
	unsigned char                                      UnknownData00[0x185B826EE00];                             // 0x0000(0x185B826EE00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EventDay");
		return ptr;
	}

};


// Class TgClient.UIComponent_EventEmoteButton
// 0x185B9CCB770
class UIComponent_EventEmoteButton
{
public:
	unsigned char                                      UnknownData00[0x185B9CCB770];                             // 0x0000(0x185B9CCB770) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EventEmoteButton");
		return ptr;
	}

};


// Class TgClient.UIComponent_EventQuestChain
// 0x185B9CC9A30
class UIComponent_EventQuestChain
{
public:
	unsigned char                                      UnknownData00[0x185B9CC9A30];                             // 0x0000(0x185B9CC9A30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_EventQuestChain");
		return ptr;
	}

};


// Class TgClient.UIComponent_GamepadKey
// 0x185B9CCA0F0
class UIComponent_GamepadKey
{
public:
	unsigned char                                      UnknownData00[0x185B9CCA0F0];                             // 0x0000(0x185B9CCA0F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_GamepadKey");
		return ptr;
	}

};


// Class TgClient.UIComponent_GoalReward
// 0x185B9CCE170
class UIComponent_GoalReward
{
public:
	unsigned char                                      UnknownData00[0x185B9CCE170];                             // 0x0000(0x185B9CCE170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_GoalReward");
		return ptr;
	}

};


// Class TgClient.UIComponent_HeaderTab
// 0x185B9CCC2B0
class UIComponent_HeaderTab
{
public:
	unsigned char                                      UnknownData00[0x185B9CCC2B0];                             // 0x0000(0x185B9CCC2B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HeaderTab");
		return ptr;
	}

};


// Class TgClient.UIComponent_HeaderTabRotating
// 0x185B8272F40
class UIComponent_HeaderTabRotating
{
public:
	unsigned char                                      UnknownData00[0x185B8272F40];                             // 0x0000(0x185B8272F40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HeaderTabRotating");
		return ptr;
	}

};


// Class TgClient.UIComponent_IconTF
// 0x185B9CDD2F0
class UIComponent_IconTF
{
public:
	unsigned char                                      UnknownData00[0x185B9CDD2F0];                             // 0x0000(0x185B9CDD2F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_IconTF");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemIcon
// 0x185B9CE2DB0
class UIComponent_ItemIcon
{
public:
	unsigned char                                      UnknownData00[0x185B9CE2DB0];                             // 0x0000(0x185B9CE2DB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemIcon");
		return ptr;
	}

};


// Class TgClient.UIComponent_ItemMini
// 0x185B9CE18B0
class UIComponent_ItemMini
{
public:
	unsigned char                                      UnknownData00[0x185B9CE18B0];                             // 0x0000(0x185B9CE18B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ItemMini");
		return ptr;
	}

};


// Class TgClient.UIComponent_KeyboardKey
// 0x185B8274800
class UIComponent_KeyboardKey
{
public:
	unsigned char                                      UnknownData00[0x185B8274800];                             // 0x0000(0x185B8274800) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_KeyboardKey");
		return ptr;
	}

};


// Class TgClient.UIComponent_LeaderboardPlayer
// 0x185B9CE4370
class UIComponent_LeaderboardPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B9CE4370];                             // 0x0000(0x185B9CE4370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LeaderboardPlayer");
		return ptr;
	}

};


// Class TgClient.UIComponent_LeagueTierEntry
// 0x185B9CE69B0
class UIComponent_LeagueTierEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9CE69B0];                             // 0x0000(0x185B9CE69B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LeagueTierEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_LevelProgress
// 0x185B9CE6170
class UIComponent_LevelProgress
{
public:
	unsigned char                                      UnknownData00[0x185B9CE6170];                             // 0x0000(0x185B9CE6170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LevelProgress");
		return ptr;
	}

};


// Class TgClient.UIComponent_List
// 0x185B9CD19B0
class UIComponent_List
{
public:
	unsigned char                                      UnknownData00[0x185B9CD19B0];                             // 0x0000(0x185B9CD19B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_List");
		return ptr;
	}

};


// Class TgClient.UIComponent_HeaderTabs
// 0x185B9CCF730
class UIComponent_HeaderTabs
{
public:
	unsigned char                                      UnknownData00[0x185B9CCF730];                             // 0x0000(0x185B9CCF730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HeaderTabs");
		return ptr;
	}

};


// Class TgClient.UIComponent_HeaderTabsRotating
// 0x185B8270B40
class UIComponent_HeaderTabsRotating
{
public:
	unsigned char                                      UnknownData00[0x185B8270B40];                             // 0x0000(0x185B8270B40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_HeaderTabsRotating");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyTeam
// 0x185B8277E00
class UIComponent_MatchLobbyTeam
{
public:
	unsigned char                                      UnknownData00[0x185B8277E00];                             // 0x0000(0x185B8277E00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyTeam");
		return ptr;
	}

};


// Class TgClient.UIComponent_LoadoutImportPlayerEntry
// 0x185B9CE9CB0
class UIComponent_LoadoutImportPlayerEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9CE9CB0];                             // 0x0000(0x185B9CE9CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LoadoutImportPlayerEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_LobbyBoosterActivation
// 0x185B9CE7D30
class UIComponent_LobbyBoosterActivation
{
public:
	unsigned char                                      UnknownData00[0x185B9CE7D30];                             // 0x0000(0x185B9CE7D30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LobbyBoosterActivation");
		return ptr;
	}

};


// Class TgClient.UIComponent_LobbyEquipSlotItem
// 0x185B9CE90B0
class UIComponent_LobbyEquipSlotItem
{
public:
	unsigned char                                      UnknownData00[0x185B9CE90B0];                             // 0x0000(0x185B9CE90B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LobbyEquipSlotItem");
		return ptr;
	}

};


// Class TgClient.UIComponent_LobbySlotItem
// 0x185B9CE95F0
class UIComponent_LobbySlotItem
{
public:
	unsigned char                                      UnknownData00[0x185B9CE95F0];                             // 0x0000(0x185B9CE95F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LobbySlotItem");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchInvitePlayerEntry
// 0x185B9CEA970
class UIComponent_MatchInvitePlayerEntry
{
public:
	unsigned char                                      UnknownData00[0x185B9CEA970];                             // 0x0000(0x185B9CEA970) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchInvitePlayerEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchLobbyTeamPlayer
// 0x185B827B040
class UIComponent_MatchLobbyTeamPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B827B040];                             // 0x0000(0x185B827B040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchLobbyTeamPlayer");
		return ptr;
	}

};


// Class TgClient.UIComponent_MatchPlayerEntry
// 0x185B98FA270
class UIComponent_MatchPlayerEntry
{
public:
	unsigned char                                      UnknownData00[0x185B98FA270];                             // 0x0000(0x185B98FA270) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_MatchPlayerEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_NotificationCouponEntry
// 0x185B827AE00
class UIComponent_NotificationCouponEntry
{
public:
	unsigned char                                      UnknownData00[0x185B827AE00];                             // 0x0000(0x185B827AE00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_NotificationCouponEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_NotificationEntry
// 0x185B82799C0
class UIComponent_NotificationEntry
{
public:
	unsigned char                                      UnknownData00[0x185B82799C0];                             // 0x0000(0x185B82799C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_NotificationEntry");
		return ptr;
	}

};


// Class TgClient.UIComponent_NotificationTab
// 0x185B827C300
class UIComponent_NotificationTab
{
public:
	unsigned char                                      UnknownData00[0x185B827C300];                             // 0x0000(0x185B827C300) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_NotificationTab");
		return ptr;
	}

};


// Class TgClient.UIComponent_OwnershipProgress
// 0x185B98F9BB0
class UIComponent_OwnershipProgress
{
public:
	unsigned char                                      UnknownData00[0x185B98F9BB0];                             // 0x0000(0x185B98F9BB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_OwnershipProgress");
		return ptr;
	}

};


// Class TgClient.UIComponent_PlayerName
// 0x185B98FCC70
class UIComponent_PlayerName
{
public:
	unsigned char                                      UnknownData00[0x185B98FCC70];                             // 0x0000(0x185B98FCC70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PlayerName");
		return ptr;
	}

};


// Class TgClient.UIComponent_PlayPanel
// 0x185B98FDDB0
class UIComponent_PlayPanel
{
public:
	unsigned char                                      UnknownData00[0x185B98FDDB0];                             // 0x0000(0x185B98FDDB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PlayPanel");
		return ptr;
	}

};


// Class TgClient.UIComponent_PlaySettings
// 0x185B98FDF30
class UIComponent_PlaySettings
{
public:
	unsigned char                                      UnknownData00[0x185B98FDF30];                             // 0x0000(0x185B98FDF30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PlaySettings");
		return ptr;
	}

};


// Class TgClient.UIComponent_PortraitBorder
// 0x185B98FE530
class UIComponent_PortraitBorder
{
public:
	unsigned char                                      UnknownData00[0x185B98FE530];                             // 0x0000(0x185B98FE530) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PortraitBorder");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProgressBarCommendation
// 0x185B827FA80
class UIComponent_ProgressBarCommendation
{
public:
	unsigned char                                      UnknownData00[0x185B827FA80];                             // 0x0000(0x185B827FA80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProgressBarCommendation");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProgressBarHorizontal
// 0x185B6649A70
class UIComponent_ProgressBarHorizontal
{
public:
	unsigned char                                      UnknownData00[0x185B6649A70];                             // 0x0000(0x185B6649A70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProgressBarHorizontal");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProgressBarRadial
// 0x185B9900CF0
class UIComponent_ProgressBarRadial
{
public:
	unsigned char                                      UnknownData00[0x185B9900CF0];                             // 0x0000(0x185B9900CF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProgressBarRadial");
		return ptr;
	}

};


// Class TgClient.UIComponent_DruidFoxHealthBar
// 0x0000
class UIComponent_DruidFoxHealthBar
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_DruidFoxHealthBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_DruidMoonJuiceBar
// 0x185B826EEC0
class UIComponent_DruidMoonJuiceBar
{
public:
	unsigned char                                      UnknownData00[0x185B826EEC0];                             // 0x0000(0x185B826EEC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_DruidMoonJuiceBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_ImaniUltTimer
// 0x185B82718C0
class UIComponent_ImaniUltTimer
{
public:
	unsigned char                                      UnknownData00[0x185B82718C0];                             // 0x0000(0x185B82718C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ImaniUltTimer");
		return ptr;
	}

};


// Class TgClient.UIComponent_TiberiusUltCharge
// 0x0000
class UIComponent_TiberiusUltCharge
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TiberiusUltCharge");
		return ptr;
	}

};


// Class TgClient.UIComponent_YagorathAcidJuiceBar
// 0x185B8287280
class UIComponent_YagorathAcidJuiceBar
{
public:
	unsigned char                                      UnknownData00[0x185B8287280];                             // 0x0000(0x185B8287280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_YagorathAcidJuiceBar");
		return ptr;
	}

};


// Class TgClient.UIComponent_PurchasableQuestChain
// 0x185B8282240
class UIComponent_PurchasableQuestChain
{
public:
	unsigned char                                      UnknownData00[0x185B8282240];                             // 0x0000(0x185B8282240) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_PurchasableQuestChain");
		return ptr;
	}

};


// Class TgClient.UIComponent_Quest
// 0x185B9900F30
class UIComponent_Quest
{
public:
	unsigned char                                      UnknownData00[0x185B9900F30];                             // 0x0000(0x185B9900F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Quest");
		return ptr;
	}

};


// Class TgClient.UIComponent_RadialSlotEmote
// 0x185B99043B0
class UIComponent_RadialSlotEmote
{
public:
	unsigned char                                      UnknownData00[0x185B99043B0];                             // 0x0000(0x185B99043B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RadialSlotEmote");
		return ptr;
	}

};


// Class TgClient.UIComponent_RadialSlotSpray
// 0x185B9904D70
class UIComponent_RadialSlotSpray
{
public:
	unsigned char                                      UnknownData00[0x185B9904D70];                             // 0x0000(0x185B9904D70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RadialSlotSpray");
		return ptr;
	}

};


// Class TgClient.UIComponent_RankedEOMProgress
// 0x185B9902430
class UIComponent_RankedEOMProgress
{
public:
	unsigned char                                      UnknownData00[0x185B9902430];                             // 0x0000(0x185B9902430) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RankedEOMProgress");
		return ptr;
	}

};


// Class TgClient.UIComponent_RankedProgress
// 0x185B9902130
class UIComponent_RankedProgress
{
public:
	unsigned char                                      UnknownData00[0x185B9902130];                             // 0x0000(0x185B9902130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RankedProgress");
		return ptr;
	}

};


// Class TgClient.UIComponent_ReferralReward
// 0x185B99033F0
class UIComponent_ReferralReward
{
public:
	unsigned char                                      UnknownData00[0x185B99033F0];                             // 0x0000(0x185B99033F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ReferralReward");
		return ptr;
	}

};


// Class TgClient.UIComponent_RolledItem
// 0x185B9907CB0
class UIComponent_RolledItem
{
public:
	unsigned char                                      UnknownData00[0x185B9907CB0];                             // 0x0000(0x185B9907CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RolledItem");
		return ptr;
	}

};


// Class TgClient.UIComponent_RolledSubItem
// 0x185B9907D70
class UIComponent_RolledSubItem
{
public:
	unsigned char                                      UnknownData00[0x185B9907D70];                             // 0x0000(0x185B9907D70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_RolledSubItem");
		return ptr;
	}

};


// Class TgClient.UIComponent_SimpleIconWithFrames
// 0x185B8280A40
class UIComponent_SimpleIconWithFrames
{
public:
	unsigned char                                      UnknownData00[0x185B8280A40];                             // 0x0000(0x185B8280A40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_SimpleIconWithFrames");
		return ptr;
	}

};


// Class TgClient.UIComponent_Skill
// 0x185B9906F30
class UIComponent_Skill
{
public:
	unsigned char                                      UnknownData00[0x185B9906F30];                             // 0x0000(0x185B9906F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Skill");
		return ptr;
	}

};


// Class TgClient.UIComponent_SocialDetail
// 0x185B9906570
class UIComponent_SocialDetail
{
public:
	unsigned char                                      UnknownData00[0x185B9906570];                             // 0x0000(0x185B9906570) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_SocialDetail");
		return ptr;
	}

};


// Class TgClient.UIComponent_SocialPlayer
// 0x185B99096F0
class UIComponent_SocialPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B99096F0];                             // 0x0000(0x185B99096F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_SocialPlayer");
		return ptr;
	}

};


// Class TgClient.UIComponent_String
// 0x0000
class UIComponent_String
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_String");
		return ptr;
	}

};


// Class TgClient.UIComponent_StringTitle
// 0x185B990D170
class UIComponent_StringTitle
{
public:
	unsigned char                                      UnknownData00[0x185B990D170];                             // 0x0000(0x185B990D170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StringTitle");
		return ptr;
	}

};


// Class TgClient.UIComponent_StringWithCount
// 0x185B990B2B0
class UIComponent_StringWithCount
{
public:
	unsigned char                                      UnknownData00[0x185B990B2B0];                             // 0x0000(0x185B990B2B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_StringWithCount");
		return ptr;
	}

};


// Class TgClient.UIComponent_TextButton
// 0x185B990F270
class UIComponent_TextButton
{
public:
	unsigned char                                      UnknownData00[0x185B990F270];                             // 0x0000(0x185B990F270) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TextButton");
		return ptr;
	}

};


// Class TgClient.UIComponent_TwitchPrime
// 0x185B99135F0
class UIComponent_TwitchPrime
{
public:
	unsigned char                                      UnknownData00[0x185B99135F0];                             // 0x0000(0x185B99135F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_TwitchPrime");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutAnnouncer
// 0x185B9CBC170
class UIComponent_Button_LoadoutAnnouncer
{
public:
	unsigned char                                      UnknownData00[0x185B9CBC170];                             // 0x0000(0x185B9CBC170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutAnnouncer");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutAvatar
// 0x185B9CBA8B0
class UIComponent_Button_LoadoutAvatar
{
public:
	unsigned char                                      UnknownData00[0x185B9CBA8B0];                             // 0x0000(0x185B9CBA8B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutAvatar");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutCategory
// 0x185B9CBAA30
class UIComponent_Button_LoadoutCategory
{
public:
	unsigned char                                      UnknownData00[0x185B9CBAA30];                             // 0x0000(0x185B9CBAA30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutCategory");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutDeathCard
// 0x185B82670C0
class UIComponent_Button_LoadoutDeathCard
{
public:
	unsigned char                                      UnknownData00[0x185B82670C0];                             // 0x0000(0x185B82670C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutDeathCard");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutDeathStamp
// 0x185B9CBBAB0
class UIComponent_Button_LoadoutDeathStamp
{
public:
	unsigned char                                      UnknownData00[0x185B9CBBAB0];                             // 0x0000(0x185B9CBBAB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutDeathStamp");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutLoadingFrame
// 0x185B9CBA2B0
class UIComponent_Button_LoadoutLoadingFrame
{
public:
	unsigned char                                      UnknownData00[0x185B9CBA2B0];                             // 0x0000(0x185B9CBA2B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutLoadingFrame");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutMount
// 0x185B9CBA730
class UIComponent_Button_LoadoutMount
{
public:
	unsigned char                                      UnknownData00[0x185B9CBA730];                             // 0x0000(0x185B9CBA730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutMount");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutMusicPack
// 0x185B9CBAAF0
class UIComponent_Button_LoadoutMusicPack
{
public:
	unsigned char                                      UnknownData00[0x185B9CBAAF0];                             // 0x0000(0x185B9CBAAF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutMusicPack");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutSpray
// 0x185B9CBB330
class UIComponent_Button_LoadoutSpray
{
public:
	unsigned char                                      UnknownData00[0x185B9CBB330];                             // 0x0000(0x185B9CBB330) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutSpray");
		return ptr;
	}

};


// Class TgClient.UIComponent_Button_LoadoutTitle
// 0x185B9CBA430
class UIComponent_Button_LoadoutTitle
{
public:
	unsigned char                                      UnknownData00[0x185B9CBA430];                             // 0x0000(0x185B9CBA430) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_Button_LoadoutTitle");
		return ptr;
	}

};


// Class TgClient.UIComponent_LoadoutHeader
// 0x185B9CE7C70
class UIComponent_LoadoutHeader
{
public:
	unsigned char                                      UnknownData00[0x185B9CE7C70];                             // 0x0000(0x185B9CE7C70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LoadoutHeader");
		return ptr;
	}

};


// Class TgClient.UIComponent_LoadoutSubscene
// 0x185B9CE78B0
class UIComponent_LoadoutSubscene
{
public:
	unsigned char                                      UnknownData00[0x185B9CE78B0];                             // 0x0000(0x185B9CE78B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_LoadoutSubscene");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProfileAnnouncers
// 0x0000
class UIComponent_ProfileAnnouncers
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProfileAnnouncers");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProfileAvatars
// 0x0000
class UIComponent_ProfileAvatars
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProfileAvatars");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProfileDeathCards
// 0x0000
class UIComponent_ProfileDeathCards
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProfileDeathCards");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProfileDeathStamps
// 0x0000
class UIComponent_ProfileDeathStamps
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProfileDeathStamps");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProfileLoadingFrames
// 0x0000
class UIComponent_ProfileLoadingFrames
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProfileLoadingFrames");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProfileMounts
// 0x0000
class UIComponent_ProfileMounts
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProfileMounts");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProfileMusicPacks
// 0x0000
class UIComponent_ProfileMusicPacks
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProfileMusicPacks");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProfileSprays
// 0x0000
class UIComponent_ProfileSprays
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProfileSprays");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProfileTitles
// 0x0000
class UIComponent_ProfileTitles
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProfileTitles");
		return ptr;
	}

};


// Class TgClient.UIComponent_BPFreePassReward
// 0x185B9CB9CB0
class UIComponent_BPFreePassReward
{
public:
	unsigned char                                      UnknownData00[0x185B9CB9CB0];                             // 0x0000(0x185B9CB9CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BPFreePassReward");
		return ptr;
	}

};


// Class TgClient.UIComponent_BPReward
// 0x185B9CBCA70
class UIComponent_BPReward
{
public:
	unsigned char                                      UnknownData00[0x185B9CBCA70];                             // 0x0000(0x185B9CBCA70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BPReward");
		return ptr;
	}

};


// Class TgClient.UIScene_UIBattlePassLevelUp
// 0x185B5555CE0
class UIScene_UIBattlePassLevelUp
{
public:
	unsigned char                                      UnknownData00[0x185B5555CE0];                             // 0x0000(0x185B5555CE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIBattlePassLevelUp");
		return ptr;
	}

};


// Class TgClient.UIComponent_BPPurchaseElement
// 0x185B9CBA670
class UIComponent_BPPurchaseElement
{
public:
	unsigned char                                      UnknownData00[0x185B9CBA670];                             // 0x0000(0x185B9CBA670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_BPPurchaseElement");
		return ptr;
	}

};


// Class TgClient.UIScene_UIBattlePassPurchase
// 0x185B5E11AE0
class UIScene_UIBattlePassPurchase
{
public:
	unsigned char                                      UnknownData00[0x185B5E11AE0];                             // 0x0000(0x185B5E11AE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIBattlePassPurchase");
		return ptr;
	}

};


// Class TgClient.TgGfxScene
// 0x185B8960210
class TgGfxScene
{
public:
	unsigned char                                      UnknownData00[0x185B8960210];                             // 0x0000(0x185B8960210) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxScene");
		return ptr;
	}

};


// Class TgClient.TgGfxCursor
// 0x185B59D1210
class TgGfxCursor
{
public:
	unsigned char                                      UnknownData00[0x185B59D1210];                             // 0x0000(0x185B59D1210) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxCursor");
		return ptr;
	}

};


// Class TgClient.TgGfxTeamInvite
// 0x185B59D4090
class TgGfxTeamInvite
{
public:
	unsigned char                                      UnknownData00[0x185B59D4090];                             // 0x0000(0x185B59D4090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxTeamInvite");
		return ptr;
	}

};


// Class TgClient.UIAcademy
// 0x185B59ED110
class UIAcademy
{
public:
	unsigned char                                      UnknownData00[0x185B59ED110];                             // 0x0000(0x185B59ED110) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIAcademy");
		return ptr;
	}

};


// Class TgClient.UIAccessories
// 0x0000
class UIAccessories
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIAccessories");
		return ptr;
	}

};


// Class TgClient.UIAccountLinkPopup
// 0x185B6649170
class UIAccountLinkPopup
{
public:
	unsigned char                                      UnknownData00[0x185B6649170];                             // 0x0000(0x185B6649170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIAccountLinkPopup");
		return ptr;
	}

};


// Class TgClient.UIAchievementPopups
// 0x185B59EB550
class UIAchievementPopups
{
public:
	unsigned char                                      UnknownData00[0x185B59EB550];                             // 0x0000(0x185B59EB550) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIAchievementPopups");
		return ptr;
	}

};


// Class TgClient.UIAcquisition
// 0x185B5549F80
class UIAcquisition
{
public:
	unsigned char                                      UnknownData00[0x185B5549F80];                             // 0x0000(0x185B5549F80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIAcquisition");
		return ptr;
	}

};


// Class TgClient.UIAsiaticEvent
// 0x0000
class UIAsiaticEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIAsiaticEvent");
		return ptr;
	}

};


// Class TgClient.UIBackground
// 0x185B9CABAF0
class UIBackground
{
public:
	unsigned char                                      UnknownData00[0x185B9CABAF0];                             // 0x0000(0x185B9CABAF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIBackground");
		return ptr;
	}

};


// Class TgClient.UIBattlePass
// 0x0000
class UIBattlePass
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIBattlePass");
		return ptr;
	}

};


// Class TgClient.UIBattlePassLevelUp
// 0x0000
class UIBattlePassLevelUp
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIBattlePassLevelUp");
		return ptr;
	}

};


// Class TgClient.UIBattlePassPurchase
// 0x0000
class UIBattlePassPurchase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIBattlePassPurchase");
		return ptr;
	}

};


// Class TgClient.UIBattlePassXPPurchase
// 0x0000
class UIBattlePassXPPurchase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIBattlePassXPPurchase");
		return ptr;
	}

};


// Class TgClient.UICalendarEvent
// 0x0000
class UICalendarEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UICalendarEvent");
		return ptr;
	}

};


// Class TgClient.UIChampion
// 0x0000
class UIChampion
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIChampion");
		return ptr;
	}

};


// Class TgClient.UIChampionMastery
// 0x0000
class UIChampionMastery
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIChampionMastery");
		return ptr;
	}

};


// Class TgClient.UIChampionSelect
// 0x0000
class UIChampionSelect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIChampionSelect");
		return ptr;
	}

};


// Class TgClient.UIChatScene
// 0x185B9CAC9F0
class UIChatScene
{
public:
	unsigned char                                      UnknownData00[0x185B9CAC9F0];                             // 0x0000(0x185B9CAC9F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIChatScene");
		return ptr;
	}

};


// Class TgClient.UIChatTab
// 0x185B9CAE8B0
class UIChatTab
{
public:
	unsigned char                                      UnknownData00[0x185B9CAE8B0];                             // 0x0000(0x185B9CAE8B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIChatTab");
		return ptr;
	}

};


// Class TgClient.UIHudChatBox
// 0x185B2B65A60
class UIHudChatBox
{
public:
	unsigned char                                      UnknownData00[0x185B2B65A60];                             // 0x0000(0x185B2B65A60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudChatBox");
		return ptr;
	}

};


// Class TgClient.UIHudChat
// 0x0000
class UIHudChat
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudChat");
		return ptr;
	}

};


// Class TgClient.UICommendationRewards
// 0x0000
class UICommendationRewards
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UICommendationRewards");
		return ptr;
	}

};


// Class TgClient.UICompetitive
// 0x0000
class UICompetitive
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UICompetitive");
		return ptr;
	}

};


// Class TgClient.UICompetitivePopupWelcome
// 0x0000
class UICompetitivePopupWelcome
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UICompetitivePopupWelcome");
		return ptr;
	}

};


// Class TgClient.UICompetitiveRankChange
// 0x0000
class UICompetitiveRankChange
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UICompetitiveRankChange");
		return ptr;
	}

};


// Class TgClient.UICompetitiveRankDecay
// 0x0000
class UICompetitiveRankDecay
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UICompetitiveRankDecay");
		return ptr;
	}

};


// Class TgClient.UICouponAcquisition
// 0x185B9915FF0
class UICouponAcquisition
{
public:
	unsigned char                                      UnknownData00[0x185B9915FF0];                             // 0x0000(0x185B9915FF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UICouponAcquisition");
		return ptr;
	}

};


// Class TgClient.UICredits
// 0x0000
class UICredits
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UICredits");
		return ptr;
	}

};


// Class TgClient.UIDiscardQuestPopup
// 0x0000
class UIDiscardQuestPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDiscardQuestPopup");
		return ptr;
	}

};


// Class TgClient.UIEditLoadouts
// 0x0000
class UIEditLoadouts
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIEditLoadouts");
		return ptr;
	}

};


// Class TgClient.UIEndOfMatchLobby
// 0x0000
class UIEndOfMatchLobby
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIEndOfMatchLobby");
		return ptr;
	}

};


// Class TgClient.UIEndTimesEvent
// 0x0000
class UIEndTimesEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIEndTimesEvent");
		return ptr;
	}

};


// Class TgClient.UIEOMLAcquisition
// 0x185B9936F30
class UIEOMLAcquisition
{
public:
	unsigned char                                      UnknownData00[0x185B9936F30];                             // 0x0000(0x185B9936F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIEOMLAcquisition");
		return ptr;
	}

};


// Class TgClient.UIFacebookLiveIndicator
// 0x185B9936330
class UIFacebookLiveIndicator
{
public:
	unsigned char                                      UnknownData00[0x185B9936330];                             // 0x0000(0x185B9936330) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIFacebookLiveIndicator");
		return ptr;
	}

};


// Class TgClient.UIFacebookLivePopup
// 0x0000
class UIFacebookLivePopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIFacebookLivePopup");
		return ptr;
	}

};


// Class TgClient.UIFade
// 0x185B9937830
class UIFade
{
public:
	unsigned char                                      UnknownData00[0x185B9937830];                             // 0x0000(0x185B9937830) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIFade");
		return ptr;
	}

};


// Class TgClient.UIFooter
// 0x185B9935C70
class UIFooter
{
public:
	unsigned char                                      UnknownData00[0x185B9935C70];                             // 0x0000(0x185B9935C70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIFooter");
		return ptr;
	}

};


// Class TgClient.UIFooterGamepad
// 0x0000
class UIFooterGamepad
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIFooterGamepad");
		return ptr;
	}

};


// Class TgClient.UIFullScreen
// 0x0000
class UIFullScreen
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIFullScreen");
		return ptr;
	}

};


// Class TgClient.UIGameMenu
// 0x0000
class UIGameMenu
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIGameMenu");
		return ptr;
	}

};


// Class TgClient.UIHalloweenEvent
// 0x0000
class UIHalloweenEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHalloweenEvent");
		return ptr;
	}

};


// Class TgClient.UIHeader
// 0x0000
class UIHeader
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHeader");
		return ptr;
	}

};


// Class TgClient.UIHnHAcquisition
// 0x0000
class UIHnHAcquisition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHnHAcquisition");
		return ptr;
	}

};


// Class TgClient.UIHnHEvent
// 0x0000
class UIHnHEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHnHEvent");
		return ptr;
	}

};


// Class TgClient.UIHome
// 0x0000
class UIHome
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHome");
		return ptr;
	}

};


// Class TgClient.UIHud
// 0x185B2B54F60
class UIHud
{
public:
	unsigned char                                      UnknownData00[0x185B2B54F60];                             // 0x0000(0x185B2B54F60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHud");
		return ptr;
	}

};


// Class TgClient.UIHudBinoculars
// 0x185B2B569A0
class UIHudBinoculars
{
public:
	unsigned char                                      UnknownData00[0x185B2B569A0];                             // 0x0000(0x185B2B569A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudBinoculars");
		return ptr;
	}

};


// Class TgClient.UIHudBurns
// 0x185B2B57D20
class UIHudBurns
{
public:
	unsigned char                                      UnknownData00[0x185B2B57D20];                             // 0x0000(0x185B2B57D20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudBurns");
		return ptr;
	}

};


// Class TgClient.UIHudBurnsConquest
// 0x185B2B57960
class UIHudBurnsConquest
{
public:
	unsigned char                                      UnknownData00[0x185B2B57960];                             // 0x0000(0x185B2B57960) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudBurnsConquest");
		return ptr;
	}

};


// Class TgClient.UIHudCards
// 0x185B6651BD0
class UIHudCards
{
public:
	unsigned char                                      UnknownData00[0x185B6651BD0];                             // 0x0000(0x185B6651BD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudCards");
		return ptr;
	}

};


// Class TgClient.UIHudCenter
// 0x185B6651CF0
class UIHudCenter
{
public:
	unsigned char                                      UnknownData00[0x185B6651CF0];                             // 0x0000(0x185B6651CF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudCenter");
		return ptr;
	}

};


// Class TgClient.UIHudChampionSelect
// 0x185B6652B90
class UIHudChampionSelect
{
public:
	unsigned char                                      UnknownData00[0x185B6652B90];                             // 0x0000(0x185B6652B90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudChampionSelect");
		return ptr;
	}

};


// Class TgClient.UIHudChomp
// 0x0000
class UIHudChomp
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudChomp");
		return ptr;
	}

};


// Class TgClient.UIHudCredits
// 0x185B6653910
class UIHudCredits
{
public:
	unsigned char                                      UnknownData00[0x185B6653910];                             // 0x0000(0x185B6653910) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudCredits");
		return ptr;
	}

};


// Class TgClient.UIHudDebuff
// 0x185B2B63360
class UIHudDebuff
{
public:
	unsigned char                                      UnknownData00[0x185B2B63360];                             // 0x0000(0x185B2B63360) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudDebuff");
		return ptr;
	}

};


// Class TgClient.UIHudDecks
// 0x185B2B679E0
class UIHudDecks
{
public:
	unsigned char                                      UnknownData00[0x185B2B679E0];                             // 0x0000(0x185B2B679E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudDecks");
		return ptr;
	}

};


// Class TgClient.UIHudDruid
// 0x0000
class UIHudDruid
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudDruid");
		return ptr;
	}

};


// Class TgClient.UIHudImani
// 0x0000
class UIHudImani
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudImani");
		return ptr;
	}

};


// Class TgClient.UIHudKillFeed
// 0x185B6656CD0
class UIHudKillFeed
{
public:
	unsigned char                                      UnknownData00[0x185B6656CD0];                             // 0x0000(0x185B6656CD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudKillFeed");
		return ptr;
	}

};


// Class TgClient.UIHudKoga
// 0x0000
class UIHudKoga
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudKoga");
		return ptr;
	}

};


// Class TgClient.UIHudMap
// 0x185B6655890
class UIHudMap
{
public:
	unsigned char                                      UnknownData00[0x185B6655890];                             // 0x0000(0x185B6655890) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudMap");
		return ptr;
	}

};


// Class TgClient.UIHudMenu
// 0x185B2B70860
class UIHudMenu
{
public:
	unsigned char                                      UnknownData00[0x185B2B70860];                             // 0x0000(0x185B2B70860) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudMenu");
		return ptr;
	}

};


// Class TgClient.UIHudMinimap
// 0x185B6657B70
class UIHudMinimap
{
public:
	unsigned char                                      UnknownData00[0x185B6657B70];                             // 0x0000(0x185B6657B70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudMinimap");
		return ptr;
	}

};


// Class TgClient.UIHudNotify
// 0x185B2B72A20
class UIHudNotify
{
public:
	unsigned char                                      UnknownData00[0x185B2B72A20];                             // 0x0000(0x185B2B72A20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudNotify");
		return ptr;
	}

};


// Class TgClient.UIHudOverlays
// 0x0000
class UIHudOverlays
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudOverlays");
		return ptr;
	}

};


// Class TgClient.UIHudPlayer_Base
// 0x185B2B770A0
class UIHudPlayer_Base
{
public:
	unsigned char                                      UnknownData00[0x185B2B770A0];                             // 0x0000(0x185B2B770A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudPlayer_Base");
		return ptr;
	}

};


// Class TgClient.UIHudPlayer
// 0x185B2B758A0
class UIHudPlayer
{
public:
	unsigned char                                      UnknownData00[0x185B2B758A0];                             // 0x0000(0x185B2B758A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudPlayer");
		return ptr;
	}

};


// Class TgClient.UIHudPlayer_NPC
// 0x185B2B77760
class UIHudPlayer_NPC
{
public:
	unsigned char                                      UnknownData00[0x185B2B77760];                             // 0x0000(0x185B2B77760) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudPlayer_NPC");
		return ptr;
	}

};


// Class TgClient.UIHudRecap
// 0x0000
class UIHudRecap
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudRecap");
		return ptr;
	}

};


// Class TgClient.UIHudResult
// 0x185B6657ED0
class UIHudResult
{
public:
	unsigned char                                      UnknownData00[0x185B6657ED0];                             // 0x0000(0x185B6657ED0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudResult");
		return ptr;
	}

};


// Class TgClient.UIHudScore
// 0x185B6657270
class UIHudScore
{
public:
	unsigned char                                      UnknownData00[0x185B6657270];                             // 0x0000(0x185B6657270) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudScore");
		return ptr;
	}

};


// Class TgClient.UIHudScoreboard
// 0x185B2B808E0
class UIHudScoreboard
{
public:
	unsigned char                                      UnknownData00[0x185B2B808E0];                             // 0x0000(0x185B2B808E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudScoreboard");
		return ptr;
	}

};


// Class TgClient.UIHudSkills
// 0x185B5552EA0
class UIHudSkills
{
public:
	unsigned char                                      UnknownData00[0x185B5552EA0];                             // 0x0000(0x185B5552EA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudSkills");
		return ptr;
	}

};


// Class TgClient.UIHudSkills3P
// 0x185B2B81BA0
class UIHudSkills3P
{
public:
	unsigned char                                      UnknownData00[0x185B2B81BA0];                             // 0x0000(0x185B2B81BA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudSkills3P");
		return ptr;
	}

};


// Class TgClient.UIHudSniper
// 0x185B2B81120
class UIHudSniper
{
public:
	unsigned char                                      UnknownData00[0x185B2B81120];                             // 0x0000(0x185B2B81120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudSniper");
		return ptr;
	}

};


// Class TgClient.UIHudStrix
// 0x0000
class UIHudStrix
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudStrix");
		return ptr;
	}

};


// Class TgClient.UIHudTarget
// 0x185B2B83FA0
class UIHudTarget
{
public:
	unsigned char                                      UnknownData00[0x185B2B83FA0];                             // 0x0000(0x185B2B83FA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudTarget");
		return ptr;
	}

};


// Class TgClient.UIHudTeam
// 0x185B66586B0
class UIHudTeam
{
public:
	unsigned char                                      UnknownData00[0x185B66586B0];                             // 0x0000(0x185B66586B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudTeam");
		return ptr;
	}

};


// Class TgClient.UIHudEnemy
// 0x0000
class UIHudEnemy
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudEnemy");
		return ptr;
	}

};


// Class TgClient.UIHudTiberius
// 0x0000
class UIHudTiberius
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudTiberius");
		return ptr;
	}

};


// Class TgClient.UIHudTip
// 0x185B2B811E0
class UIHudTip
{
public:
	unsigned char                                      UnknownData00[0x185B2B811E0];                             // 0x0000(0x185B2B811E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudTip");
		return ptr;
	}

};


// Class TgClient.UIHudVGS
// 0x0000
class UIHudVGS
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudVGS");
		return ptr;
	}

};


// Class TgClient.UIHudVoiceChat
// 0x185B2B85F20
class UIHudVoiceChat
{
public:
	unsigned char                                      UnknownData00[0x185B2B85F20];                             // 0x0000(0x185B2B85F20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudVoiceChat");
		return ptr;
	}

};


// Class TgClient.UIHudVora
// 0x0000
class UIHudVora
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudVora");
		return ptr;
	}

};


// Class TgClient.UIHudWaypoint
// 0x185B2B863A0
class UIHudWaypoint
{
public:
	unsigned char                                      UnknownData00[0x185B2B863A0];                             // 0x0000(0x185B2B863A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudWaypoint");
		return ptr;
	}

};


// Class TgClient.UIHudYagorath
// 0x0000
class UIHudYagorath
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudYagorath");
		return ptr;
	}

};


// Class TgClient.UIInputPopup
// 0x0000
class UIInputPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIInputPopup");
		return ptr;
	}

};


// Class TgClient.UIKeybindPopup
// 0x0000
class UIKeybindPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIKeybindPopup");
		return ptr;
	}

};


// Class TgClient.UILeaderboard
// 0x0000
class UILeaderboard
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UILeaderboard");
		return ptr;
	}

};


// Class TgClient.UILobbyBoosterActivation
// 0x0000
class UILobbyBoosterActivation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UILobbyBoosterActivation");
		return ptr;
	}

};


// Class TgClient.UILobbyBoosterSelect
// 0x0000
class UILobbyBoosterSelect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UILobbyBoosterSelect");
		return ptr;
	}

};


// Class TgClient.UILobbyChat
// 0x185B6656BB0
class UILobbyChat
{
public:
	unsigned char                                      UnknownData00[0x185B6656BB0];                             // 0x0000(0x185B6656BB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UILobbyChat");
		return ptr;
	}

};


// Class TgClient.UILogin
// 0x185B2B8BAA0
class UILogin
{
public:
	unsigned char                                      UnknownData00[0x185B2B8BAA0];                             // 0x0000(0x185B2B8BAA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UILogin");
		return ptr;
	}

};


// Class TgClient.UIMatchInvite
// 0x0000
class UIMatchInvite
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIMatchInvite");
		return ptr;
	}

};


// Class TgClient.UIMatchLobby
// 0x185B2B4D8E0
class UIMatchLobby
{
public:
	unsigned char                                      UnknownData00[0x185B2B4D8E0];                             // 0x0000(0x185B2B4D8E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIMatchLobby");
		return ptr;
	}

};


// Class TgClient.UIMenuManager
// 0x185B2B4C320
class UIMenuManager
{
public:
	unsigned char                                      UnknownData00[0x185B2B4C320];                             // 0x0000(0x185B2B4C320) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIMenuManager");
		return ptr;
	}

};


// Class TgClient.UINotificationCenter
// 0x0000
class UINotificationCenter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UINotificationCenter");
		return ptr;
	}

};


// Class TgClient.UINotificationPopup
// 0x0000
class UINotificationPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UINotificationPopup");
		return ptr;
	}

};


// Class TgClient.UIPatchNotesPopup
// 0x0000
class UIPatchNotesPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPatchNotesPopup");
		return ptr;
	}

};


// Class TgClient.UIPlay
// 0x0000
class UIPlay
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPlay");
		return ptr;
	}

};


// Class TgClient.UIPopup
// 0x0000
class UIPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPopup");
		return ptr;
	}

};


// Class TgClient.UIFullScreenBattlePass
// 0x0000
class UIFullScreenBattlePass
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIFullScreenBattlePass");
		return ptr;
	}

};


// Class TgClient.UIMatchLobbyTradePopup
// 0x0000
class UIMatchLobbyTradePopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIMatchLobbyTradePopup");
		return ptr;
	}

};


// Class TgClient.UIPopupRealMoneyPurchase
// 0x0000
class UIPopupRealMoneyPurchase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPopupRealMoneyPurchase");
		return ptr;
	}

};


// Class TgClient.UIPopupChampionLevelUp
// 0x0000
class UIPopupChampionLevelUp
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPopupChampionLevelUp");
		return ptr;
	}

};


// Class TgClient.UIPopupDeal
// 0x0000
class UIPopupDeal
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPopupDeal");
		return ptr;
	}

};


// Class TgClient.UIPopupPartyManager
// 0x0000
class UIPopupPartyManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPopupPartyManager");
		return ptr;
	}

};


// Class TgClient.UIPopupPlaySettings
// 0x0000
class UIPopupPlaySettings
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPopupPlaySettings");
		return ptr;
	}

};


// Class TgClient.UIPopupTwitchPrime
// 0x0000
class UIPopupTwitchPrime
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPopupTwitchPrime");
		return ptr;
	}

};


// Class TgClient.UIProfile
// 0x185B5E05DE0
class UIProfile
{
public:
	unsigned char                                      UnknownData00[0x185B5E05DE0];                             // 0x0000(0x185B5E05DE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIProfile");
		return ptr;
	}

};


// Class TgClient.UIProfileMini
// 0x185B5E08AE0
class UIProfileMini
{
public:
	unsigned char                                      UnknownData00[0x185B5E08AE0];                             // 0x0000(0x185B5E08AE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIProfileMini");
		return ptr;
	}

};


// Class TgClient.UIPurchase
// 0x185B5E0C920
class UIPurchase
{
public:
	unsigned char                                      UnknownData00[0x185B5E0C920];                             // 0x0000(0x185B5E0C920) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPurchase");
		return ptr;
	}

};


// Class TgClient.UIPurchaseGems
// 0x185B66548D0
class UIPurchaseGems
{
public:
	unsigned char                                      UnknownData00[0x185B66548D0];                             // 0x0000(0x185B66548D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPurchaseGems");
		return ptr;
	}

};


// Class TgClient.UIQuests
// 0x185B5554DE0
class UIQuests
{
public:
	unsigned char                                      UnknownData00[0x185B5554DE0];                             // 0x0000(0x185B5554DE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIQuests");
		return ptr;
	}

};


// Class TgClient.UIRadialMenu
// 0x0000
class UIRadialMenu
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIRadialMenu");
		return ptr;
	}

};


// Class TgClient.UIRadialMenuEquip
// 0x0000
class UIRadialMenuEquip
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIRadialMenuEquip");
		return ptr;
	}

};


// Class TgClient.UIRadialMenuVGS
// 0x0000
class UIRadialMenuVGS
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIRadialMenuVGS");
		return ptr;
	}

};


// Class TgClient.UIReferredRewardsPopup
// 0x0000
class UIReferredRewardsPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIReferredRewardsPopup");
		return ptr;
	}

};


// Class TgClient.UISafeFrame
// 0x185B5E0B960
class UISafeFrame
{
public:
	unsigned char                                      UnknownData00[0x185B5E0B960];                             // 0x0000(0x185B5E0B960) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UISafeFrame");
		return ptr;
	}

};


// Class TgClient.UISendGift
// 0x0000
class UISendGift
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UISendGift");
		return ptr;
	}

};


// Class TgClient.UISettings
// 0x185B5E3ABE0
class UISettings
{
public:
	unsigned char                                      UnknownData00[0x185B5E3ABE0];                             // 0x0000(0x185B5E3ABE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UISettings");
		return ptr;
	}

};


// Class TgClient.UISkills
// 0x0000
class UISkills
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UISkills");
		return ptr;
	}

};


// Class TgClient.UISocial
// 0x0000
class UISocial
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UISocial");
		return ptr;
	}

};


// Class TgClient.UIStore
// 0x0000
class UIStore
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIStore");
		return ptr;
	}

};


// Class TgClient.UIStoreDetail
// 0x0000
class UIStoreDetail
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIStoreDetail");
		return ptr;
	}

};


// Class TgClient.UIStoreFilterPopup
// 0x0000
class UIStoreFilterPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIStoreFilterPopup");
		return ptr;
	}

};


// Class TgClient.UIStoreRentSprayPopup
// 0x0000
class UIStoreRentSprayPopup
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIStoreRentSprayPopup");
		return ptr;
	}

};


// Class TgClient.UIStreetStyleEvent
// 0x0000
class UIStreetStyleEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIStreetStyleEvent");
		return ptr;
	}

};


// Class TgClient.UISubtitle
// 0x185B5E39B60
class UISubtitle
{
public:
	unsigned char                                      UnknownData00[0x185B5E39B60];                             // 0x0000(0x185B5E39B60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UISubtitle");
		return ptr;
	}

};


// Class TgClient.UISummerEvent
// 0x0000
class UISummerEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UISummerEvent");
		return ptr;
	}

};


// Class TgClient.UITalents
// 0x0000
class UITalents
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UITalents");
		return ptr;
	}

};


// Class TgClient.UIWebBrowser
// 0x185B5E38960
class UIWebBrowser
{
public:
	unsigned char                                      UnknownData00[0x185B5E38960];                             // 0x0000(0x185B5E38960) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIWebBrowser");
		return ptr;
	}

};


// Class TgClient.UIWinterEvent
// 0x0000
class UIWinterEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIWinterEvent");
		return ptr;
	}

};


// Class TgClient.UIWorldOverlay
// 0x185B66590D0
class UIWorldOverlay
{
public:
	unsigned char                                      UnknownData00[0x185B66590D0];                             // 0x0000(0x185B66590D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIWorldOverlay");
		return ptr;
	}

};


// Class TgClient.UIQuestUtilities
// 0x185B5555E20
class UIQuestUtilities
{
public:
	unsigned char                                      UnknownData00[0x185B5555E20];                             // 0x0000(0x185B5555E20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIQuestUtilities");
		return ptr;
	}

};


// Class TgClient.TgIconDetails
// 0x185B59D54D0
class TgIconDetails
{
public:
	unsigned char                                      UnknownData00[0x185B59D54D0];                             // 0x0000(0x185B59D54D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgIconDetails");
		return ptr;
	}

};


// Class TgClient.TgIconGroup
// 0x185B663F510
class TgIconGroup
{
public:
	unsigned char                                      UnknownData00[0x185B663F510];                             // 0x0000(0x185B663F510) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgIconGroup");
		return ptr;
	}

};


// Class TgClient.TgIconManager
// 0x185B59D3E50
class TgIconManager
{
public:
	unsigned char                                      UnknownData00[0x185B59D3E50];                             // 0x0000(0x185B59D3E50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgIconManager");
		return ptr;
	}

};


// Class TgClient.UIComponent_ProgressBarHorizontal_Flagball
// 0x185B98FF730
class UIComponent_ProgressBarHorizontal_Flagball
{
public:
	unsigned char                                      UnknownData00[0x185B98FF730];                             // 0x0000(0x185B98FF730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIComponent_ProgressBarHorizontal_Flagball");
		return ptr;
	}

};


// Class TgClient.TgGfxChatModal
// 0x0000
class TgGfxChatModal
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxChatModal");
		return ptr;
	}

};


// Class TgClient.UIScene_Dont_Create_Input
// 0x0000
class UIScene_Dont_Create_Input
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_Dont_Create_Input");
		return ptr;
	}

};


// Class TgClient.UIScene_UIBackground
// 0x0000
class UIScene_UIBackground
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIScene_UIBackground");
		return ptr;
	}

};


// Class TgClient.UIHudAtlas
