#pragma once

// Paladins (3.05) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PL_TgClient_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class TgClient.TgBrowserManager
// 0x0168 (0x01C8 - 0x0060)
class UTgBrowserManager : public UPComBrowserManager
{
public:
	struct FString                                     URLGold;                                                  // 0x0060(0x0010) (NeedCtorLink)
	struct FString                                     URLAlert;                                                 // 0x0070(0x0010) (NeedCtorLink)
	struct FString                                     URLStore;                                                 // 0x0080(0x0010) (NeedCtorLink)
	struct FString                                     URLBooster;                                               // 0x0090(0x0010) (NeedCtorLink)
	struct FString                                     URLSupport;                                               // 0x00A0(0x0010) (NeedCtorLink)
	struct FString                                     URLProfile;                                               // 0x00B0(0x0010) (NeedCtorLink)
	struct FString                                     URLRedirect;                                              // 0x00C0(0x0010) (NeedCtorLink)
	struct FString                                     URLActivateKey;                                           // 0x00D0(0x0010) (NeedCtorLink)
	struct FString                                     URLCreateAccount;                                         // 0x00E0(0x0010) (NeedCtorLink)
	struct FString                                     URLRecoverPassword;                                       // 0x00F0(0x0010) (NeedCtorLink)
	struct FString                                     URLRecoverUsername;                                       // 0x0100(0x0010) (NeedCtorLink)
	struct FString                                     URLGodPack;                                               // 0x0110(0x0010) (NeedCtorLink)
	struct FString                                     URLRanked;                                                // 0x0120(0x0010) (NeedCtorLink)
	struct FString                                     URLFacebookPromo;                                         // 0x0130(0x0010) (NeedCtorLink)
	struct FString                                     URLTwitterPromo;                                          // 0x0140(0x0010) (NeedCtorLink)
	struct FString                                     URLRecruitPromo;                                          // 0x0150(0x0010) (NeedCtorLink)
	struct FString                                     URLPlayerStats;                                           // 0x0160(0x0010) (NeedCtorLink)
	struct FString                                     URLTwitchSignup;                                          // 0x0170(0x0010) (NeedCtorLink)
	struct FString                                     URLTwitchHelp;                                            // 0x0180(0x0010) (NeedCtorLink)
	struct FString                                     URLLaunchTournament;                                      // 0x0190(0x0010) (NeedCtorLink)
	struct FString                                     URLLinkAccount;                                           // 0x01A0(0x0010) (NeedCtorLink)
	struct FString                                     URLReferAFriend;                                          // 0x01B0(0x0010) (NeedCtorLink)
	class UUIWebBrowser*                               m_pContainer;                                             // 0x01C0(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgBrowserManager");
		return ptr;
	}


	void AccountLink();
	void LaunchTournament();
	void TwitchSignup();
	void TwitchHelp();
	void PlayerStats(const struct FString& sPlayerName);
	void RecruitPromo();
	void TwitterPromo();
	void FacebookPromo();
	void RankedRules();
	void GodPack();
	void SubmitBugReport(const struct FString& sPlayerName);
	void RecoverUsername();
	void RecoverPassword();
	void CreateAccount();
	void ActivateKey();
	void Profile();
	void Support();
	void Booster();
	void Store();
	void Gold();
	void Alert();
	void SetContainer(class UUIWebBrowser* pContainer);
	void ResizeView();
	void Close();
	void OpenVideo(const struct FString& URL, bool bAddName);
	void OpenURL(const struct FString& URL, bool bShowNavButtons, bool bSetFocus);
	void ExternalOpenURL(const struct FString& URL, bool bAddLang);
	bool IsBrowserLoaded();
};


// Class TgClient.TgChatData
// 0x0068 (0x00C8 - 0x0060)
class UTgChatData : public UObject
{
public:
	int                                                m_nId;                                                    // 0x0060(0x0004)
	int                                                m_nSoundId;                                               // 0x0064(0x0004)
	int                                                m_nChannel;                                               // 0x0068(0x0004)
	unsigned long                                      m_bFeedback : 1;                                          // 0x006C(0x0004)
	unsigned long                                      m_bSenderIsPaidBattlePass : 1;                            // 0x006C(0x0004)
	unsigned long                                      m_bSenderIsVerifiedPlayer : 1;                            // 0x006C(0x0004)
	unsigned long                                      m_bIsVGS : 1;                                             // 0x006C(0x0004)
	struct FString                                     m_sSender;                                                // 0x0070(0x0010) (NeedCtorLink)
	struct Fdword                                      m_dwSenderId;                                             // 0x0080(0x0004)
	struct Fdword                                      m_dwSenderBattlePassXp;                                   // 0x0084(0x0004)
	struct FString                                     m_sMessage;                                               // 0x0088(0x0010) (NeedCtorLink)
	struct FString                                     m_sSenderColor;                                           // 0x0098(0x0010) (NeedCtorLink)
	struct FString                                     m_sSenderClass;                                           // 0x00A8(0x0010) (NeedCtorLink)
	struct FString                                     m_sMessageColor;                                          // 0x00B8(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgChatData");
		return ptr;
	}

};


// Class TgClient.TgClientHUD
// 0x00DC (0x0684 - 0x05A8)
class ATgClientHUD : public ATgHUD
{
public:
	unsigned char                                      m_eState;                                                 // 0x05A8(0x0001)
	unsigned char                                      m_ePromptType;                                            // 0x05A9(0x0001)
	unsigned char                                      m_eCaptureState;                                          // 0x05AA(0x0001)
	unsigned char                                      UnknownData00[0x1];                                       // 0x05AB(0x0001) MISSED OFFSET
	float                                              m_fPromptTime;                                            // 0x05AC(0x0004)
	float                                              m_fPromptTimer;                                           // 0x05B0(0x0004)
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x05B4(0x0008)
	TArray<class UTgGfxScene*>                         m_SceneStack;                                             // 0x05BC(0x0010) (NeedCtorLink)
	TArray<class UTgGfxScene*>                         m_PopupStack;                                             // 0x05CC(0x0010) (NeedCtorLink)
	TArray<struct FSceneInfo>                          m_ScenePreloads;                                          // 0x05DC(0x0010) (NeedCtorLink)
	TArray<struct FString>                             m_sNeededScenes;                                          // 0x05EC(0x0010) (NeedCtorLink)
	unsigned long                                      m_bShowCursor : 1;                                        // 0x05FC(0x0004)
	unsigned long                                      m_bCaptureKeys : 1;                                       // 0x05FC(0x0004)
	unsigned long                                      m_bHidden : 1;                                            // 0x05FC(0x0004)
	unsigned long                                      m_bGamepadForced : 1;                                     // 0x05FC(0x0004)
	int                                                m_nNumLeftClick;                                          // 0x0600(0x0004)
	class UPComPictureInPicture*                       m_PictureInPicture;                                       // 0x0604(0x0008)
	TArray<class UUIMoviePlayer*>                      m_MoviePlayers;                                           // 0x060C(0x0010) (AlwaysInit, NeedCtorLink)
	class UTgDevMenuMoviePlayer*                       m_DevMenu;                                                // 0x061C(0x0008) (AlwaysInit)
	class UUIGAPeachStartup*                           m_GAPeach;                                                // 0x0624(0x0008) (AlwaysInit)
	TArray<struct FMessageRedirect>                    m_MessageRedirects;                                       // 0x062C(0x0010) (Config, NeedCtorLink)
	unsigned char                                      UnknownData01[0x48];                                      // 0x063C(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.TgClientHUD.m_MessageRedirectMap

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgClientHUD");
		return ptr;
	}


	void TestShowCursor(bool bShow);
	void DebugPictureInPicture();
	void CreateTestPortraits(class UPComPictureInPictureScene* Scene, const struct FVector& ViewOffset, const struct FVector& LookAtOffset, float FOV, struct FString* BotName);
	void TestPictureInPicturePortraits(const struct FString& BotName);
	void TestPictureInPictureBasic();
	void PostRender();
	void PostBeginPlay();
	bool IsHidden();
	void SetGamepadForced(bool bEnabled);
	void TogglePushToTalk(bool bEnable);
	void ToggleDevMenu();
	void LogLTIPrices(int nLTI);
	void LogItemPrices(int nItemId);
	void DumpScenesToLog();
	void TestDidIt(int nActivityId, int nCount);
	void ResetViewCenterPoint();
	void ShowHUD();
	void STATIC_HideHUD();
	void ToggleHUD();
	bool TryToBack();
	void STATIC_ShowHit(class AActor* Target, float fDamageAmount, bool bIsShieldHit, struct FExtraDamageInfo* ExtraInfo);
	void STATIC_ShowCursor(bool bShow);
	void STATIC_EndDoubleClick();
	bool IsLoggedIn();
	bool IsInGame();
	bool RemoveSceneFromStack(class UTgGfxScene* pScene, bool bPopAll);
	bool STATIC_PopToScene(const struct FString& sName);
	void ClearScenes(unsigned char ePreviousState, unsigned char eTargetState);
	bool PopScene(int nIndex);
	bool PushScene(const struct FString& sName, bool bSkipPrivilegeCheck);
	void STATIC_Initialize();
};


// Class TgClient.TgData_Cards
// 0x0008 (0x0068 - 0x0060)
class UTgData_Cards : public UTgObject
{
public:
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x0060(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgData_Cards");
		return ptr;
	}


	void STATIC_Initialize(class UUIGameMoviePlayer* pMoviePlayer);
};


// Class TgClient.TgDataChunk
// 0x0054 (0x0158 - 0x0104)
class UTgDataChunk : public UGFxObject
{
public:
	class UTgDataHandler*                              m_DataHandler;                                            // 0x0104(0x0008)
	class UTgDataChunk*                                m_ParentChunk;                                            // 0x010C(0x0008)
	TArray<struct FDataField>                          m_DataList;                                               // 0x0114(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<class UTgDataChunk*>                        m_ChildChunks;                                            // 0x0124(0x0010) (AlwaysInit, NeedCtorLink)
	unsigned long                                      m_bIsDirty : 1;                                           // 0x0134(0x0004)
	unsigned long                                      m_bIsSubscribed : 1;                                      // 0x0134(0x0004)
	unsigned long                                      m_bClearOnMapChange : 1;                                  // 0x0134(0x0004)
	struct FScriptDelegate                             __usc_Subscribe_Delegate__Delegate;                       // 0x0138(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0138(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __usc_Unsubscribe_Delegate__Delegate;                     // 0x0148(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0148(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataChunk");
		return ptr;
	}


	void usc_Unsubscribe();
	void usc_Subscribe();
	void usc_Unsubscribe_Delegate();
	void usc_Subscribe_Delegate();
	class ATgPlayerController* GetPlayerController();
	void NotifyMapChange();
	bool IsSubscribed();
	void SetDirty();
	bool GetField(const struct FString& FieldName, struct FASValue* NewValue);
	bool SetField(const struct FString& FieldName, bool bCreateIfMissing, struct FASValue* NewValue);
	void AddField(const struct FString& FieldName, struct FASValue* NewValue);
	void ClearDelegates();
	void SetDelegates();
	void RemoveChild(class UTgDataChunk* Child, bool bClearDelegates);
	void AddChild(class UTgDataChunk* Child);
	void DataUpdateEvent();
	void Update(float DeltaTime, bool bSkipCallback);
	void InitializeData(class UTgDataHandler* Handler, class UTgDataChunk* parentChunk);
};


// Class TgClient.TgDataHandler
// 0x0018 (0x011C - 0x0104)
class UTgDataHandler : public UGFxObject
{
public:
	class UUIMoviePlayer*                              m_MP;                                                     // 0x0104(0x0008)
	TArray<class UTgDataChunk*>                        m_DataChunkList;                                          // 0x010C(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataHandler");
		return ptr;
	}


	void NotifyMapChange();
	void Update(float DeltaTime);
	void InitializeDataHandler(class UUIMoviePlayer* mp);
};


// Class TgClient.TgDataManager
// 0x0038 (0x0098 - 0x0060)
class UTgDataManager : public UObject
{
public:
	class UTgData_EOM*                                 m_EOMData;                                                // 0x0060(0x0008)
	class UTgData_Cards*                               m_CardData;                                               // 0x0068(0x0008)
	class UTgData_Notifications*                       m_NotificationData;                                       // 0x0070(0x0008)
	TArray<class UTgDataObject*>                       m_DataSets;                                               // 0x0078(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<class UTgDataObject*>                       m_Callbacks;                                              // 0x0088(0x0010) (AlwaysInit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataManager");
		return ptr;
	}

};


// Class TgClient.TgGameLaunch
// 0x0024 (0x04F0 - 0x04CC)
class ATgGameLaunch : public AGameInfo
{
public:
	struct FString                                     LoginName;                                                // 0x04CC(0x0010) (Config, GlobalConfig, NeedCtorLink)
	struct FString                                     LoginPwd;                                                 // 0x04DC(0x0010) (Config, GlobalConfig, NeedCtorLink)
	unsigned long                                      SaveLoginName : 1;                                        // 0x04EC(0x0004) (Config, GlobalConfig)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameLaunch");
		return ptr;
	}

};


// Class TgClient.TgGameViewportClient
// 0x0024 (0x01E8 - 0x01C4)
class UTgGameViewportClient : public UPComGameViewportClient
{
public:
	TArray<class UTgObjectReferencer*>                 m_DeferredManifests;                                      // 0x01C4(0x0010) (NeedCtorLink)
	unsigned long                                      m_dragging : 1;                                           // 0x01D4(0x0004)
	unsigned long                                      m_wasMaximized : 1;                                       // 0x01D4(0x0004)
	unsigned long                                      bReadLeftStickAxis : 1;                                   // 0x01D4(0x0004) (Transient)
	unsigned long                                      bReadRightStickAxis : 1;                                  // 0x01D4(0x0004) (Transient)
	float                                              fRawLeftStickAxis;                                        // 0x01D8(0x0004) (Transient)
	float                                              fRawRightStickAxis;                                       // 0x01DC(0x0004) (Transient)
	float                                              fRawRightStickX;                                          // 0x01E0(0x0004) (Transient)
	float                                              fRawRightStickY;                                          // 0x01E4(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameViewportClient");
		return ptr;
	}


	bool Init(struct FString* OutError);
	void LayoutPlayers();
	void GetSubtitleRegion(struct FVector2D* MinPos, struct FVector2D* MaxPos);
	void PostRender(class UCanvas* Canvas);
	void GameSessionEnded();
	void InitTgGameViewportClient();
	bool IsGfxMovieCapturingMouseInput();
	void NativeGameSessionEnded();
	void STATIC_DrawTransition(class UCanvas* Canvas);
};


// Class TgClient.TgGfxFriendManagement
// 0x01EC (0x02F0 - 0x0104)
class UTgGfxFriendManagement : public UGFxObject
{
public:
	class UUIGameMoviePlayer*                          m_Movie;                                                  // 0x0104(0x0008)
	struct FString                                     m_LastErrorString;                                        // 0x010C(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     m_SelectedPlayerName;                                     // 0x011C(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     m_InvitedPlayerName;                                      // 0x012C(0x0010) (AlwaysInit, NeedCtorLink)
	TEnumAsByte<EFriendTabs>                           m_tabId;                                                  // 0x013C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x013D(0x0003) MISSED OFFSET
	struct FScriptDelegate                             __USC_GetFriendsData_Delegate__Delegate;                  // 0x0140(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                                       // 0x013D(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_RemoveFriend_Delegate__Delegate;                    // 0x0150(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0150(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_MessageFriend_Delegate__Delegate;                   // 0x0160(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0160(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_SearchByString_Delegate__Delegate;                  // 0x0170(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData04[0x4];                                       // 0x0170(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_GetListData_Delegate__Delegate;                     // 0x0180(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData05[0x4];                                       // 0x0180(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_InviteFriend_Delegate__Delegate;                    // 0x0190(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData06[0x4];                                       // 0x0190(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_CancelInvite_Delegate__Delegate;                    // 0x01A0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData07[0x4];                                       // 0x01A0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_AcceptClanInvite_Delegate__Delegate;                // 0x01B0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData08[0x4];                                       // 0x01B0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_CancelClanInvite_Delegate__Delegate;                // 0x01C0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData09[0x4];                                       // 0x01C0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_AcceptFriendRequest_Delegate__Delegate;             // 0x01D0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData10[0x4];                                       // 0x01D0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_AcceptAllFriendRequests_Delegate__Delegate;         // 0x01E0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData11[0x4];                                       // 0x01E0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_CancelFriendRequest_Delegate__Delegate;             // 0x01F0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData12[0x4];                                       // 0x01F0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_CancelAllFriendRequests_Delegate__Delegate;         // 0x0200(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData13[0x4];                                       // 0x0200(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_ViewPlayerProfile_Delegate__Delegate;               // 0x0210(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData14[0x4];                                       // 0x0210(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_ViewPlayerClan_Delegate__Delegate;                  // 0x0220(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData15[0x4];                                       // 0x0220(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_SpectatePlayer_Delegate__Delegate;                  // 0x0230(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData16[0x4];                                       // 0x0230(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_WatchFriend_Delegate__Delegate;                     // 0x0240(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData17[0x4];                                       // 0x0240(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_PartyInvite_Delegate__Delegate;                     // 0x0250(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData18[0x4];                                       // 0x0250(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_PartyKick_Delegate__Delegate;                       // 0x0260(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData19[0x4];                                       // 0x0260(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_RemoveBlocked_Delegate__Delegate;                   // 0x0270(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData20[0x4];                                       // 0x0270(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_AddPlayerNote_Delegate__Delegate;                   // 0x0280(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData21[0x4];                                       // 0x0280(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_InviteFriendByString_Delegate__Delegate;            // 0x0290(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData22[0x4];                                       // 0x0290(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_BlockByString_Delegate__Delegate;                   // 0x02A0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData23[0x4];                                       // 0x02A0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_InviteToClan_Delegate__Delegate;                    // 0x02B0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData24[0x4];                                       // 0x02B0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_UpdateStatusMessage_Delegate__Delegate;             // 0x02C0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData25[0x4];                                       // 0x02C0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_ToggleDND_Delegate__Delegate;                       // 0x02D0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData26[0x4];                                       // 0x02D0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_Resize_Delegate__Delegate;                          // 0x02E0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData27[0x4];                                       // 0x02E0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxFriendManagement");
		return ptr;
	}


	void Reinit();
	void ASC_Reinit();
	void ErrorFeedback(const struct FString& ErrMsg);
	void ASC_ErrorFeedback(const struct FString& ErrMsg);
	void USC_Resize(class UGFxObject* pObj);
	void USC_ToggleDND();
	void USC_UpdateStatusMessage(const struct FString& sStatus);
	void USC_InviteToClan(const struct FString& sPlayerName);
	void USC_BlockByString(const struct FString& sPlayerName);
	void USC_InviteFriendByString(const struct FString& sPlayerName);
	void USC_AddPlayerNote(int nPlayerId, const struct FString& sPlayerNote);
	void USC_RemoveBlocked(int nPlayerId);
	void USC_PartyKick(int nPlayerId);
	void USC_PartyInvite(int nPlayerId);
	void USC_WatchFriend(int nPlayerId);
	void USC_SpectatePlayer(int nPlayerId);
	void USC_ViewPlayerClan();
	void USC_ViewPlayerProfile(const struct FString& sPlayerName);
	void USC_CancelAllFriendRequests();
	void USC_CancelFriendRequest(int nPlayerId);
	void USC_AcceptAllFriendRequests();
	void USC_AcceptFriendRequest(int nPlayerId);
	void USC_CancelClanInvite(int nClanId);
	void USC_AcceptClanInvite(int nClanId);
	void USC_CancelInvite(int nPlayerId);
	void USC_InviteFriend(int nPlayerId);
	void USC_GetListData(int nId);
	void USC_SearchByString(const struct FString& PlayerName);
	void USC_MessageFriend(int nPlayerId, const struct FString& sPlayerName);
	void USC_RemoveFriend(int nPlayerId);
	void USC_GetFriendsData();
	void USC_Resize_Delegate(class UGFxObject* pObj);
	void USC_ToggleDND_Delegate();
	void USC_UpdateStatusMessage_Delegate(const struct FString& sStatus);
	void USC_InviteToClan_Delegate(const struct FString& sPlayerName);
	void USC_BlockByString_Delegate(const struct FString& sPlayerName);
	void USC_InviteFriendByString_Delegate(const struct FString& sPlayerName);
	void USC_AddPlayerNote_Delegate(int nPlayerId, const struct FString& sPlayerNote);
	void USC_RemoveBlocked_Delegate(int nPlayerId);
	void USC_PartyKick_Delegate(int nPlayerId);
	void USC_PartyInvite_Delegate(int nPlayerId);
	void USC_WatchFriend_Delegate(int nPlayerId);
	void USC_SpectatePlayer_Delegate(int nPlayerId);
	void USC_ViewPlayerClan_Delegate();
	void USC_ViewPlayerProfile_Delegate(const struct FString& sPlayerName);
	void USC_CancelAllFriendRequests_Delegate();
	void USC_CancelFriendRequest_Delegate(int nPlayerId);
	void USC_AcceptAllFriendRequests_Delegate();
	void USC_AcceptFriendRequest_Delegate(int nPlayerId);
	void USC_CancelClanInvite_Delegate(int nClanId);
	void USC_AcceptClanInvite_Delegate(int nClanId);
	void USC_CancelInvite_Delegate(int nPlayerId);
	void USC_InviteFriend_Delegate(int nPlayerId);
	void USC_GetListData_Delegate(int nId);
	void USC_SearchByString_Delegate(const struct FString& PlayerName);
	void USC_MessageFriend_Delegate(int nPlayerId, const struct FString& sPlayerName);
	void USC_RemoveFriend_Delegate(int nPlayerId);
	void USC_GetFriendsData_Delegate();
};


// Class TgClient.TgRewardCenterManager
// 0x0018 (0x0078 - 0x0060)
class UTgRewardCenterManager : public UObject
{
public:
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x0060(0x0008)
	TArray<struct FGoalRewardItem>                     m_pReturningBonus;                                        // 0x0068(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgRewardCenterManager");
		return ptr;
	}


	void STATIC_Initialize(class UUIGameMoviePlayer* pMoviePlayer);
};


// Class TgClient.TgStreamManager
// 0x0070 (0x00D0 - 0x0060)
class UTgStreamManager : public UObject
{
public:
	struct FString                                     WatchEnd;                                                 // 0x0060(0x0010) (NeedCtorLink)
	struct FString                                     m_CurrentChannel;                                         // 0x0070(0x0010) (NeedCtorLink)
	int                                                m_nNewsIndex;                                             // 0x0080(0x0004)
	TArray<struct FGameStream>                         Streams;                                                  // 0x0084(0x0010) (NeedCtorLink)
	unsigned long                                      m_hasReceivedStreams : 1;                                 // 0x0094(0x0004)
	unsigned long                                      m_hasAnySpecial : 1;                                      // 0x0094(0x0004)
	unsigned long                                      m_hasAnyFeatured : 1;                                     // 0x0094(0x0004)
	class UUIGameMoviePlayer*                          m_Movie;                                                  // 0x0098(0x0008)
	struct FScriptDelegate                             __ViewerSort__Delegate;                                   // 0x00A0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __FeaturedSort__Delegate;                                 // 0x00B0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00B0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __LiveSort__Delegate;                                     // 0x00C0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00C0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgStreamManager");
		return ptr;
	}


	struct FString GetFeatureDescription(int Count);
	struct FString GetFeatureName(int Count);
	bool HaveFeature();
	bool IsLiveAtIndex(int Index);
	struct FString GetDescriptionAtIndex(int Index);
	struct FString GetViewersAtIndex(int Index);
	struct FString GetTitleAtIndex(int Index);
	bool IsStream(int Index);
	int GetTypeCountWatching(TEnumAsByte<ESTREAMTYPE> Type);
	int GetTypeCount(TEnumAsByte<ESTREAMTYPE> Type);
	int LiveSort(const struct FGameStream& A, const struct FGameStream& B);
	int FeaturedSort(const struct FGameStream& A, const struct FGameStream& B);
	int ViewerSort(const struct FGameStream& A, const struct FGameStream& B);
	void ResolveChannelName(const struct FString& sChannel);
	void CompleteUpdate();
	bool ViewStreamIndex(int surfaceId, int Index, bool external, float X, float Y, float Width, float Height, float widthReal, float heightReal, bool joinChat);
	bool HasSpecialStreams();
	bool OpenPlayerStream(int nPlayerId, bool external, float X, float Y, float Width, float Height, float widthReal, float heightReal);
	bool OpenStream(int surfaceId, const struct FString& URL, bool external, float X, float Y, float Width, float Height, float widthReal, float heightReal, bool joinChat);
	void LoadStreams();
};


// Class TgClient.TgSynchronizedTimer
// 0x0014 (0x0118 - 0x0104)
class UTgSynchronizedTimer : public UGFxObject
{
public:
	unsigned long                                      m_bPausedByGame : 1;                                      // 0x0104(0x0004)
	unsigned long                                      m_bSuppressCallback : 1;                                  // 0x0104(0x0004)
	unsigned long                                      m_bRunning : 1;                                           // 0x0104(0x0004)
	unsigned long                                      m_bPaused : 1;                                            // 0x0104(0x0004)
	class UUIMoviePlayer*                              m_MP;                                                     // 0x0108(0x0008)
	class UTgTimerManager*                             m_TimerManager;                                           // 0x0110(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgSynchronizedTimer");
		return ptr;
	}


	bool IsPaused();
	bool IsRunning();
	void EventCallback(int nTimerId, TEnumAsByte<ETGT_EVENT> eEvent);
	void ExpireTimer(bool bFromCallback);
	void UpdateTimer(float fElapsed, float fTotal, bool bPaused, bool bFromCallback);
	void StartTimer(float fSeconds);
};


// Class TgClient.UIDataShop
// 0x01DC (0x023C - 0x0060)
class UUIDataShop : public UObject
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0060(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_LootTableItems
	unsigned char                                      UnknownData01[0x48];                                      // 0x00A8(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_Vendors
	unsigned char                                      UnknownData02[0x48];                                      // 0x00F0(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_DLCItems
	unsigned char                                      UnknownData03[0x48];                                      // 0x0138(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_Items
	unsigned char                                      UnknownData04[0x48];                                      // 0x0180(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_SKUtoLootId
	TArray<struct Fdword>                              m_dwHiddenLTIs;                                           // 0x01C8(0x0010) (NeedCtorLink)
	TArray<struct FMarketplaceProductDetails>          m_MarketplaceProducts;                                    // 0x01D8(0x0010) (NeedCtorLink)
	TArray<struct Fdword>                              m_dwContinuousRequestVendors;                             // 0x01E8(0x0010) (NeedCtorLink)
	float                                              m_fContinuousRequestTimer;                                // 0x01F8(0x0004)
	TArray<struct Fdword>                              m_dwInfoVendors;                                          // 0x01FC(0x0010) (NeedCtorLink)
	TArray<struct Fdword>                              m_dwStoreVendors;                                         // 0x020C(0x0010) (NeedCtorLink)
	TArray<struct Fdword>                              m_dwDLCVendors;                                           // 0x021C(0x0010) (NeedCtorLink)
	unsigned long                                      m_bAllStoreVendorsLoaded : 1;                             // 0x022C(0x0004)
	unsigned long                                      m_bFinishedStoringDLCItemData : 1;                        // 0x022C(0x0004)
	struct Fdword                                      m_dwVendorRequestId;                                      // 0x0230(0x0004)
	struct Fdword                                      m_dwContinuousVendorsRequestId;                           // 0x0234(0x0004)
	struct Fdword                                      m_dwDLCVendorsRequestId;                                  // 0x0238(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataShop");
		return ptr;
	}


	TEnumAsByte<EOnlineEnumerationReadState> GetMarketplaceProductsByType(class UUIGameMoviePlayer* pMoviePlayer, TEnumAsByte<EMediaItemType> MediaType, TArray<struct FMarketplaceProductDetails>* AvailableProducts);
	void StoreDLCItemData();
};


// Class TgClient.UIHudSpectator
// 0x0070 (0x0174 - 0x0104)
class UUIHudSpectator : public UGFxObject
{
public:
	int                                                m_nIterations;                                            // 0x0104(0x0004)
	int                                                m_BannedIds[0x6];                                         // 0x0108(0x0004)
	unsigned long                                      m_bFindMatchDetails : 1;                                  // 0x0120(0x0004)
	float                                              m_fUpdateWaitRT;                                          // 0x0124(0x0004)
	float                                              m_fUpdateWaitGT;                                          // 0x0128(0x0004)
	class UGFxObject*                                  _global;                                                  // 0x012C(0x0008)
	struct FBotLifeData                                m_BotLifeData[0x2];                                       // 0x0134(0x001C) (NeedCtorLink)
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x016C(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIHudSpectator");
		return ptr;
	}


	void SendGraphData(class UGFxObject* Obj);
	void UpdateGraph();
	void STATIC_Initialize(class UUIGameMoviePlayer* pParentMovie);
};


// Class TgClient.UILandingPanelManager
// 0x0080 (0x0104 - 0x0084)
class UUILandingPanelManager : public UPComUIManagerBase
{
public:
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x0084(0x0008)
	unsigned char                                      UnknownData00[0x48];                                      // 0x008C(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UILandingPanelManager.m_JsonDiscountData
	TArray<struct FJsonHomeFeatureData>                m_JsonHomeFeatures;                                       // 0x00D4(0x0010) (NeedCtorLink)
	TArray<int>                                        m_nHotSkinIDs;                                            // 0x00E4(0x0010) (NeedCtorLink)
	TArray<int>                                        m_nNewSkinIDs;                                            // 0x00F4(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UILandingPanelManager");
		return ptr;
	}

};


// Class TgClient.UIMoviePlayer
// 0x00A8 (0x02A0 - 0x01F8)
class UUIMoviePlayer : public UGFxMoviePlayer
{
public:
	int                                                m_nLastTimerIndex;                                        // 0x01F8(0x0004)
	unsigned long                                      m_bInitialized : 1;                                       // 0x01FC(0x0004)
	unsigned long                                      m_bInTransition : 1;                                      // 0x01FC(0x0004)
	unsigned long                                      m_bResizeForSafeZones : 1;                                // 0x01FC(0x0004)
	class UGFxObject*                                  m_mcRoot;                                                 // 0x0200(0x0008)
	class UGFxObject*                                  m_mcGlobal;                                               // 0x0208(0x0008)
	class UTgDataHandler*                              m_DataHandler;                                            // 0x0210(0x0008)
	class UTgTimerManager*                             m_TimerManager;                                           // 0x0218(0x0008)
	class UClass*                                      m_DataHandlerClass;                                       // 0x0220(0x0008)
	struct FPointer                                    m_pTgCallbackDevice;                                      // 0x0228(0x0008) (Native)
	struct FPointer                                    m_pKeybindLookup;                                         // 0x0230(0x0008) (Native)
	class UOnlineSubsystem*                            OnlineSub;                                                // 0x0238(0x0008)
	TScriptInterface<class UOnlineGameInterface>       GameInterface;                                            // 0x0240(0x0010)
	TScriptInterface<class UOnlineVoiceInterface>      VoiceInterface;                                           // 0x0250(0x0010)
	TScriptInterface<class UOnlinePlayerInterface>     PlayerInterface;                                          // 0x0260(0x0010)
	TScriptInterface<class UOnlineContentInterface>    ContentInterface;                                         // 0x0270(0x0010)
	TScriptInterface<class UOnlinePlayerInterfaceEx>   PlayerInterfaceEx;                                        // 0x0280(0x0010)
	TScriptInterface<class UOnlineMarketplaceInterface> MarketplaceInterface;                                     // 0x0290(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIMoviePlayer");
		return ptr;
	}


	void SetMarketplaceVisibility(bool Visible, unsigned char IconPosition);
	void usc_ClipboardCopy(const struct FString& Str);
	struct FString usc_ClipboardPaste();
	void InitOSSRef();
	void Init(class ULocalPlayer* LocPlay);
	bool usc_IME_Exists();
	bool usc_IME_SetEnabled(bool bEnabled);
	struct FString usc_TranslateMsg(const struct FString& Identifier, const struct FString& SectionName);
	struct FString usc_TranslateMsgId(int nId);
	void ShowTransitionScene(bool bShow);
	void usc_toggle_key_capture(bool bCapture);
	void usc_toggle_cursor(bool bShow);
	void usc_Console_Command(const struct FString& Cmd);
	void usc_Data_Handler_Created();
	void QuitGame();
	void STATIC_UnregisterEngineCallbacks();
	void STATIC_RegisterEngineCallbacks();
	struct FString GetTranslatedKeyBind(const struct FString& Command, int nAlternate, bool bLocalizeKB, bool bLocalizeMouse, bool bLocalizeGamepad);
	void UpdateViewportForSafeAreas();
	void NativeTick(float DeltaTime);
	void InitializeDataHandler();
	void PostInit();
	void OnClose();
	class ATgPlayerController* STATIC_GetPlayerOwner();
	class ATgClientHUD* GetHUD();
};


// Class TgClient.TgDevMenuMoviePlayer
// 0x0008 (0x02A8 - 0x02A0)
class UTgDevMenuMoviePlayer : public UUIMoviePlayer
{
public:
	class UGFxObject*                                  m_DevMenu;                                                // 0x02A0(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDevMenuMoviePlayer");
		return ptr;
	}


	bool FilterButtonInput(int ControllerId, const struct FName& ButtonName, TEnumAsByte<EInputEvent> Event);
	void OnClose();
	void PostInit();
	void usc_FillCommands(const struct FString& MenuName);
	void AddSubMenu(const struct FString& Section, const struct FString& submenuname, const struct FString& DisplayName);
	void AddCommand(const struct FString& Section, const struct FString& Command, const struct FString& DisplayName);
	void FillSubMenuCommands(const struct FString& submenuname);
	void FillMenuCommands();
};


// Class TgClient.UIGAPeachStartup
// 0x0010 (0x02B0 - 0x02A0)
class UUIGAPeachStartup : public UUIMoviePlayer
{
public:
	float                                              m_fHirezAnimTimer;                                        // 0x02A0(0x0004)
	float                                              m_fPeachAnimTimer;                                        // 0x02A4(0x0004)
	float                                              m_fSkipDelay;                                             // 0x02A8(0x0004)
	float                                              m_fSkipDelayTimer;                                        // 0x02AC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIGAPeachStartup");
		return ptr;
	}


	void OnClose();
	void PostInit();
	void UpdateViewportForSafeAreas();
};


// Class TgClient.UINotificationCenterJsonManager
// 0x0018 (0x009C - 0x0084)
class UUINotificationCenterJsonManager : public UPComUIManagerBase
{
public:
	TArray<struct FTabInfo>                            m_WebPanelUrls;                                           // 0x0084(0x0010) (NeedCtorLink)
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x0094(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UINotificationCenterJsonManager");
		return ptr;
	}

};


// Class TgClient.UIObject
// 0x0000 (0x0104 - 0x0104)
class UUIObject : public UGFxObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIObject");
		return ptr;
	}

};


// Class TgClient.UIPatchNotesJsonManager
// 0x0018 (0x009C - 0x0084)
class UUIPatchNotesJsonManager : public UPComUIManagerBase
{
public:
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x0084(0x0008)
	TArray<struct FPatchNotesData>                     m_PatchData;                                              // 0x008C(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPatchNotesJsonManager");
		return ptr;
	}

};


// Class TgClient.UIData
// 0x0004 (0x0064 - 0x0060)
class UUIData : public UObject
{
public:
	int                                                m_nPriority;                                              // 0x0060(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData");
		return ptr;
	}

};


// Class TgClient.TgDataObject
// 0x005C (0x00C0 - 0x0064)
class UTgDataObject : public UUIData
{
public:
	unsigned long                                      m_bDirty : 1;                                             // 0x0064(0x0004)
	unsigned long                                      m_bCallback : 1;                                          // 0x0064(0x0004)
	TArray<TEnumAsByte<EUIID>>                         m_Laundry;                                                // 0x0068(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x48];                                      // 0x0078(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.TgDataObject.m_Data

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataObject");
		return ptr;
	}

};


// Class TgClient.TgData_EOM
// 0x012C (0x01EC - 0x00C0)
class UTgData_EOM : public UTgDataObject
{
public:
	int                                                m_nGameId;                                                // 0x00C0(0x0004)
	int                                                m_nQueueId;                                               // 0x00C4(0x0004)
	int                                                m_nClassId;                                               // 0x00C8(0x0004)
	int                                                m_nGameTime;                                              // 0x00CC(0x0004)
	int                                                m_nLocalTF;                                               // 0x00D0(0x0004)
	int                                                m_nWinningTF;                                             // 0x00D4(0x0004)
	unsigned long                                      m_bVictory : 1;                                           // 0x00D8(0x0004)
	unsigned long                                      m_bIsSpectator : 1;                                       // 0x00D8(0x0004)
	int                                                m_nMapGameId;                                             // 0x00DC(0x0004)
	int                                                m_nXPEarned;                                              // 0x00E0(0x0004)
	int                                                m_nMasteryEarned;                                         // 0x00E4(0x0004)
	int                                                m_nGoldEarned;                                            // 0x00E8(0x0004)
	int                                                m_nVIPEarned;                                             // 0x00EC(0x0004)
	int                                                m_nVIPMemberEarned;                                       // 0x00F0(0x0004)
	int                                                m_nBattlePassBase;                                        // 0x00F4(0x0004)
	int                                                m_nBattlePassEarned;                                      // 0x00F8(0x0004)
	int                                                m_fBattlePassMultiplier;                                  // 0x00FC(0x0004)
	int                                                m_nEventCurrencyEarned;                                   // 0x0100(0x0004)
	int                                                m_nEventCurrencyEarnedLootId;                             // 0x0104(0x0004)
	float                                              m_fXPMultiplier;                                          // 0x0108(0x0004)
	float                                              m_fMasteryMultiplier;                                     // 0x010C(0x0004)
	float                                              m_fGoldMultiplier;                                        // 0x0110(0x0004)
	float                                              m_fVIPMultiplier;                                         // 0x0114(0x0004)
	int                                                m_nXPAccountBoost;                                        // 0x0118(0x0004)
	int                                                m_nMasteryAccountBoost;                                   // 0x011C(0x0004)
	int                                                m_nGoldAccountBoost;                                      // 0x0120(0x0004)
	int                                                m_nXPPartyBoost;                                          // 0x0124(0x0004)
	int                                                m_nMasteryPartyBoost;                                     // 0x0128(0x0004)
	int                                                m_nGoldPartyBoost;                                        // 0x012C(0x0004)
	int                                                m_nVIPPartyBoost;                                         // 0x0130(0x0004)
	int                                                m_nXPTeamBoost;                                           // 0x0134(0x0004)
	int                                                m_nMasteryTeamBoost;                                      // 0x0138(0x0004)
	int                                                m_nGoldTeamBoost;                                         // 0x013C(0x0004)
	int                                                m_nVIPTeamBoost;                                          // 0x0140(0x0004)
	int                                                m_nXPSkinBoost;                                           // 0x0144(0x0004)
	int                                                m_nMasterySkinBoost;                                      // 0x0148(0x0004)
	int                                                m_nGoldSkinBoost;                                         // 0x014C(0x0004)
	int                                                m_nVIPSkinBoost;                                          // 0x0150(0x0004)
	int                                                m_nNumSkinBoosters;                                       // 0x0154(0x0004)
	int                                                m_nXPVIPTierBoost;                                        // 0x0158(0x0004)
	int                                                m_nMasteryVIPTierBoost;                                   // 0x015C(0x0004)
	int                                                m_nGoldVIPTierBoost;                                      // 0x0160(0x0004)
	int                                                m_nVIPVIPTierBoost;                                       // 0x0164(0x0004)
	int                                                m_nXPBonus;                                               // 0x0168(0x0004)
	int                                                m_nGoldBonus;                                             // 0x016C(0x0004)
	int                                                m_nGoldAccolades;                                         // 0x0170(0x0004)
	int                                                m_nXPPaying;                                              // 0x0174(0x0004)
	struct Fdword                                      m_dwGoldKills;                                            // 0x0178(0x0004)
	TArray<class UUIData_PlayerMatchRecord*>           m_Players;                                                // 0x017C(0x0010) (NeedCtorLink)
	TArray<struct FUIMVPDATA>                          m_MVPs;                                                   // 0x018C(0x0010) (NeedCtorLink)
	TArray<struct FAccoladeData>                       m_Accolades;                                              // 0x019C(0x0010) (NeedCtorLink)
	TArray<struct FCurrencyEntry>                      m_vCurrencyEntries;                                       // 0x01AC(0x0010) (NeedCtorLink)
	struct FCurrencyEntry                              m_NullCurrency;                                           // 0x01BC(0x0030) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgData_EOM");
		return ptr;
	}

};


// Class TgClient.TgData_Notifications
// 0x0010 (0x00D0 - 0x00C0)
class UTgData_Notifications : public UTgDataObject
{
public:
	TArray<class UUIData_Notification*>                m_Notifications;                                          // 0x00C0(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgData_Notifications");
		return ptr;
	}

};


// Class TgClient.UIData_Accolade
// 0x000C (0x0070 - 0x0064)
class UUIData_Accolade : public UUIData
{
public:
	int                                                m_nIconFrame;                                             // 0x0064(0x0004)
	int                                                m_nValue;                                                 // 0x0068(0x0004)
	int                                                m_nTitleId;                                               // 0x006C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Accolade");
		return ptr;
	}

};


// Class TgClient.UIData_BattlePassLevel
// 0x0010 (0x0074 - 0x0064)
class UUIData_BattlePassLevel : public UUIData
{
public:
	int                                                m_nLevel;                                                 // 0x0064(0x0004)
	class UUIData_LootTableItem*                       m_pLTI;                                                   // 0x0068(0x0008)
	unsigned long                                      m_bUnlocked : 1;                                          // 0x0070(0x0004)
	unsigned long                                      m_bPremium : 1;                                           // 0x0070(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_BattlePassLevel");
		return ptr;
	}

};


// Class TgClient.UIData_BattlePassTier
// 0x001C (0x0080 - 0x0064)
class UUIData_BattlePassTier : public UUIData
{
public:
	int                                                m_nTier;                                                  // 0x0064(0x0004)
	struct Fdword                                      m_dwPlayerBPXP;                                           // 0x0068(0x0004)
	TArray<class UUIData*>                             m_pLevelRewards;                                          // 0x006C(0x0010) (NeedCtorLink)
	unsigned long                                      m_bHasBonusRewards : 1;                                   // 0x007C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_BattlePassTier");
		return ptr;
	}

};


// Class TgClient.UIData_BountySaleItem
// 0x0038 (0x009C - 0x0064)
class UUIData_BountySaleItem : public UUIData
{
public:
	class UUIData_LootTableItem*                       m_pLootTableItem;                                         // 0x0064(0x0008)
	int                                                m_nSaleIndex;                                             // 0x006C(0x0004)
	struct Fdword                                      m_dwCurrentPrice;                                         // 0x0070(0x0004)
