#pragma once

// Paladins (3.05) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PL_TgGame_structs.hpp"

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class TgGame.AlienFXManager
// 0x185BB49E870
class AlienFXManager
{
public:
	unsigned char                                      UnknownData00[0x185BB49E870];                             // 0x0000(0x185BB49E870) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.AlienFXManager");
		return ptr;
	}

};


// Class TgGame.TgAIDirector
// 0x185B85A1210
class TgAIDirector
{
public:
	unsigned char                                      UnknownData00[0x185B85A1210];                             // 0x0000(0x185B85A1210) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAIDirector");
		return ptr;
	}

};


// Class TgGame.TgAimAccelerationCurves
// 0x185BA82F5A0
class TgAimAccelerationCurves
{
public:
	unsigned char                                      UnknownData00[0x185BA82F5A0];                             // 0x0000(0x185BA82F5A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAimAccelerationCurves");
		return ptr;
	}

};


// Class TgGame.TgAimAssistKeyframe
// 0x185B48CEF30
class TgAimAssistKeyframe
{
public:
	unsigned char                                      UnknownData00[0x185B48CEF30];                             // 0x0000(0x185B48CEF30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAimAssistKeyframe");
		return ptr;
	}

};


// Class TgGame.TgAITaskforceBlockingVolume
// 0x185B85A58F0
class TgAITaskforceBlockingVolume
{
public:
	unsigned char                                      UnknownData00[0x185B85A58F0];                             // 0x0000(0x185B85A58F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAITaskforceBlockingVolume");
		return ptr;
	}

};


// Class TgGame.TgAIVolume
// 0x185B85A6790
class TgAIVolume
{
public:
	unsigned char                                      UnknownData00[0x185B85A6790];                             // 0x0000(0x185B85A6790) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAIVolume");
		return ptr;
	}

};


// Class TgGame.TgAkActor
// 0x185B85A4390
class TgAkActor
{
public:
	unsigned char                                      UnknownData00[0x185B85A4390];                             // 0x0000(0x185B85A4390) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAkActor");
		return ptr;
	}

};


// Class TgGame.TgAkActorUnoccluded
// 0x0000
class TgAkActorUnoccluded
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAkActorUnoccluded");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByVerticalAim
// 0x185BBD27400
class TgAnimNodeBlendByVerticalAim
{
public:
	unsigned char                                      UnknownData00[0x185BBD27400];                             // 0x0000(0x185BBD27400) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByVerticalAim");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_CameraCut
// 0x185BBA7FF40
class TgAnimNotify_CameraCut
{
public:
	unsigned char                                      UnknownData00[0x185BBA7FF40];                             // 0x0000(0x185BBA7FF40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_CameraCut");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_Disappear
// 0x0000
class TgAnimNotify_Disappear
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_Disappear");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_SpectatorSlomo
// 0x0000
class TgAnimNotify_SpectatorSlomo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_SpectatorSlomo");
		return ptr;
	}

};


// Class TgGame.TgPlayerController
// 0x185B4D6D020
class TgPlayerController
{
public:
	unsigned char                                      UnknownData00[0x185B4D6D020];                             // 0x0000(0x185B4D6D020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPlayerController");
		return ptr;
	}

};


// Class TgGame.TgBattleCheatManager
// 0x185BBD457C0
class TgBattleCheatManager
{
public:
	unsigned char                                      UnknownData00[0x185BBD457C0];                             // 0x0000(0x185BBD457C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgBattleCheatManager");
		return ptr;
	}

};


// Class TgGame.TgCharacterBuilderLight
// 0x0000
class TgCharacterBuilderLight
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCharacterBuilderLight");
		return ptr;
	}

};


// Class TgGame.TgClientSettings
// 0x185B85B5070
class TgClientSettings
{
public:
	unsigned char                                      UnknownData00[0x185B85B5070];                             // 0x0000(0x185B85B5070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgClientSettings");
		return ptr;
	}

};


// Class TgGame.TgCollisionProxy
// 0x185B50246E0
class TgCollisionProxy
{
public:
	unsigned char                                      UnknownData00[0x185B50246E0];                             // 0x0000(0x185B50246E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCollisionProxy");
		return ptr;
	}

};


// Class TgGame.TgCollisionProxy_Capture
// 0x185B5E90420
class TgCollisionProxy_Capture
{
public:
	unsigned char                                      UnknownData00[0x185B5E90420];                             // 0x0000(0x185B5E90420) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCollisionProxy_Capture");
		return ptr;
	}

};


// Class TgGame.TgCollisionProxy_Cylinder
// 0x185C0A29C90
class TgCollisionProxy_Cylinder
{
public:
	unsigned char                                      UnknownData00[0x185C0A29C90];                             // 0x0000(0x185C0A29C90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCollisionProxy_Cylinder");
		return ptr;
	}

};


// Class TgGame.TgCollisionProxy_SpectatorActionListener
// 0x185B5022520
class TgCollisionProxy_SpectatorActionListener
{
public:
	unsigned char                                      UnknownData00[0x185B5022520];                             // 0x0000(0x185B5022520) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCollisionProxy_SpectatorActionListener");
		return ptr;
	}

};


// Class TgGame.TgCollisionProxy_Mesh
// 0x185B5024380
class TgCollisionProxy_Mesh
{
public:
	unsigned char                                      UnknownData00[0x185B5024380];                             // 0x0000(0x185B5024380) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCollisionProxy_Mesh");
		return ptr;
	}

};


// Class TgGame.TgCollisionProxy_Objective
// 0x0000
class TgCollisionProxy_Objective
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCollisionProxy_Objective");
		return ptr;
	}

};


// Class TgGame.TgCollisionProxy_Vortex
// 0x185B5021F80
class TgCollisionProxy_Vortex
{
public:
	unsigned char                                      UnknownData00[0x185B5021F80];                             // 0x0000(0x185B5021F80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCollisionProxy_Vortex");
		return ptr;
	}

};


// Class TgGame.TgCombinedPostProcessEffect
// 0x185B94D2280
class TgCombinedPostProcessEffect
{
public:
	unsigned char                                      UnknownData00[0x185B94D2280];                             // 0x0000(0x185B94D2280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCombinedPostProcessEffect");
		return ptr;
	}

};


// Class TgGame.TgCustomCharacterComponent
// 0x185B8590410
class TgCustomCharacterComponent
{
public:
	unsigned char                                      UnknownData00[0x185B8590410];                             // 0x0000(0x185B8590410) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCustomCharacterComponent");
		return ptr;
	}

};


// Class TgGame.TgDamageType
// 0x185BD263730
class TgDamageType
{
public:
	unsigned char                                      UnknownData00[0x185BD263730];                             // 0x0000(0x185BD263730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType");
		return ptr;
	}

};


// Class TgGame.TgDamageType_AbilityCost
// 0x0000
class TgDamageType_AbilityCost
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_AbilityCost");
		return ptr;
	}

};


// Class TgGame.TgDamageType_IgnoreShields
// 0x0000
class TgDamageType_IgnoreShields
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_IgnoreShields");
		return ptr;
	}

};


// Class TgGame.TgDamageType_Latent
// 0x0000
class TgDamageType_Latent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_Latent");
		return ptr;
	}

};


// Class TgGame.TgDamageType_NoRagdoll
// 0x0000
class TgDamageType_NoRagdoll
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_NoRagdoll");
		return ptr;
	}

};


// Class TgGame.TgDamageType_BattleByteWeaponSkin
// 0x0000
class TgDamageType_BattleByteWeaponSkin
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_BattleByteWeaponSkin");
		return ptr;
	}

};


// Class TgGame.TgDamageType_GoldenWeaponSkin
// 0x0000
class TgDamageType_GoldenWeaponSkin
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_GoldenWeaponSkin");
		return ptr;
	}

};


// Class TgGame.TgDamageType_LegendaryWeaponSkin
// 0x0000
class TgDamageType_LegendaryWeaponSkin
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_LegendaryWeaponSkin");
		return ptr;
	}

};


// Class TgGame.TgDamageType_PaladinsExecute
// 0x0000
class TgDamageType_PaladinsExecute
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_PaladinsExecute");
		return ptr;
	}

};


// Class TgGame.TgDamageType_PaladinsRoyaleFog
// 0x0000
class TgDamageType_PaladinsRoyaleFog
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_PaladinsRoyaleFog");
		return ptr;
	}

};


// Class TgGame.TgDamageType_PaladinsSniper
// 0x0000
class TgDamageType_PaladinsSniper
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDamageType_PaladinsSniper");
		return ptr;
	}

};


// Class TgGame.TgDestructible
// 0x185BBB80C30
class TgDestructible
{
public:
	unsigned char                                      UnknownData00[0x185BBB80C30];                             // 0x0000(0x185BBB80C30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDestructible");
		return ptr;
	}

};


// Class TgGame.TgRespawnBeaconBase
// 0x185B61D51C0
class TgRespawnBeaconBase
{
public:
	unsigned char                                      UnknownData00[0x185B61D51C0];                             // 0x0000(0x185B61D51C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgRespawnBeaconBase");
		return ptr;
	}

};


// Class TgGame.TgRespawnBeaconEntrance
// 0x185B61D3B40
class TgRespawnBeaconEntrance
{
public:
	unsigned char                                      UnknownData00[0x185B61D3B40];                             // 0x0000(0x185B61D3B40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgRespawnBeaconEntrance");
		return ptr;
	}

};


// Class TgGame.TgRespawnBeaconExit
// 0x185B61D8FA0
class TgRespawnBeaconExit
{
public:
	unsigned char                                      UnknownData00[0x185B61D8FA0];                             // 0x0000(0x185B61D8FA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgRespawnBeaconExit");
		return ptr;
	}

};


// Class TgGame.TgDeviceInterface_DismountModifier
// 0x185B5959590
class TgDeviceInterface_DismountModifier
{
public:
	unsigned char                                      UnknownData00[0x185B5959590];                             // 0x0000(0x185B5959590) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceInterface_DismountModifier");
		return ptr;
	}

};


// Class TgGame.TgDistributionFloatLitParticleBrightness
// 0x0000
class TgDistributionFloatLitParticleBrightness
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDistributionFloatLitParticleBrightness");
		return ptr;
	}

};


// Class TgGame.TgDistributionFloatSoundAttenuation
// 0x185B595FAD0
class TgDistributionFloatSoundAttenuation
{
public:
	unsigned char                                      UnknownData00[0x185B595FAD0];                             // 0x0000(0x185B595FAD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDistributionFloatSoundAttenuation");
		return ptr;
	}

};


// Class TgGame.TgExplosionLight
// 0x185B481ED30
class TgExplosionLight
{
public:
	unsigned char                                      UnknownData00[0x185B481ED30];                             // 0x0000(0x185B481ED30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgExplosionLight");
		return ptr;
	}

};


// Class TgGame.TgFatalityMeshActor
// 0x185B4823E30
class TgFatalityMeshActor
{
public:
	unsigned char                                      UnknownData00[0x185B4823E30];                             // 0x0000(0x185B4823E30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgFatalityMeshActor");
		return ptr;
	}

};


// Class TgGame.TgFlagContentData
// 0x185B482FFB0
class TgFlagContentData
{
public:
	unsigned char                                      UnknownData00[0x185B482FFB0];                             // 0x0000(0x185B482FFB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgFlagContentData");
		return ptr;
	}

};


// Class TgGame.TgFogOfWarBarrier
// 0x185B60C1FE0
class TgFogOfWarBarrier
{
public:
	unsigned char                                      UnknownData00[0x185B60C1FE0];                             // 0x0000(0x185B60C1FE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgFogOfWarBarrier");
		return ptr;
	}

};


// Class TgGame.TgFortressVolume
// 0x185B4832CB0
class TgFortressVolume
{
public:
	unsigned char                                      UnknownData00[0x185B4832CB0];                             // 0x0000(0x185B4832CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgFortressVolume");
		return ptr;
	}

};


// Class TgGame.TgGameEngine
// 0x0000
class TgGameEngine
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgGameEngine");
		return ptr;
	}

};


// Class TgGame.TgHUD
// 0x185B5044480
class TgHUD
{
public:
	unsigned char                                      UnknownData00[0x185B5044480];                             // 0x0000(0x185B5044480) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgHUD");
		return ptr;
	}

};


// Class TgGame.TgInterface_YingIllusion
// 0x185BC78A0A0
class TgInterface_YingIllusion
{
public:
	unsigned char                                      UnknownData00[0x185BC78A0A0];                             // 0x0000(0x185BC78A0A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInterface_YingIllusion");
		return ptr;
	}

};


// Class TgGame.TgKActorSpawnable
// 0x0000
class TgKActorSpawnable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgKActorSpawnable");
		return ptr;
	}

};


// Class TgGame.TgKAsset_ClientSideSim
// 0x185BC78D8E0
class TgKAsset_ClientSideSim
{
public:
	unsigned char                                      UnknownData00[0x185BC78D8E0];                             // 0x0000(0x185BC78D8E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgKAsset_ClientSideSim");
		return ptr;
	}

};


// Class TgGame.TgKAssetSpawnable
// 0x0000
class TgKAssetSpawnable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgKAssetSpawnable");
		return ptr;
	}

};


// Class TgGame.TgLevelStreamingSpectator
// 0x185B63605C0
class TgLevelStreamingSpectator
{
public:
	unsigned char                                      UnknownData00[0x185B63605C0];                             // 0x0000(0x185B63605C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgLevelStreamingSpectator");
		return ptr;
	}

};


// Class TgGame.TgLevelStreamingWorldDetail
// 0x185B63617C0
class TgLevelStreamingWorldDetail
{
public:
	unsigned char                                      UnknownData00[0x185B63617C0];                             // 0x0000(0x185B63617C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgLevelStreamingWorldDetail");
		return ptr;
	}

};


// Class TgGame.TgLocalPlayer
// 0x185BC790EE0
class TgLocalPlayer
{
public:
	unsigned char                                      UnknownData00[0x185BC790EE0];                             // 0x0000(0x185BC790EE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgLocalPlayer");
		return ptr;
	}

};


// Class TgGame.TgManifestGroup
// 0x185BB4B2370
class TgManifestGroup
{
public:
	unsigned char                                      UnknownData00[0x185BB4B2370];                             // 0x0000(0x185BB4B2370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgManifestGroup");
		return ptr;
	}

};


// Class TgGame.TgMapInfo
// 0x185BBB47CF0
class TgMapInfo
{
public:
	unsigned char                                      UnknownData00[0x185BBB47CF0];                             // 0x0000(0x185BBB47CF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgMapInfo");
		return ptr;
	}

};


// Class TgGame.TgMarkComponent
// 0x185BC794A80
class TgMarkComponent
{
public:
	unsigned char                                      UnknownData00[0x185BC794A80];                             // 0x0000(0x185BC794A80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgMarkComponent");
		return ptr;
	}

};


// Class TgGame.TgMenuContentData
// 0x185BC793640
class TgMenuContentData
{
public:
	unsigned char                                      UnknownData00[0x185BC793640];                             // 0x0000(0x185BC793640) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgMenuContentData");
		return ptr;
	}

};


// Class TgGame.TgMenuMeshInfo
// 0x185BC792E60
class TgMenuMeshInfo
{
public:
	unsigned char                                      UnknownData00[0x185BC792E60];                             // 0x0000(0x185BC792E60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgMenuMeshInfo");
		return ptr;
	}

};


// Class TgGame.TgMenuTransitionActor
// 0x185BC795920
class TgMenuTransitionActor
{
public:
	unsigned char                                      UnknownData00[0x185BC795920];                             // 0x0000(0x185BC795920) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgMenuTransitionActor");
		return ptr;
	}

};


// Class TgGame.TgMeshAssembly
// 0x185B59602B0
class TgMeshAssembly
{
public:
	unsigned char                                      UnknownData00[0x185B59602B0];                             // 0x0000(0x185B59602B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgMeshAssembly");
		return ptr;
	}

};


// Class TgGame.TgNamedPOIActor
// 0x185BC7966A0
class TgNamedPOIActor
{
public:
	unsigned char                                      UnknownData00[0x185BC7966A0];                             // 0x0000(0x185BC7966A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgNamedPOIActor");
		return ptr;
	}

};


// Class TgGame.TgNewUserSettings
// 0x185BA54C280
class TgNewUserSettings
{
public:
	unsigned char                                      UnknownData00[0x185BA54C280];                             // 0x0000(0x185BA54C280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgNewUserSettings");
		return ptr;
	}

};


// Class TgGame.TgObject
// 0x185BB4A46F0
class TgObject
{
public:
	unsigned char                                      UnknownData00[0x185BB4A46F0];                             // 0x0000(0x185BB4A46F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgObject");
		return ptr;
	}

};


// Class TgGame.TgObjectReferencer
// 0x185BA54D780
class TgObjectReferencer
{
public:
	unsigned char                                      UnknownData00[0x185BA54D780];                             // 0x0000(0x185BA54D780) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgObjectReferencer");
		return ptr;
	}

};


// Class TgGame.TgParticleSystemComponent
// 0x185BA54B380
class TgParticleSystemComponent
{
public:
	unsigned char                                      UnknownData00[0x185BA54B380];                             // 0x0000(0x185BA54B380) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgParticleSystemComponent");
		return ptr;
	}

};


// Class TgGame.TgProperty
// 0x185B61CA480
class TgProperty
{
public:
	unsigned char                                      UnknownData00[0x185B61CA480];                             // 0x0000(0x185B61CA480) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgProperty");
		return ptr;
	}

};


// Class TgGame.TgRecoilKeyframe
// 0x185B6344480
class TgRecoilKeyframe
{
public:
	unsigned char                                      UnknownData00[0x185B6344480];                             // 0x0000(0x185B6344480) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgRecoilKeyframe");
		return ptr;
	}

};


// Class TgGame.TgSavedMove
// 0x185B61D91E0
class TgSavedMove
{
public:
	unsigned char                                      UnknownData00[0x185B61D91E0];                             // 0x0000(0x185B61D91E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSavedMove");
		return ptr;
	}

};


// Class TgGame.TgScreenCapturePostEffect
// 0x185B61D9300
class TgScreenCapturePostEffect
{
public:
	unsigned char                                      UnknownData00[0x185B61D9300];                             // 0x0000(0x185B61D9300) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgScreenCapturePostEffect");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_BotDied
// 0x185BCD10B50
class TgSeqEvent_BotDied
{
public:
	unsigned char                                      UnknownData00[0x185BCD10B50];                             // 0x0000(0x185BCD10B50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_BotDied");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_BotSpawned
// 0x0000
class TgSeqEvent_BotSpawned
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_BotSpawned");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_BurnCardPurchased
// 0x185BBB527F0
class TgSeqEvent_BurnCardPurchased
{
public:
	unsigned char                                      UnknownData00[0x185BBB527F0];                             // 0x0000(0x185BBB527F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_BurnCardPurchased");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_ChaosGameEvent
// 0x0000
class TgSeqEvent_ChaosGameEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_ChaosGameEvent");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_ClassSelected
// 0x0000
class TgSeqEvent_ClassSelected
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_ClassSelected");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_DebugConsoleKismetTest
// 0x0000
class TgSeqEvent_DebugConsoleKismetTest
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_DebugConsoleKismetTest");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_DoorStatusChanged
// 0x0000
class TgSeqEvent_DoorStatusChanged
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_DoorStatusChanged");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_FactoryEmpty
// 0x0000
class TgSeqEvent_FactoryEmpty
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_FactoryEmpty");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_InputReceived
// 0x185BCD10EB0
class TgSeqEvent_InputReceived
{
public:
	unsigned char                                      UnknownData00[0x185BCD10EB0];                             // 0x0000(0x185BCD10EB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_InputReceived");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_LoadoutChanged
// 0x185BBB47F30
class TgSeqEvent_LoadoutChanged
{
public:
	unsigned char                                      UnknownData00[0x185BBB47F30];                             // 0x0000(0x185BBB47F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_LoadoutChanged");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_LobbyEvents
// 0x0000
class TgSeqEvent_LobbyEvents
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_LobbyEvents");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_LocalPlayerDied
// 0x0000
class TgSeqEvent_LocalPlayerDied
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_LocalPlayerDied");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_LocalPlayerRecalled
// 0x0000
class TgSeqEvent_LocalPlayerRecalled
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_LocalPlayerRecalled");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_LocalPlayerScoredKill
// 0x0000
class TgSeqEvent_LocalPlayerScoredKill
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_LocalPlayerScoredKill");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_LocalPlayersTeamScoredPhoenixKill
// 0x0000
class TgSeqEvent_LocalPlayersTeamScoredPhoenixKill
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_LocalPlayersTeamScoredPhoenixKill");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_LocalPlayersTeamScoredTowerKill
// 0x0000
class TgSeqEvent_LocalPlayersTeamScoredTowerKill
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_LocalPlayersTeamScoredTowerKill");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_LookAtReceived
// 0x0000
class TgSeqEvent_LookAtReceived
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_LookAtReceived");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_MICParameterEvent
// 0x185BCD10130
class TgSeqEvent_MICParameterEvent
{
public:
	unsigned char                                      UnknownData00[0x185BCD10130];                             // 0x0000(0x185BCD10130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_MICParameterEvent");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_PayloadGameEvent
// 0x0000
class TgSeqEvent_PayloadGameEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_PayloadGameEvent");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_PlaceableDestroyed
// 0x0000
class TgSeqEvent_PlaceableDestroyed
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_PlaceableDestroyed");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_PlayerCountHit
// 0x0000
class TgSeqEvent_PlayerCountHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_PlayerCountHit");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_PlayerInitialized
// 0x185BD1A6120
class TgSeqEvent_PlayerInitialized
{
public:
	unsigned char                                      UnknownData00[0x185BD1A6120];                             // 0x0000(0x185BD1A6120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_PlayerInitialized");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_PlayOfTheGame
// 0x185BCD0E630
class TgSeqEvent_PlayOfTheGame
{
public:
	unsigned char                                      UnknownData00[0x185BCD0E630];                             // 0x0000(0x185BCD0E630) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_PlayOfTheGame");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_SurvivalGameEvent
// 0x0000
class TgSeqEvent_SurvivalGameEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_SurvivalGameEvent");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_TutorialEvent
// 0x185BCD10C70
class TgSeqEvent_TutorialEvent
{
public:
	unsigned char                                      UnknownData00[0x185BCD10C70];                             // 0x0000(0x185BCD10C70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_TutorialEvent");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_VaultLowHealth
// 0x0000
class TgSeqEvent_VaultLowHealth
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_VaultLowHealth");
		return ptr;
	}

};


// Class TgGame.TgSkinnableInterface
// 0x0000
class TgSkinnableInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkinnableInterface");
		return ptr;
	}

};


// Class TgGame.TgSoundNodeAttenuation
// 0x0000
class TgSoundNodeAttenuation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSoundNodeAttenuation");
		return ptr;
	}

};


// Class TgGame.TgSpectatorDirector
// 0x185BCD1E350
class TgSpectatorDirector
{
public:
	unsigned char                                      UnknownData00[0x185BCD1E350];                             // 0x0000(0x185BCD1E350) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSpectatorDirector");
		return ptr;
	}

};


// Class TgGame.TgSplineLoftActorSpawnable
// 0x0000
class TgSplineLoftActorSpawnable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSplineLoftActorSpawnable");
		return ptr;
	}

};


// Class TgGame.TgStealthGrassActor
// 0x185BCD1AE70
class TgStealthGrassActor
{
public:
	unsigned char                                      UnknownData00[0x185BCD1AE70];                             // 0x0000(0x185BCD1AE70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgStealthGrassActor");
		return ptr;
	}

};


// Class TgGame.TgTargetAimTrackingCurves
// 0x185BA177CB0
class TgTargetAimTrackingCurves
{
public:
	unsigned char                                      UnknownData00[0x185BA177CB0];                             // 0x0000(0x185BA177CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgTargetAimTrackingCurves");
		return ptr;
	}

};


// Class TgGame.TgTimerManager
// 0x185B85AEFB0
class TgTimerManager
{
public:
	unsigned char                                      UnknownData00[0x185B85AEFB0];                             // 0x0000(0x185B85AEFB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgTimerManager");
		return ptr;
	}

};


// Class TgGame.TgVolumePathNode
// 0x185B60FFDE0
class TgVolumePathNode
{
public:
	unsigned char                                      UnknownData00[0x185B60FFDE0];                             // 0x0000(0x185B60FFDE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgVolumePathNode");
		return ptr;
	}

};


// Class TgGame.TgWeaponMeshActor
// 0x185BCD254F0
class TgWeaponMeshActor
{
public:
	unsigned char                                      UnknownData00[0x185BCD254F0];                             // 0x0000(0x185BCD254F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgWeaponMeshActor");
		return ptr;
	}

};


// Class TgGame.TgWeaponMeshActor_BombKingInhand
// 0x185B9EF8320
class TgWeaponMeshActor_BombKingInhand
{
public:
	unsigned char                                      UnknownData00[0x185B9EF8320];                             // 0x0000(0x185B9EF8320) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgWeaponMeshActor_BombKingInhand");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPosture_Player
// 0x0000
class TgAnimBlendByPosture_Player
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPosture_Player");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByRecoilTime
// 0x185B8504FA0
class TgAnimBlendByRecoilTime
{
public:
	unsigned char                                      UnknownData00[0x185B8504FA0];                             // 0x0000(0x185B8504FA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByRecoilTime");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendBySpeed
// 0x185B85B0750
class TgAnimBlendBySpeed
{
public:
	unsigned char                                      UnknownData00[0x185B85B0750];                             // 0x0000(0x185B85B0750) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendBySpeed");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendBySpeedWithExhaustion
// 0x185B8507B20
class TgAnimBlendBySpeedWithExhaustion
{
public:
	unsigned char                                      UnknownData00[0x185B8507B20];                             // 0x0000(0x185B8507B20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendBySpeedWithExhaustion");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendInterpBySpeed
// 0x185B8506FE0
class TgAnimBlendInterpBySpeed
{
public:
	unsigned char                                      UnknownData00[0x185B8506FE0];                             // 0x0000(0x185B8506FE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendInterpBySpeed");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendPerBone
// 0x185B85B01B0
class TgAnimBlendPerBone
{
public:
	unsigned char                                      UnknownData00[0x185B85B01B0];                             // 0x0000(0x185B85B01B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendPerBone");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_InvisibleWallFailSafe
// 0x185B8506DA0
class TgAnimMetaData_InvisibleWallFailSafe
{
public:
	unsigned char                                      UnknownData00[0x185B8506DA0];                             // 0x0000(0x185B8506DA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_InvisibleWallFailSafe");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_Keyframed
// 0x185B4D5F240
class TgAnimMetaData_Keyframed
{
public:
	unsigned char                                      UnknownData00[0x185B4D5F240];                             // 0x0000(0x185B4D5F240) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_Keyframed");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_DisplayGroupPSCParam
// 0x185B8506C20
class TgAnimMetaData_DisplayGroupPSCParam
{
public:
	unsigned char                                      UnknownData00[0x185B8506C20];                             // 0x0000(0x185B8506C20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_DisplayGroupPSCParam");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_MICScalarParameter
// 0x185B8507520
class TgAnimMetaData_MICScalarParameter
{
public:
	unsigned char                                      UnknownData00[0x185B8507520];                             // 0x0000(0x185B8507520) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_MICScalarParameter");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_MICScalarParameterExtended
// 0x185B85AD4B0
class TgAnimMetaData_MICScalarParameterExtended
{
public:
	unsigned char                                      UnknownData00[0x185B85AD4B0];                             // 0x0000(0x185B85AD4B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_MICScalarParameterExtended");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_MaskingPlane
// 0x185B8508EA0
class TgAnimMetaData_MaskingPlane
{
public:
	unsigned char                                      UnknownData00[0x185B8508EA0];                             // 0x0000(0x185B8508EA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_MaskingPlane");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_MICStates_Interp
// 0x185B965BA10
class TgAnimMetaData_MICStates_Interp
{
public:
	unsigned char                                      UnknownData00[0x185B965BA10];                             // 0x0000(0x185B965BA10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_MICStates_Interp");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_KeyframedDisplayGroup
// 0x185B965BE90
class TgAnimMetaData_KeyframedDisplayGroup
{
public:
	unsigned char                                      UnknownData00[0x185B965BE90];                             // 0x0000(0x185B965BE90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_KeyframedDisplayGroup");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_MeshAccessory
// 0x185B850A760
class TgAnimMetaData_MeshAccessory
{
public:
	unsigned char                                      UnknownData00[0x185B850A760];                             // 0x0000(0x185B850A760) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_MeshAccessory");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_MeshAccessory_Mastery
// 0x0000
class TgAnimMetaData_MeshAccessory_Mastery
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_MeshAccessory_Mastery");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_SkelControl_BoneScale
// 0x185B8508420
class TgAnimMetaData_SkelControl_BoneScale
{
public:
	unsigned char                                      UnknownData00[0x185B8508420];                             // 0x0000(0x185B8508420) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_SkelControl_BoneScale");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_SkelControl_BoneScale_KeyFrame
// 0x185B4D5E700
class TgAnimMetaData_SkelControl_BoneScale_KeyFrame
{
public:
	unsigned char                                      UnknownData00[0x185B4D5E700];                             // 0x0000(0x185B4D5E700) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_SkelControl_BoneScale_KeyFrame");
		return ptr;
	}

};


// Class TgGame.TgAnimMetaData_SkelControl_Shalin
// 0x0000
class TgAnimMetaData_SkelControl_Shalin
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimMetaData_SkelControl_Shalin");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeAdditiveBlending
// 0x185B8509E60
class TgAnimNodeAdditiveBlending
{
public:
	unsigned char                                      UnknownData00[0x185B8509E60];                             // 0x0000(0x185B8509E60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeAdditiveBlending");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeAimOffset_Base
// 0x185B850A6A0
class TgAnimNodeAimOffset_Base
{
public:
	unsigned char                                      UnknownData00[0x185B850A6A0];                             // 0x0000(0x185B850A6A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeAimOffset_Base");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeAimOffset
// 0x185B4D5D8A0
class TgAnimNodeAimOffset
{
public:
	unsigned char                                      UnknownData00[0x185B4D5D8A0];                             // 0x0000(0x185B4D5D8A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeAimOffset");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeAimOffset_Charge
// 0x185B850C7A0
class TgAnimNodeAimOffset_Charge
{
public:
	unsigned char                                      UnknownData00[0x185B850C7A0];                             // 0x0000(0x185B850C7A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeAimOffset_Charge");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeHitReactionOffset
// 0x185BBD2F560
class TgAnimNodeHitReactionOffset
{
public:
	unsigned char                                      UnknownData00[0x185BBD2F560];                             // 0x0000(0x185BBD2F560) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeHitReactionOffset");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendAnimsByDirection
// 0x185B84CDFE0
class TgAnimNodeBlendAnimsByDirection
{
public:
	unsigned char                                      UnknownData00[0x185B84CDFE0];                             // 0x0000(0x185B84CDFE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendAnimsByDirection");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByBlink
// 0x185BBA683C0
class TgAnimNodeBlendByBlink
{
public:
	unsigned char                                      UnknownData00[0x185BBA683C0];                             // 0x0000(0x185BBA683C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByBlink");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByPhysics
// 0x185BBD26C20
class TgAnimNodeBlendByPhysics
{
public:
	unsigned char                                      UnknownData00[0x185BBD26C20];                             // 0x0000(0x185BBD26C20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByPhysics");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByStrafe
// 0x185BBA662C0
class TgAnimNodeBlendByStrafe
{
public:
	unsigned char                                      UnknownData00[0x185BBA662C0];                             // 0x0000(0x185BBA662C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByStrafe");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendList
// 0x185B85A5D70
class TgAnimNodeBlendList
{
public:
	unsigned char                                      UnknownData00[0x185B85A5D70];                             // 0x0000(0x185B85A5D70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendList");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendBy1P3P
// 0x185B48D3EB0
class TgAnimBlendBy1P3P
{
public:
	unsigned char                                      UnknownData00[0x185B48D3EB0];                             // 0x0000(0x185B48D3EB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendBy1P3P");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByAmmo
// 0x185B85AA690
class TgAnimBlendByAmmo
{
public:
	unsigned char                                      UnknownData00[0x185B85AA690];                             // 0x0000(0x185B85AA690) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByAmmo");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByBuffMonsterIntro
// 0x185B85AAB10
class TgAnimBlendByBuffMonsterIntro
{
public:
	unsigned char                                      UnknownData00[0x185B85AAB10];                             // 0x0000(0x185B85AAB10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByBuffMonsterIntro");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByChurchillDrone
// 0x185B85ABAD0
class TgAnimBlendByChurchillDrone
{
public:
	unsigned char                                      UnknownData00[0x185B85ABAD0];                             // 0x0000(0x185B85ABAD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByChurchillDrone");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByDeployable
// 0x185B85A8A70
class TgAnimBlendByDeployable
{
public:
	unsigned char                                      UnknownData00[0x185B85A8A70];                             // 0x0000(0x185B85A8A70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByDeployable");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByDirection
// 0x185B48D61F0
class TgAnimBlendByDirection
{
public:
	unsigned char                                      UnknownData00[0x185B48D61F0];                             // 0x0000(0x185B48D61F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByDirection");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByEmote
// 0x185B9659910
class TgAnimBlendByEmote
{
public:
	unsigned char                                      UnknownData00[0x185B9659910];                             // 0x0000(0x185B9659910) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByEmote");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByFall
// 0x185B48D76F0
class TgAnimBlendByFall
{
public:
	unsigned char                                      UnknownData00[0x185B48D76F0];                             // 0x0000(0x185B48D76F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByFall");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByFallTransition
// 0x185B48D7DB0
class TgAnimBlendByFallTransition
{
public:
	unsigned char                                      UnknownData00[0x185B48D7DB0];                             // 0x0000(0x185B48D7DB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByFallTransition");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByFire
// 0x185B85AA8D0
class TgAnimBlendByFire
{
public:
	unsigned char                                      UnknownData00[0x185B85AA8D0];                             // 0x0000(0x185B85AA8D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByFire");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByFlying
// 0x185B48D5EF0
class TgAnimBlendByFlying
{
public:
	unsigned char                                      UnknownData00[0x185B48D5EF0];                             // 0x0000(0x185B48D5EF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByFlying");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByHeadSkin
// 0x185B48D5FB0
class TgAnimBlendByHeadSkin
{
public:
	unsigned char                                      UnknownData00[0x185B48D5FB0];                             // 0x0000(0x185B48D5FB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByHeadSkin");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByInitialSpeed
// 0x185B965CFD0
class TgAnimBlendByInitialSpeed
{
public:
	unsigned char                                      UnknownData00[0x185B965CFD0];                             // 0x0000(0x185B965CFD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByInitialSpeed");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByMountSkin
// 0x185B48D6A30
class TgAnimBlendByMountSkin
{
public:
	unsigned char                                      UnknownData00[0x185B48D6A30];                             // 0x0000(0x185B48D6A30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByMountSkin");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByNodeName
// 0x185B48D6DF0
class TgAnimBlendByNodeName
{
public:
	unsigned char                                      UnknownData00[0x185B48D6DF0];                             // 0x0000(0x185B48D6DF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByNodeName");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter
// 0x185B85AB2F0
class TgAnimBlendByPaladinsCharacter
{
public:
	unsigned char                                      UnknownData00[0x185B85AB2F0];                             // 0x0000(0x185B85AB2F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter_BarrierTank
// 0x185B85A8DD0
class TgAnimBlendByPaladinsCharacter_BarrierTank
{
public:
	unsigned char                                      UnknownData00[0x185B85A8DD0];                             // 0x0000(0x185B85A8DD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter_BarrierTank");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter_BombKing
// 0x185B85A84D0
class TgAnimBlendByPaladinsCharacter_BombKing
{
public:
	unsigned char                                      UnknownData00[0x185B85A84D0];                             // 0x0000(0x185B85A84D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter_BombKing");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter_Drogoz
// 0x185B85A9D90
class TgAnimBlendByPaladinsCharacter_Drogoz
{
public:
	unsigned char                                      UnknownData00[0x185B85A9D90];                             // 0x0000(0x185B85A9D90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter_Drogoz");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter_Flak
// 0x185B85A8EF0
class TgAnimBlendByPaladinsCharacter_Flak
{
public:
	unsigned char                                      UnknownData00[0x185B85A8EF0];                             // 0x0000(0x185B85A8EF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter_Flak");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter_Imani
// 0x185B5E8C400
class TgAnimBlendByPaladinsCharacter_Imani
{
public:
	unsigned char                                      UnknownData00[0x185B5E8C400];                             // 0x0000(0x185B5E8C400) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter_Imani");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter_Koga
// 0x185B85A9250
class TgAnimBlendByPaladinsCharacter_Koga
{
public:
	unsigned char                                      UnknownData00[0x185B85A9250];                             // 0x0000(0x185B85A9250) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter_Koga");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter_Owl
// 0x185B85A97F0
class TgAnimBlendByPaladinsCharacter_Owl
{
public:
	unsigned char                                      UnknownData00[0x185B85A97F0];                             // 0x0000(0x185B85A97F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter_Owl");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter_Tiberius
// 0x185B5E8C520
class TgAnimBlendByPaladinsCharacter_Tiberius
{
public:
	unsigned char                                      UnknownData00[0x185B5E8C520];                             // 0x0000(0x185B5E8C520) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter_Tiberius");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPercent
// 0x185B85AD810
class TgAnimBlendByPercent
{
public:
	unsigned char                                      UnknownData00[0x185B85AD810];                             // 0x0000(0x185B85AD810) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPercent");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPhase
// 0x185B85AE110
class TgAnimBlendByPhase
{
public:
	unsigned char                                      UnknownData00[0x185B85AE110];                             // 0x0000(0x185B85AE110) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPhase");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPhysics
// 0x185B8500860
class TgAnimBlendByPhysics
{
public:
	unsigned char                                      UnknownData00[0x185B8500860];                             // 0x0000(0x185B8500860) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPhysics");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPosture
// 0x185B85B0990
class TgAnimBlendByPosture
{
public:
	unsigned char                                      UnknownData00[0x185B85B0990];                             // 0x0000(0x185B85B0990) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPosture");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByProgressiveReload
// 0x185B85AC850
class TgAnimBlendByProgressiveReload
{
public:
	unsigned char                                      UnknownData00[0x185B85AC850];                             // 0x0000(0x185B85AC850) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByProgressiveReload");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendBySceneCamera
// 0x0000
class TgAnimBlendBySceneCamera
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendBySceneCamera");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendBySkin
// 0x185B85036E0
class TgAnimBlendBySkin
{
public:
	unsigned char                                      UnknownData00[0x185B85036E0];                             // 0x0000(0x185B85036E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendBySkin");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByStartingPosture
// 0x185B8505A20
class TgAnimBlendByStartingPosture
{
public:
	unsigned char                                      UnknownData00[0x185B8505A20];                             // 0x0000(0x185B8505A20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByStartingPosture");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByWeaponSkin
// 0x185B8506AA0
class TgAnimBlendByWeaponSkin
{
public:
	unsigned char                                      UnknownData00[0x185B8506AA0];                             // 0x0000(0x185B8506AA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByWeaponSkin");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByAbilityDrag
// 0x185B85AFAF0
class TgAnimNodeBlendByAbilityDrag
{
public:
	unsigned char                                      UnknownData00[0x185B85AFAF0];                             // 0x0000(0x185B85AFAF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByAbilityDrag");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByAbilityFragGrenade
// 0x185B85AE590
class TgAnimNodeBlendByAbilityFragGrenade
{
public:
	unsigned char                                      UnknownData00[0x185B85AE590];                             // 0x0000(0x185B85AE590) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByAbilityFragGrenade");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByAbilityHyperShot
// 0x185B4D5CFE0
class TgAnimNodeBlendByAbilityHyperShot
{
public:
	unsigned char                                      UnknownData00[0x185B4D5CFE0];                             // 0x0000(0x185B4D5CFE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByAbilityHyperShot");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByAbilityReversal
// 0x185B4D5DA80
class TgAnimNodeBlendByAbilityReversal
{
public:
	unsigned char                                      UnknownData00[0x185B4D5DA80];                             // 0x0000(0x185B4D5DA80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByAbilityReversal");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByAbilitySimple
// 0x185B85B0BD0
class TgAnimNodeBlendByAbilitySimple
{
public:
	unsigned char                                      UnknownData00[0x185B85B0BD0];                             // 0x0000(0x185B85B0BD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByAbilitySimple");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByAbilityVine
// 0x185BBD29140
class TgAnimNodeBlendByAbilityVine
{
public:
	unsigned char                                      UnknownData00[0x185BBD29140];                             // 0x0000(0x185BBD29140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByAbilityVine");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByAFK
// 0x185BBA647C0
class TgAnimNodeBlendByAFK
{
public:
	unsigned char                                      UnknownData00[0x185BBA647C0];                             // 0x0000(0x185BBA647C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByAFK");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByAndroxusDrift
// 0x185BBD27BE0
class TgAnimNodeBlendByAndroxusDrift
{
public:
	unsigned char                                      UnknownData00[0x185BBD27BE0];                             // 0x0000(0x185BBD27BE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByAndroxusDrift");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByCombat
// 0x185BBA674C0
class TgAnimNodeBlendByCombat
{
public:
	unsigned char                                      UnknownData00[0x185BBA674C0];                             // 0x0000(0x185BBA674C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByCombat");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByCombatWariness
// 0x185BBD27F40
class TgAnimNodeBlendByCombatWariness
{
public:
	unsigned char                                      UnknownData00[0x185BBD27F40];                             // 0x0000(0x185BBD27F40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByCombatWariness");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByDeviceEquipped
// 0x185BBD28600
class TgAnimNodeBlendByDeviceEquipped
{
public:
	unsigned char                                      UnknownData00[0x185BBD28600];                             // 0x0000(0x185BBD28600) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByDeviceEquipped");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByDrogozFlying
// 0x185BBD269E0
class TgAnimNodeBlendByDrogozFlying
{
public:
	unsigned char                                      UnknownData00[0x185BBD269E0];                             // 0x0000(0x185BBD269E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByDrogozFlying");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByGameState
// 0x185BBA680C0
class TgAnimNodeBlendByGameState
{
public:
	unsigned char                                      UnknownData00[0x185BBA680C0];                             // 0x0000(0x185BBA680C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByGameState");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByHealth
// 0x185BBA66F80
class TgAnimNodeBlendByHealth
{
public:
	unsigned char                                      UnknownData00[0x185BBA66F80];                             // 0x0000(0x185BBA66F80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByHealth");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByHitReaction
// 0x185BBD25900
class TgAnimNodeBlendByHitReaction
{
public:
	unsigned char                                      UnknownData00[0x185BBD25900];                             // 0x0000(0x185BBD25900) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByHitReaction");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByIntroduction
// 0x185BBD28960
class TgAnimNodeBlendByIntroduction
{
public:
	unsigned char                                      UnknownData00[0x185BBD28960];                             // 0x0000(0x185BBD28960) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByIntroduction");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByKnockdown
// 0x185BBD284E0
class TgAnimNodeBlendByKnockdown
{
public:
	unsigned char                                      UnknownData00[0x185BBD284E0];                             // 0x0000(0x185BBD284E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByKnockdown");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByLobby
// 0x0000
class TgAnimNodeBlendByLobby
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByLobby");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByMeleeIdle
// 0x185BBA66740
class TgAnimNodeBlendByMeleeIdle
{
public:
	unsigned char                                      UnknownData00[0x185BBA66740];                             // 0x0000(0x185BBA66740) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByMeleeIdle");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendBySimpleStance
// 0x185B5E8FE80
class TgAnimNodeBlendBySimpleStance
{
public:
	unsigned char                                      UnknownData00[0x185B5E8FE80];                             // 0x0000(0x185B5E8FE80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendBySimpleStance");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendBySlowFall
// 0x185BBD270A0
class TgAnimNodeBlendBySlowFall
{
public:
	unsigned char                                      UnknownData00[0x185BBD270A0];                             // 0x0000(0x185BBD270A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendBySlowFall");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByZoomPostFireTransition
// 0x185BBD28A80
class TgAnimNodeBlendByZoomPostFireTransition
{
public:
	unsigned char                                      UnknownData00[0x185BBD28A80];                             // 0x0000(0x185BBD28A80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByZoomPostFireTransition");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByZoomTransition
// 0x185BBD28CC0
class TgAnimNodeBlendByZoomTransition
{
public:
	unsigned char                                      UnknownData00[0x185BBD28CC0];                             // 0x0000(0x185BBD28CC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByZoomTransition");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendList_EquipScreen
// 0x185BBD29800
class TgAnimNodeBlendList_EquipScreen
{
public:
	unsigned char                                      UnknownData00[0x185BBD29800];                             // 0x0000(0x185BBD29800) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendList_EquipScreen");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeChannelFire
// 0x185BBD2C740
class TgAnimNodeChannelFire
{
public:
	unsigned char                                      UnknownData00[0x185BBD2C740];                             // 0x0000(0x185BBD2C740) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeChannelFire");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeLockableChannelFire
// 0x185BBD30520
class TgAnimNodeLockableChannelFire
{
public:
	unsigned char                                      UnknownData00[0x185BBD30520];                             // 0x0000(0x185BBD30520) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeLockableChannelFire");
		return ptr;
	}

};


// Class TgGame.TgAnimNodePlayFireAnim
// 0x185BBD2EC60
class TgAnimNodePlayFireAnim
{
public:
	unsigned char                                      UnknownData00[0x185BBD2EC60];                             // 0x0000(0x185BBD2EC60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodePlayFireAnim");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeRandom
// 0x185BBD2F7A0
class TgAnimNodeRandom
{
public:
	unsigned char                                      UnknownData00[0x185BBD2F7A0];                             // 0x0000(0x185BBD2F7A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeRandom");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeStanceFireIntercept
// 0x185BBD32EC0
class TgAnimNodeStanceFireIntercept
{
public:
	unsigned char                                      UnknownData00[0x185BBD32EC0];                             // 0x0000(0x185BBD32EC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeStanceFireIntercept");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeStanceTransitionerSynchronized
// 0x185BBD2FE60
class TgAnimNodeStanceTransitionerSynchronized
{
public:
	unsigned char                                      UnknownData00[0x185BBD2FE60];                             // 0x0000(0x185BBD2FE60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeStanceTransitionerSynchronized");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeStanceDualFire
// 0x185BBD32DA0
class TgAnimNodeStanceDualFire
{
public:
	unsigned char                                      UnknownData00[0x185BBD32DA0];                             // 0x0000(0x185BBD32DA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeStanceDualFire");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeTargeting
// 0x185BBD2EEA0
class TgAnimNodeTargeting
{
public:
	unsigned char                                      UnknownData00[0x185BBD2EEA0];                             // 0x0000(0x185BBD2EEA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeTargeting");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeToggleWithTransition
// 0x185BBD37240
class TgAnimNodeToggleWithTransition
{
public:
	unsigned char                                      UnknownData00[0x185BBD37240];                             // 0x0000(0x185BBD37240) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeToggleWithTransition");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeBlendByCombatWithTransition
// 0x185B965C610
class TgAnimNodeBlendByCombatWithTransition
{
public:
	unsigned char                                      UnknownData00[0x185B965C610];                             // 0x0000(0x185B965C610) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeBlendByCombatWithTransition");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeToggleWithTransition_Disengage
// 0x185BBD364C0
class TgAnimNodeToggleWithTransition_Disengage
{
public:
	unsigned char                                      UnknownData00[0x185BBD364C0];                             // 0x0000(0x185BBD364C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeToggleWithTransition_Disengage");
		return ptr;
	}

};


// Class TgGame.TgAnimSequenceChain
// 0x185BBA83480
class TgAnimSequenceChain
{
public:
	unsigned char                                      UnknownData00[0x185BBA83480];                             // 0x0000(0x185BBA83480) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimSequenceChain");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeEmoteCustomAnim
// 0x185BBA71D80
class TgAnimNodeEmoteCustomAnim
{
public:
	unsigned char                                      UnknownData00[0x185BBA71D80];                             // 0x0000(0x185BBA71D80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeEmoteCustomAnim");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeEmoteSequence
// 0x185BBD2FD40
class TgAnimNodeEmoteSequence
{
public:
	unsigned char                                      UnknownData00[0x185BBD2FD40];                             // 0x0000(0x185BBD2FD40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeEmoteSequence");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeFidget
// 0x185BBA74B40
class TgAnimNodeFidget
{
public:
	unsigned char                                      UnknownData00[0x185BBA74B40];                             // 0x0000(0x185BBA74B40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeFidget");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeFitToDuration
// 0x185BBA72500
class TgAnimNodeFitToDuration
{
public:
	unsigned char                                      UnknownData00[0x185BBA72500];                             // 0x0000(0x185BBA72500) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeFitToDuration");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeJumpLeanOffset
// 0x185BBD314E0
class TgAnimNodeJumpLeanOffset
{
public:
	unsigned char                                      UnknownData00[0x185BBD314E0];                             // 0x0000(0x185BBD314E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeJumpLeanOffset");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeLog
// 0x0000
class TgAnimNodeLog
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeLog");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeMountSync
// 0x185BBA72440
class TgAnimNodeMountSync
{
public:
	unsigned char                                      UnknownData00[0x185BBA72440];                             // 0x0000(0x185BBA72440) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeMountSync");
		return ptr;
	}

};


// Class TgGame.TgAnimNodePlayTgCameraAnim
// 0x185BBA73C40
class TgAnimNodePlayTgCameraAnim
{
public:
	unsigned char                                      UnknownData00[0x185BBA73C40];                             // 0x0000(0x185BBA73C40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodePlayTgCameraAnim");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeSequence
// 0x185BBD31840
class TgAnimNodeSequence
{
public:
	unsigned char                                      UnknownData00[0x185BBD31840];                             // 0x0000(0x185BBD31840) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeSequence");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeSelfDestruct
// 0x185BBA75380
class TgAnimNodeSelfDestruct
{
public:
	unsigned char                                      UnknownData00[0x185BBA75380];                             // 0x0000(0x185BBA75380) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeSelfDestruct");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeSequence_SyncToCooldown
// 0x185BBD2F680
class TgAnimNodeSequence_SyncToCooldown
{
public:
	unsigned char                                      UnknownData00[0x185BBD2F680];                             // 0x0000(0x185BBD2F680) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeSequence_SyncToCooldown");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeSimpleTransitioner
// 0x185BBD2F9E0
class TgAnimNodeSimpleTransitioner
{
public:
	unsigned char                                      UnknownData00[0x185BBD2F9E0];                             // 0x0000(0x185BBD2F9E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeSimpleTransitioner");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeSlot
// 0x185BBD31A80
class TgAnimNodeSlot
{
public:
	unsigned char                                      UnknownData00[0x185BBD31A80];                             // 0x0000(0x185BBD31A80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeSlot");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeStance
// 0x185BBA79580
class TgAnimNodeStance
{
public:
	unsigned char                                      UnknownData00[0x185BBA79580];                             // 0x0000(0x185BBA79580) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeStance");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeStanceTransition
// 0x185BBA78500
class TgAnimNodeStanceTransition
{
public:
	unsigned char                                      UnknownData00[0x185BBA78500];                             // 0x0000(0x185BBA78500) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeStanceTransition");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeStanceTransitioner
// 0x185BBD32FE0
class TgAnimNodeStanceTransitioner
{
public:
	unsigned char                                      UnknownData00[0x185BBD32FE0];                             // 0x0000(0x185BBD32FE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeStanceTransitioner");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeTiltTowardsVelocity
// 0x185BBA7B800
class TgAnimNodeTiltTowardsVelocity
{
public:
	unsigned char                                      UnknownData00[0x185BBA7B800];                             // 0x0000(0x185BBA7B800) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeTiltTowardsVelocity");
		return ptr;
	}

};


// Class TgGame.TgAnimNodeTriggerCameraAnim
// 0x185BBD340C0
class TgAnimNodeTriggerCameraAnim
{
public:
	unsigned char                                      UnknownData00[0x185BBD340C0];                             // 0x0000(0x185BBD340C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNodeTriggerCameraAnim");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_AkEvent
// 0x185BBD34AE0
class TgAnimNotify_AkEvent
{
public:
	unsigned char                                      UnknownData00[0x185BBD34AE0];                             // 0x0000(0x185BBD34AE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_AkEvent");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_ApplyRigidBodyPhysics
// 0x185BBA7EEC0
class TgAnimNotify_ApplyRigidBodyPhysics
{
public:
	unsigned char                                      UnknownData00[0x185BBA7EEC0];                             // 0x0000(0x185BBA7EEC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_ApplyRigidBodyPhysics");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_AudioGroup
// 0x185B4D63D40
class TgAnimNotify_AudioGroup
{
public:
	unsigned char                                      UnknownData00[0x185B4D63D40];                             // 0x0000(0x185B4D63D40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_AudioGroup");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_Footstep
// 0x0000
class TgAnimNotify_Footstep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_Footstep");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_InterpolateMorphTargetWeight
// 0x185BBD365E0
class TgAnimNotify_InterpolateMorphTargetWeight
{
public:
	unsigned char                                      UnknownData00[0x185BBD365E0];                             // 0x0000(0x185BBD365E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_InterpolateMorphTargetWeight");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_PlayParticleEffect_Skinned
// 0x185BBD33100
class TgAnimNotify_PlayParticleEffect_Skinned
{
public:
	unsigned char                                      UnknownData00[0x185BBD33100];                             // 0x0000(0x185BBD33100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_PlayParticleEffect_Skinned");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_PlayPetAnim
// 0x185BBA7E8C0
class TgAnimNotify_PlayPetAnim
{
public:
	unsigned char                                      UnknownData00[0x185BBA7E8C0];                             // 0x0000(0x185BBA7E8C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_PlayPetAnim");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_SetMICParam
// 0x185BBA80480
class TgAnimNotify_SetMICParam
{
public:
	unsigned char                                      UnknownData00[0x185BBA80480];                             // 0x0000(0x185BBA80480) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_SetMICParam");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_SetMICStates
// 0x185B9660390
class TgAnimNotify_SetMICStates
{
public:
	unsigned char                                      UnknownData00[0x185B9660390];                             // 0x0000(0x185B9660390) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_SetMICStates");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_Sound
// 0x185BBD35CE0
class TgAnimNotify_Sound
{
public:
	unsigned char                                      UnknownData00[0x185BBD35CE0];                             // 0x0000(0x185BBD35CE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_Sound");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_SwapToInhandWeaponMesh
// 0x0000
class TgAnimNotify_SwapToInhandWeaponMesh
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_SwapToInhandWeaponMesh");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_ToggleInvisibleWall
// 0x185BBD35F20
class TgAnimNotify_ToggleInvisibleWall
{
public:
	unsigned char                                      UnknownData00[0x185BBD35F20];                             // 0x0000(0x185BBD35F20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_ToggleInvisibleWall");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_ToggleRigidBodies
// 0x185BBD34D20
class TgAnimNotify_ToggleRigidBodies
{
public:
	unsigned char                                      UnknownData00[0x185BBD34D20];                             // 0x0000(0x185BBD34D20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_ToggleRigidBodies");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_ToggleSocketSpecialFX
// 0x185BBA7FDC0
class TgAnimNotify_ToggleSocketSpecialFX
{
public:
	unsigned char                                      UnknownData00[0x185BBA7FDC0];                             // 0x0000(0x185BBA7FDC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_ToggleSocketSpecialFX");
		return ptr;
	}

};


// Class TgGame.TgAnimNotify_ViewShake
// 0x185BBD35E00
class TgAnimNotify_ViewShake
{
public:
	unsigned char                                      UnknownData00[0x185BBD35E00];                             // 0x0000(0x185BBD35E00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotify_ViewShake");
		return ptr;
	}

};


// Class TgGame.TgAnimNotifySkinData
// 0x185BBA83B40
class TgAnimNotifySkinData
{
public:
	unsigned char                                      UnknownData00[0x185BBA83B40];                             // 0x0000(0x185BBA83B40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimNotifySkinData");
		return ptr;
	}

};


// Class TgGame.TgAnimTurnInPlace
// 0x185BBD36820
class TgAnimTurnInPlace
{
public:
	unsigned char                                      UnknownData00[0x185BBD36820];                             // 0x0000(0x185BBD36820) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimTurnInPlace");
		return ptr;
	}

};


// Class TgGame.TgAnimTurnInPlace_Player
// 0x185BBA85E80
class TgAnimTurnInPlace_Player
{
public:
	unsigned char                                      UnknownData00[0x185BBA85E80];                             // 0x0000(0x185BBA85E80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimTurnInPlace_Player");
		return ptr;
	}

};


// Class TgGame.TgAnimTurnInPlace_Rotator
// 0x185BBA84E00
class TgAnimTurnInPlace_Rotator
{
public:
	unsigned char                                      UnknownData00[0x185BBA84E00];                             // 0x0000(0x185BBA84E00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimTurnInPlace_Rotator");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_CCD_IK_FootPlacement
// 0x185BA1577F0
class TgSkelCon_CCD_IK_FootPlacement
{
public:
	unsigned char                                      UnknownData00[0x185BA1577F0];                             // 0x0000(0x185BA1577F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_CCD_IK_FootPlacement");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_ClockworkSpinner
// 0x185BA159A70
class TgSkelCon_ClockworkSpinner
{
public:
	unsigned char                                      UnknownData00[0x185BA159A70];                             // 0x0000(0x185BA159A70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_ClockworkSpinner");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_FootPlacement
// 0x185BA1587B0
class TgSkelCon_FootPlacement
{
public:
	unsigned char                                      UnknownData00[0x185BA1587B0];                             // 0x0000(0x185BA1587B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_FootPlacement");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_Gate
// 0x185BA159BF0
class TgSkelCon_Gate
{
public:
	unsigned char                                      UnknownData00[0x185BA159BF0];                             // 0x0000(0x185BA159BF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_Gate");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_HitReaction
// 0x185BCD12530
class TgSkelCon_HitReaction
{
public:
	unsigned char                                      UnknownData00[0x185BCD12530];                             // 0x0000(0x185BCD12530) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_HitReaction");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_HookChain
// 0x185BCD129B0
class TgSkelCon_HookChain
{
public:
	unsigned char                                      UnknownData00[0x185BCD129B0];                             // 0x0000(0x185BCD129B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_HookChain");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_LookAt
// 0x185BA159470
class TgSkelCon_LookAt
{
public:
	unsigned char                                      UnknownData00[0x185BA159470];                             // 0x0000(0x185BA159470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_LookAt");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_MirrorFromOtherMesh
// 0x185B86AB640
class TgSkelCon_MirrorFromOtherMesh
{
public:
	unsigned char                                      UnknownData00[0x185B86AB640];                             // 0x0000(0x185B86AB640) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_MirrorFromOtherMesh");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_MirrorToOtherMesh
// 0x185BD1CE1A0
class TgSkelCon_MirrorToOtherMesh
{
public:
	unsigned char                                      UnknownData00[0x185BD1CE1A0];                             // 0x0000(0x185BD1CE1A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_MirrorToOtherMesh");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_RotateToAim
// 0x185B86B0740
class TgSkelCon_RotateToAim
{
public:
	unsigned char                                      UnknownData00[0x185B86B0740];                             // 0x0000(0x185B86B0740) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_RotateToAim");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_RotateToVelocity
// 0x185BA15A2B0
class TgSkelCon_RotateToVelocity
{
public:
	unsigned char                                      UnknownData00[0x185BA15A2B0];                             // 0x0000(0x185BA15A2B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_RotateToVelocity");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_OscillateBoneScale
// 0x185BA15CEF0
class TgSkelCon_OscillateBoneScale
{
public:
	unsigned char                                      UnknownData00[0x185BA15CEF0];                             // 0x0000(0x185BA15CEF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_OscillateBoneScale");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_OscillateRotation
// 0x185BA15CE30
class TgSkelCon_OscillateRotation
{
public:
	unsigned char                                      UnknownData00[0x185BA15CE30];                             // 0x0000(0x185BA15CE30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_OscillateRotation");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_OscillateTranslation
// 0x185BA15A4F0
class TgSkelCon_OscillateTranslation
{
public:
	unsigned char                                      UnknownData00[0x185BA15A4F0];                             // 0x0000(0x185BA15A4F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_OscillateTranslation");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_SkinGate
// 0x185BA15B7B0
class TgSkelCon_SkinGate
{
public:
	unsigned char                                      UnknownData00[0x185BA15B7B0];                             // 0x0000(0x185BA15B7B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_SkinGate");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_Spinner
// 0x185BCD14A50
class TgSkelCon_Spinner
{
public:
	unsigned char                                      UnknownData00[0x185BCD14A50];                             // 0x0000(0x185BCD14A50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_Spinner");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_AstroSpinner
// 0x185BA154AF0
class TgSkelCon_AstroSpinner
{
public:
	unsigned char                                      UnknownData00[0x185BA154AF0];                             // 0x0000(0x185BA154AF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_AstroSpinner");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_RuckusSpinner
// 0x0000
class TgSkelCon_RuckusSpinner
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_RuckusSpinner");
		return ptr;
	}

};


// Class TgGame.TgSkelCon_Spring
// 0x185BA15CB30
class TgSkelCon_Spring
{
public:
	unsigned char                                      UnknownData00[0x185BA15CB30];                             // 0x0000(0x185BA15CB30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelCon_Spring");
		return ptr;
	}

};


// Class TgGame.TgSkelControlSingleBone
// 0x185BA15B570
class TgSkelControlSingleBone
{
public:
	unsigned char                                      UnknownData00[0x185BA15B570];                             // 0x0000(0x185BA15B570) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelControlSingleBone");
		return ptr;
	}

};


// Class TgGame.TgSkelControlSingleBone_Ammo
// 0x185BA15CCB0
class TgSkelControlSingleBone_Ammo
{
public:
	unsigned char                                      UnknownData00[0x185BA15CCB0];                             // 0x0000(0x185BA15CCB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelControlSingleBone_Ammo");
		return ptr;
	}

};


// Class TgGame.TgSkelControlSingleBone_DisplayGroup
// 0x185BA15A370
class TgSkelControlSingleBone_DisplayGroup
{
public:
	unsigned char                                      UnknownData00[0x185BA15A370];                             // 0x0000(0x185BA15A370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelControlSingleBone_DisplayGroup");
		return ptr;
	}

};


// Class TgGame.TgSkelControlSingleBone_PistonBarrel
// 0x185BCD144B0
class TgSkelControlSingleBone_PistonBarrel
{
public:
	unsigned char                                      UnknownData00[0x185BCD144B0];                             // 0x0000(0x185BCD144B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelControlSingleBone_PistonBarrel");
		return ptr;
	}

};


// Class TgGame.TgSkelControlSingleBone_Skinned
// 0x185BA15FBF0
class TgSkelControlSingleBone_Skinned
{
public:
	unsigned char                                      UnknownData00[0x185BA15FBF0];                             // 0x0000(0x185BA15FBF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelControlSingleBone_Skinned");
		return ptr;
	}

};


// Class TgGame.TgAnimBlendByPaladinsCharacter_Lex
// 0x185B85A9370
class TgAnimBlendByPaladinsCharacter_Lex
{
public:
	unsigned char                                      UnknownData00[0x185B85A9370];                             // 0x0000(0x185B85A9370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAnimBlendByPaladinsCharacter_Lex");
		return ptr;
	}

};


// Class TgGame.TgSkelControlSingleBone_Ammo_Lex
// 0x185BA15A1F0
class TgSkelControlSingleBone_Ammo_Lex
{
public:
	unsigned char                                      UnknownData00[0x185BA15A1F0];                             // 0x0000(0x185BA15A1F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkelControlSingleBone_Ammo_Lex");
		return ptr;
	}

};


// Class TgGame.TgBeamHelper
// 0x185BBD4B400
class TgBeamHelper
{
public:
	unsigned char                                      UnknownData00[0x185BBD4B400];                             // 0x0000(0x185BBD4B400) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgBeamHelper");
		return ptr;
	}

};


// Class TgGame.TgDevice
// 0x185BBD22AE0
class TgDevice
{
public:
	unsigned char                                      UnknownData00[0x185BBD22AE0];                             // 0x0000(0x185BBD22AE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice");
		return ptr;
	}

};


// Class TgGame.TgDevice_ActivateOnChildGeneric1
// 0x185BBB45590
class TgDevice_ActivateOnChildGeneric1
{
public:
	unsigned char                                      UnknownData00[0x185BBB45590];                             // 0x0000(0x185BBB45590) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ActivateOnChildGeneric1");
		return ptr;
	}

};


// Class TgGame.TgDevice_ArcingBeam
// 0x185B805B400
class TgDevice_ArcingBeam
{
public:
	unsigned char                                      UnknownData00[0x185B805B400];                             // 0x0000(0x185B805B400) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ArcingBeam");
		return ptr;
	}

};


// Class TgGame.TgDevice_Aura
// 0x185B8056540
class TgDevice_Aura
{
public:
	unsigned char                                      UnknownData00[0x185B8056540];                             // 0x0000(0x185B8056540) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Aura");
		return ptr;
	}

};


// Class TgGame.TgDevice_ActiveAura
// 0x185B5A811F0
class TgDevice_ActiveAura
{
public:
	unsigned char                                      UnknownData00[0x185B5A811F0];                             // 0x0000(0x185B5A811F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ActiveAura");
		return ptr;
	}

};


// Class TgGame.TgDevice_PassiveAura
// 0x185B805DFE0
class TgDevice_PassiveAura
{
public:
	unsigned char                                      UnknownData00[0x185B805DFE0];                             // 0x0000(0x185B805DFE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_PassiveAura");
		return ptr;
	}

};


// Class TgGame.TgDevice_AuraPerTarget
// 0x185BC2C72F0
class TgDevice_AuraPerTarget
{
public:
	unsigned char                                      UnknownData00[0x185BC2C72F0];                             // 0x0000(0x185BC2C72F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_AuraPerTarget");
		return ptr;
	}

};


// Class TgGame.TgDevice_AutoHealing2
// 0x185B805E460
class TgDevice_AutoHealing2
{
public:
	unsigned char                                      UnknownData00[0x185B805E460];                             // 0x0000(0x185B805E460) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_AutoHealing2");
		return ptr;
	}

};


// Class TgGame.TgDevice_BarricadeMod
// 0x185BBB43070
class TgDevice_BarricadeMod
{
public:
	unsigned char                                      UnknownData00[0x185BBB43070];                             // 0x0000(0x185BBB43070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_BarricadeMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_AcceleratorField
// 0x0000
class TgDevice_AcceleratorField
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_AcceleratorField");
		return ptr;
	}

};


// Class TgGame.TgDevice_Bunker
// 0x0000
class TgDevice_Bunker
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Bunker");
		return ptr;
	}

};


// Class TgGame.TgDevice_Impede
// 0x0000
class TgDevice_Impede
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Impede");
		return ptr;
	}

};


// Class TgGame.TgDevice_BeyondTheVeil
// 0x185B5E9D9E0
class TgDevice_BeyondTheVeil
{
public:
	unsigned char                                      UnknownData00[0x185B5E9D9E0];                             // 0x0000(0x185B5E9D9E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_BeyondTheVeil");
		return ptr;
	}

};


// Class TgGame.TgDevice_ChainSequence
// 0x185B8063440
class TgDevice_ChainSequence
{
public:
	unsigned char                                      UnknownData00[0x185B8063440];                             // 0x0000(0x185B8063440) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ChainSequence");
		return ptr;
	}

};


// Class TgGame.TgDevice_Charge
// 0x185BBD23AA0
class TgDevice_Charge
{
public:
	unsigned char                                      UnknownData00[0x185BBD23AA0];                             // 0x0000(0x185BBD23AA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Charge");
		return ptr;
	}

};


// Class TgGame.TgDevice_ChargeBackward
// 0x0000
class TgDevice_ChargeBackward
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ChargeBackward");
		return ptr;
	}

};


// Class TgGame.TgDevice_DoubleCharge
// 0x185B5A7F7B0
class TgDevice_DoubleCharge
{
public:
	unsigned char                                      UnknownData00[0x185B5A7F7B0];                             // 0x0000(0x185B5A7F7B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_DoubleCharge");
		return ptr;
	}

};


// Class TgGame.TgDevice_DecoyMod
// 0x0000
class TgDevice_DecoyMod
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_DecoyMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_Pursuit
// 0x185B9EFB7A0
class TgDevice_Pursuit
{
public:
	unsigned char                                      UnknownData00[0x185B9EFB7A0];                             // 0x0000(0x185B9EFB7A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Pursuit");
		return ptr;
	}

};


// Class TgGame.TgDevice_DeployMod
// 0x185B80722C0
class TgDevice_DeployMod
{
public:
	unsigned char                                      UnknownData00[0x185B80722C0];                             // 0x0000(0x185B80722C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_DeployMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_DeployMod_AddHealth
// 0x185B8071300
class TgDevice_DeployMod_AddHealth
{
public:
	unsigned char                                      UnknownData00[0x185B8071300];                             // 0x0000(0x185B8071300) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_DeployMod_AddHealth");
		return ptr;
	}

};


// Class TgGame.TgDevice_DeployMod_PropertyMult
// 0x185B8073820
class TgDevice_DeployMod_PropertyMult
{
public:
	unsigned char                                      UnknownData00[0x185B8073820];                             // 0x0000(0x185B8073820) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_DeployMod_PropertyMult");
		return ptr;
	}

};


// Class TgGame.TgDevice_DualWield
// 0x185B8063E60
class TgDevice_DualWield
{
public:
	unsigned char                                      UnknownData00[0x185B8063E60];                             // 0x0000(0x185B8063E60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_DualWield");
		return ptr;
	}

};


// Class TgGame.TgDevice_QuadWield
// 0x185B808CD20
class TgDevice_QuadWield
{
public:
	unsigned char                                      UnknownData00[0x185B808CD20];                             // 0x0000(0x185B808CD20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_QuadWield");
		return ptr;
	}

};


// Class TgGame.TgDevice_EmitterMod
// 0x185B8079B20
class TgDevice_EmitterMod
{
public:
	unsigned char                                      UnknownData00[0x185B8079B20];                             // 0x0000(0x185B8079B20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_EmitterMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_Projector
// 0x185B47C5040
class TgDevice_Projector
{
public:
	unsigned char                                      UnknownData00[0x185B47C5040];                             // 0x0000(0x185B47C5040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Projector");
		return ptr;
	}

};


// Class TgGame.TgDevice_Emote
// 0x185B807F520
class TgDevice_Emote
{
public:
	unsigned char                                      UnknownData00[0x185B807F520];                             // 0x0000(0x185B807F520) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Emote");
		return ptr;
	}

};


// Class TgGame.TgDevice_FireInAir
// 0x0000
class TgDevice_FireInAir
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_FireInAir");
		return ptr;
	}

};


// Class TgGame.TgDevice_HitPulse
// 0x185BBB41210
class TgDevice_HitPulse
{
public:
	unsigned char                                      UnknownData00[0x185BBB41210];                             // 0x0000(0x185BBB41210) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_HitPulse");
		return ptr;
	}

};


// Class TgGame.TgDevice_Leap
// 0x185B805E100
class TgDevice_Leap
{
public:
	unsigned char                                      UnknownData00[0x185B805E100];                             // 0x0000(0x185B805E100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Leap");
		return ptr;
	}

};


// Class TgGame.TgDevice_LongReach
// 0x185B47BA0C0
class TgDevice_LongReach
{
public:
	unsigned char                                      UnknownData00[0x185B47BA0C0];                             // 0x0000(0x185B47BA0C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_LongReach");
		return ptr;
	}

};


// Class TgGame.TgDevice_Meteor
// 0x185B47B8140
class TgDevice_Meteor
{
public:
	unsigned char                                      UnknownData00[0x185B47B8140];                             // 0x0000(0x185B47B8140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Meteor");
		return ptr;
	}

};


// Class TgGame.TgDevice_OppressorMineMod
// 0x185B8057080
class TgDevice_OppressorMineMod
{
public:
	unsigned char                                      UnknownData00[0x185B8057080];                             // 0x0000(0x185B8057080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_OppressorMineMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_Amplitude
// 0x0000
class TgDevice_Amplitude
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Amplitude");
		return ptr;
	}

};


// Class TgGame.TgDevice_Pet
// 0x0000
class TgDevice_Pet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Pet");
		return ptr;
	}

};


// Class TgGame.TgDevice_PortalMod
// 0x185B47C5EE0
class TgDevice_PortalMod
{
public:
	unsigned char                                      UnknownData00[0x185B47C5EE0];                             // 0x0000(0x185B47C5EE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_PortalMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_RespawnBeacon
// 0x185B47CC420
class TgDevice_RespawnBeacon
{
public:
	unsigned char                                      UnknownData00[0x185B47CC420];                             // 0x0000(0x185B47CC420) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_RespawnBeacon");
		return ptr;
	}

};


// Class TgGame.TgDevice_ReversalMod
// 0x0000
class TgDevice_ReversalMod
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ReversalMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_Vengeance
// 0x0000
class TgDevice_Vengeance
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Vengeance");
		return ptr;
	}

};


// Class TgGame.TgDevice_ShellShieldMod
// 0x185B8062D80
class TgDevice_ShellShieldMod
{
public:
	unsigned char                                      UnknownData00[0x185B8062D80];                             // 0x0000(0x185B8062D80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ShellShieldMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_BarrierReef
// 0x185B8060080
class TgDevice_BarrierReef
{
public:
	unsigned char                                      UnknownData00[0x185B8060080];                             // 0x0000(0x185B8060080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_BarrierReef");
		return ptr;
	}

};


// Class TgGame.TgDevice_Carapace
// 0x0000
class TgDevice_Carapace
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Carapace");
		return ptr;
	}

};


// Class TgGame.TgDevice_ShieldMod
// 0x0000
class TgDevice_ShieldMod
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ShieldMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_HeatTransfer
// 0x185B80881C0
class TgDevice_HeatTransfer
{
public:
	unsigned char                                      UnknownData00[0x185B80881C0];                             // 0x0000(0x185B80881C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_HeatTransfer");
		return ptr;
	}

};


// Class TgGame.TgDevice_Rattle
// 0x185B47C4740
class TgDevice_Rattle
{
public:
	unsigned char                                      UnknownData00[0x185B47C4740];                             // 0x0000(0x185B47C4740) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Rattle");
		return ptr;
	}

};


// Class TgGame.TgDevice_ToweringBarrier
// 0x0000
class TgDevice_ToweringBarrier
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ToweringBarrier");
		return ptr;
	}

};


// Class TgGame.TgDevice_ToweringBarrier_Old
// 0x0000
class TgDevice_ToweringBarrier_Old
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ToweringBarrier_Old");
		return ptr;
	}

};


// Class TgGame.TgDevice_SmokeScreenMod
// 0x185B47D9F80
class TgDevice_SmokeScreenMod
{
public:
	unsigned char                                      UnknownData00[0x185B47D9F80];                             // 0x0000(0x185B47D9F80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_SmokeScreenMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_Smother
// 0x0000
class TgDevice_Smother
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Smother");
		return ptr;
	}

};


// Class TgGame.TgDevice_Spray
// 0x185B47DBCC0
class TgDevice_Spray
{
public:
	unsigned char                                      UnknownData00[0x185B47DBCC0];                             // 0x0000(0x185B47DBCC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Spray");
		return ptr;
	}

};


// Class TgGame.TgDevice_Stim
// 0x185B8067340
class TgDevice_Stim
{
public:
	unsigned char                                      UnknownData00[0x185B8067340];                             // 0x0000(0x185B8067340) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Stim");
		return ptr;
	}

};


// Class TgGame.TgDevice_ToggleWithLockout
// 0x185B8068780
class TgDevice_ToggleWithLockout
{
public:
	unsigned char                                      UnknownData00[0x185B8068780];                             // 0x0000(0x185B8068780) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ToggleWithLockout");
		return ptr;
	}

};


// Class TgGame.TgDevice_ToggleADS
// 0x185B8069CE0
class TgDevice_ToggleADS
{
public:
	unsigned char                                      UnknownData00[0x185B8069CE0];                             // 0x0000(0x185B8069CE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ToggleADS");
		return ptr;
	}

};


// Class TgGame.TgDevice_ToggleModeWithLockout
// 0x185B47D86C0
class TgDevice_ToggleModeWithLockout
{
public:
	unsigned char                                      UnknownData00[0x185B47D86C0];                             // 0x0000(0x185B47D86C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ToggleModeWithLockout");
		return ptr;
	}

};


// Class TgGame.TgDevice_TeamDevice
// 0x185B8052D00
class TgDevice_TeamDevice
{
public:
	unsigned char                                      UnknownData00[0x185B8052D00];                             // 0x0000(0x185B8052D00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_TeamDevice");
		return ptr;
	}

};


// Class TgGame.TgDevice_ItemStoreBeacon
// 0x185B8051B00
class TgDevice_ItemStoreBeacon
{
public:
	unsigned char                                      UnknownData00[0x185B8051B00];                             // 0x0000(0x185B8051B00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ItemStoreBeacon");
		return ptr;
	}

};


// Class TgGame.TgDevice_Toggle
// 0x185B80691A0
class TgDevice_Toggle
{
public:
	unsigned char                                      UnknownData00[0x185B80691A0];                             // 0x0000(0x185B80691A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Toggle");
		return ptr;
	}

};


// Class TgGame.TgDevice_Mount
// 0x185B47B9D60
class TgDevice_Mount
{
public:
	unsigned char                                      UnknownData00[0x185B47B9D60];                             // 0x0000(0x185B47B9D60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Mount");
		return ptr;
	}

};


// Class TgGame.TgDevice_ToggleInhand
// 0x185B8057740
class TgDevice_ToggleInhand
{
public:
	unsigned char                                      UnknownData00[0x185B8057740];                             // 0x0000(0x185B8057740) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ToggleInhand");
		return ptr;
	}

};


// Class TgGame.TgDevice_ToggleInhandFiremode
// 0x185B47E04C0
class TgDevice_ToggleInhandFiremode
{
public:
	unsigned char                                      UnknownData00[0x185B47E04C0];                             // 0x0000(0x185B47E04C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_ToggleInhandFiremode");
		return ptr;
	}

};


// Class TgGame.TgDevice_TotemMod
// 0x0000
class TgDevice_TotemMod
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_TotemMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_HealingRain
// 0x0000
class TgDevice_HealingRain
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_HealingRain");
		return ptr;
	}

};


// Class TgGame.TgDevice_MonolithTotem
// 0x0000
class TgDevice_MonolithTotem
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_MonolithTotem");
		return ptr;
	}

};


// Class TgGame.TgDevice_Outreach
// 0x0000
class TgDevice_Outreach
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_Outreach");
		return ptr;
	}

};


// Class TgGame.TgDevice_WindTotem
// 0x0000
class TgDevice_WindTotem
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_WindTotem");
		return ptr;
	}

};


// Class TgGame.TgDevice_TurretMod
// 0x0000
class TgDevice_TurretMod
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_TurretMod");
		return ptr;
	}

};


// Class TgGame.TgDevice_HealingStation
// 0x185B9ED43E0
class TgDevice_HealingStation
{
public:
	unsigned char                                      UnknownData00[0x185B9ED43E0];                             // 0x0000(0x185B9ED43E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_HealingStation");
		return ptr;
	}

};


// Class TgGame.TgDevice_MegaTurret
// 0x0000
class TgDevice_MegaTurret
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_MegaTurret");
		return ptr;
	}

};


// Class TgGame.TgDevice_WallClimb
// 0x185B47E9280
class TgDevice_WallClimb
{
public:
	unsigned char                                      UnknownData00[0x185B47E9280];                             // 0x0000(0x185B47E9280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDevice_WallClimb");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire
// 0x185B592FDD0
class TgDeviceFire
{
public:
	unsigned char                                      UnknownData00[0x185B592FDD0];                             // 0x0000(0x185B592FDD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_BonusShieldDamage
// 0x185B592F5F0
class TgDeviceFire_BonusShieldDamage
{
public:
	unsigned char                                      UnknownData00[0x185B592F5F0];                             // 0x0000(0x185B592F5F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_BonusShieldDamage");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_Cylinder
// 0x185B5930130
class TgDeviceFire_Cylinder
{
public:
	unsigned char                                      UnknownData00[0x185B5930130];                             // 0x0000(0x185B5930130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_Cylinder");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_DeployablesOnly
// 0x185B592C470
class TgDeviceFire_DeployablesOnly
{
public:
	unsigned char                                      UnknownData00[0x185B592C470];                             // 0x0000(0x185B592C470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_DeployablesOnly");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_DeployAsIfProjectile
// 0x185B8922650
class TgDeviceFire_DeployAsIfProjectile
{
public:
	unsigned char                                      UnknownData00[0x185B8922650];                             // 0x0000(0x185B8922650) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_DeployAsIfProjectile");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_DeployOnLocation
// 0x185B592DF70
class TgDeviceFire_DeployOnLocation
{
public:
	unsigned char                                      UnknownData00[0x185B592DF70];                             // 0x0000(0x185B592DF70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_DeployOnLocation");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_DeployOnTarget
// 0x185B592D8B0
class TgDeviceFire_DeployOnTarget
{
public:
	unsigned char                                      UnknownData00[0x185B592D8B0];                             // 0x0000(0x185B592D8B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_DeployOnTarget");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_EncroachmentFireCone
// 0x185B8925470
class TgDeviceFire_EncroachmentFireCone
{
public:
	unsigned char                                      UnknownData00[0x185B8925470];                             // 0x0000(0x185B8925470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_EncroachmentFireCone");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_IgnoreCCImmune
// 0x185B592F050
class TgDeviceFire_IgnoreCCImmune
{
public:
	unsigned char                                      UnknownData00[0x185B592F050];                             // 0x0000(0x185B592F050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_IgnoreCCImmune");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_IgnoreCounter
// 0x0000
class TgDeviceFire_IgnoreCounter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_IgnoreCounter");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_IgnorePets
// 0x185B59306D0
class TgDeviceFire_IgnorePets
{
public:
	unsigned char                                      UnknownData00[0x185B59306D0];                             // 0x0000(0x185B59306D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_IgnorePets");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_IgnoreReversal
// 0x185B592F170
class TgDeviceFire_IgnoreReversal
{
public:
	unsigned char                                      UnknownData00[0x185B592F170];                             // 0x0000(0x185B592F170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_IgnoreReversal");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_Melee
// 0x185B592D0D0
class TgDeviceFire_Melee
{
public:
	unsigned char                                      UnknownData00[0x185B592D0D0];                             // 0x0000(0x185B592D0D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_Melee");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_MirrorDamageToHeal
// 0x185B5933070
class TgDeviceFire_MirrorDamageToHeal
{
public:
	unsigned char                                      UnknownData00[0x185B5933070];                             // 0x0000(0x185B5933070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_MirrorDamageToHeal");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_MirrorDamageToHealBlock
// 0x185B5933610
class TgDeviceFire_MirrorDamageToHealBlock
{
public:
	unsigned char                                      UnknownData00[0x185B5933610];                             // 0x0000(0x185B5933610) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_MirrorDamageToHealBlock");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_Mount
// 0x185B5932BF0
class TgDeviceFire_Mount
{
public:
	unsigned char                                      UnknownData00[0x185B5932BF0];                             // 0x0000(0x185B5932BF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_Mount");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_OwningPawnOnly
// 0x185B89246F0
class TgDeviceFire_OwningPawnOnly
{
public:
	unsigned char                                      UnknownData00[0x185B89246F0];                             // 0x0000(0x185B89246F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_OwningPawnOnly");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_PetsOnly
// 0x185B5932410
class TgDeviceFire_PetsOnly
{
public:
	unsigned char                                      UnknownData00[0x185B5932410];                             // 0x0000(0x185B5932410) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_PetsOnly");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_ShieldsOnly
// 0x185B5934C90
class TgDeviceFire_ShieldsOnly
{
public:
	unsigned char                                      UnknownData00[0x185B5934C90];                             // 0x0000(0x185B5934C90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_ShieldsOnly");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_Spray
// 0x185B5934FF0
class TgDeviceFire_Spray
{
public:
	unsigned char                                      UnknownData00[0x185B5934FF0];                             // 0x0000(0x185B5934FF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_Spray");
		return ptr;
	}

};


// Class TgGame.TgDeviceFire_WorldLOSOnly
// 0x185B592DD30
class TgDeviceFire_WorldLOSOnly
{
public:
	unsigned char                                      UnknownData00[0x185B592DD30];                             // 0x0000(0x185B592DD30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceFire_WorldLOSOnly");
		return ptr;
	}

};


// Class TgGame.TgDeviceForm
// 0x185B593DC90
class TgDeviceForm
{
public:
	unsigned char                                      UnknownData00[0x185B593DC90];                             // 0x0000(0x185B593DC90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceForm");
		return ptr;
	}

};


// Class TgGame.TgDeviceForm_BladesInhand
// 0x185B5939FD0
class TgDeviceForm_BladesInhand
{
public:
	unsigned char                                      UnknownData00[0x185B5939FD0];                             // 0x0000(0x185B5939FD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceForm_BladesInhand");
		return ptr;
	}

};


// Class TgGame.TgDeviceForm_Emote
// 0x185B5941DD0
class TgDeviceForm_Emote
{
public:
	unsigned char                                      UnknownData00[0x185B5941DD0];                             // 0x0000(0x185B5941DD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceForm_Emote");
		return ptr;
	}

};


// Class TgGame.TgDeviceForm_Inhand
// 0x185B593B9B0
class TgDeviceForm_Inhand
{
public:
	unsigned char                                      UnknownData00[0x185B593B9B0];                             // 0x0000(0x185B593B9B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceForm_Inhand");
		return ptr;
	}

};


// Class TgGame.TgDeviceForm_Mount
// 0x185B59492D0
class TgDeviceForm_Mount
{
public:
	unsigned char                                      UnknownData00[0x185B59492D0];                             // 0x0000(0x185B59492D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceForm_Mount");
		return ptr;
	}

};


// Class TgGame.TgDeviceForm_SpinnerWhileFiring
// 0x185B593C3D0
class TgDeviceForm_SpinnerWhileFiring
{
public:
	unsigned char                                      UnknownData00[0x185B593C3D0];                             // 0x0000(0x185B593C3D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceForm_SpinnerWhileFiring");
		return ptr;
	}

};


// Class TgGame.TgDeviceForm_Spray
// 0x185B5958390
class TgDeviceForm_Spray
{
public:
	unsigned char                                      UnknownData00[0x185B5958390];                             // 0x0000(0x185B5958390) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceForm_Spray");
		return ptr;
	}

};


// Class TgGame.TgDeviceForm_ToggleWithLockout
// 0x185B593C610
class TgDeviceForm_ToggleWithLockout
{
public:
	unsigned char                                      UnknownData00[0x185B593C610];                             // 0x0000(0x185B593C610) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceForm_ToggleWithLockout");
		return ptr;
	}

};


// Class TgGame.TgDeviceForm_ToggleADS
// 0x185B892AD50
class TgDeviceForm_ToggleADS
{
public:
	unsigned char                                      UnknownData00[0x185B892AD50];                             // 0x0000(0x185B892AD50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceForm_ToggleADS");
		return ptr;
	}

};


// Class TgGame.TgDeviceInterface_AccelMultiplier
// 0x185B5959470
class TgDeviceInterface_AccelMultiplier
{
public:
	unsigned char                                      UnknownData00[0x185B5959470];                             // 0x0000(0x185B5959470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceInterface_AccelMultiplier");
		return ptr;
	}

};


// Class TgGame.TgDeviceInterface_DeployMod
// 0x185B59596B0
class TgDeviceInterface_DeployMod
{
public:
	unsigned char                                      UnknownData00[0x185B59596B0];                             // 0x0000(0x185B59596B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceInterface_DeployMod");
		return ptr;
	}

};


// Class TgGame.TgDeviceInterface_ListenConsumeMarks
// 0x185B595CCB0
class TgDeviceInterface_ListenConsumeMarks
{
public:
	unsigned char                                      UnknownData00[0x185B595CCB0];                             // 0x0000(0x185B595CCB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceInterface_ListenConsumeMarks");
		return ptr;
	}

};


// Class TgGame.TgDeviceInterface_MoveSpeedMultiplier
// 0x185B59598F0
class TgDeviceInterface_MoveSpeedMultiplier
{
public:
	unsigned char                                      UnknownData00[0x185B59598F0];                             // 0x0000(0x185B59598F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceInterface_MoveSpeedMultiplier");
		return ptr;
	}

};


// Class TgGame.TgDeviceMod_Burst
// 0x185B8062480
class TgDeviceMod_Burst
{
public:
	unsigned char                                      UnknownData00[0x185B8062480];                             // 0x0000(0x185B8062480) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceMod_Burst");
		return ptr;
	}

};


// Class TgGame.TgDeviceMod_TargetingAimForwarder
// 0x185B47ADF40
class TgDeviceMod_TargetingAimForwarder
{
public:
	unsigned char                                      UnknownData00[0x185B47ADF40];                             // 0x0000(0x185B47ADF40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeviceMod_TargetingAimForwarder");
		return ptr;
	}

};


// Class TgGame.TgDeployable
// 0x185BBB68A50
class TgDeployable
{
public:
	unsigned char                                      UnknownData00[0x185BBB68A50];                             // 0x0000(0x185BBB68A50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeployable");
		return ptr;
	}

};


// Class TgGame.TgDeploy_BlackHole
// 0x185BBB66E30
class TgDeploy_BlackHole
{
public:
	unsigned char                                      UnknownData00[0x185BBB66E30];                             // 0x0000(0x185BBB66E30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_BlackHole");
		return ptr;
	}

};


// Class TgGame.TgDeploy_Bomb
// 0x185BBB6B990
class TgDeploy_Bomb
{
public:
	unsigned char                                      UnknownData00[0x185BBB6B990];                             // 0x0000(0x185BBB6B990) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_Bomb");
		return ptr;
	}

};


// Class TgGame.TgDeploy_DeathStamp
// 0x185BBA39530
class TgDeploy_DeathStamp
{
public:
	unsigned char                                      UnknownData00[0x185BBA39530];                             // 0x0000(0x185BBA39530) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_DeathStamp");
		return ptr;
	}

};


// Class TgGame.TgDeploy_Geometry
// 0x185BBB74090
class TgDeploy_Geometry
{
public:
	unsigned char                                      UnknownData00[0x185BBB74090];                             // 0x0000(0x185BBB74090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_Geometry");
		return ptr;
	}

};


// Class TgGame.TgDeploy_HealthNugget
// 0x185BBB73670
class TgDeploy_HealthNugget
{
public:
	unsigned char                                      UnknownData00[0x185BBB73670];                             // 0x0000(0x185BBB73670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_HealthNugget");
		return ptr;
	}

};


// Class TgGame.TgDeploy_HealthNugget_TeamOnly
// 0x185BBB74E10
class TgDeploy_HealthNugget_TeamOnly
{
public:
	unsigned char                                      UnknownData00[0x185BBB74E10];                             // 0x0000(0x185BBB74E10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_HealthNugget_TeamOnly");
		return ptr;
	}

};


// Class TgGame.TgDeploy_MatchParentFireMode
// 0x0000
class TgDeploy_MatchParentFireMode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_MatchParentFireMode");
		return ptr;
	}

};


// Class TgGame.TgDeploy_DeployableLinked
// 0x185BB817720
class TgDeploy_DeployableLinked
{
public:
	unsigned char                                      UnknownData00[0x185BB817720];                             // 0x0000(0x185BB817720) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_DeployableLinked");
		return ptr;
	}

};


// Class TgGame.TgDeploy_EffectAura
// 0x185BBB70850
class TgDeploy_EffectAura
{
public:
	unsigned char                                      UnknownData00[0x185BBB70850];                             // 0x0000(0x185BBB70850) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_EffectAura");
		return ptr;
	}

};


// Class TgGame.TgDeploy_Explosion
// 0x185BBB73790
class TgDeploy_Explosion
{
public:
	unsigned char                                      UnknownData00[0x185BBB73790];                             // 0x0000(0x185BBB73790) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_Explosion");
		return ptr;
	}

};


// Class TgGame.TgDeploy_EffectField
// 0x185BBB70730
class TgDeploy_EffectField
{
public:
	unsigned char                                      UnknownData00[0x185BBB70730];                             // 0x0000(0x185BBB70730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_EffectField");
		return ptr;
	}

};


// Class TgGame.TgDeploy_DeployableLinkedEffectField
// 0x185BB8172A0
class TgDeploy_DeployableLinkedEffectField
{
public:
	unsigned char                                      UnknownData00[0x185BB8172A0];                             // 0x0000(0x185BB8172A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_DeployableLinkedEffectField");
		return ptr;
	}

};


// Class TgGame.TgDeploy_EffectSpots
// 0x185BBB6E450
class TgDeploy_EffectSpots
{
public:
	unsigned char                                      UnknownData00[0x185BBB6E450];                             // 0x0000(0x185BBB6E450) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_EffectSpots");
		return ptr;
	}

};


// Class TgGame.TgDeploy_EffectTrail
// 0x185BBB76FD0
class TgDeploy_EffectTrail
{
public:
	unsigned char                                      UnknownData00[0x185BBB76FD0];                             // 0x0000(0x185BBB76FD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_EffectTrail");
		return ptr;
	}

};


// Class TgGame.TgDeploy_Pickup
// 0x185BBB74F30
class TgDeploy_Pickup
{
public:
	unsigned char                                      UnknownData00[0x185BBB74F30];                             // 0x0000(0x185BBB74F30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_Pickup");
		return ptr;
	}

};


// Class TgGame.TgDeploy_Pickup_Teamwide
// 0x0000
class TgDeploy_Pickup_Teamwide
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_Pickup_Teamwide");
		return ptr;
	}

};


// Class TgGame.TgDeploy_HHPickup
// 0x185BBB75050
class TgDeploy_HHPickup
{
public:
	unsigned char                                      UnknownData00[0x185BBB75050];                             // 0x0000(0x185BBB75050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_HHPickup");
		return ptr;
	}

};


// Class TgGame.TgDeploy_Pickup_OwnerOnly
// 0x185BBB7D870
class TgDeploy_Pickup_OwnerOnly
{
public:
	unsigned char                                      UnknownData00[0x185BBB7D870];                             // 0x0000(0x185BBB7D870) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_Pickup_OwnerOnly");
		return ptr;
	}

};


// Class TgGame.TgDeploy_Placeholder
// 0x0000
class TgDeploy_Placeholder
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_Placeholder");
		return ptr;
	}

};


// Class TgGame.TgDeploy_ProxyMine
// 0x185BBB7C550
class TgDeploy_ProxyMine
{
public:
	unsigned char                                      UnknownData00[0x185BBB7C550];                             // 0x0000(0x185BBB7C550) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_ProxyMine");
		return ptr;
	}

};


// Class TgGame.TgDeploy_RespawnBeacon
// 0x185BBB7C790
class TgDeploy_RespawnBeacon
{
public:
	unsigned char                                      UnknownData00[0x185BBB7C790];                             // 0x0000(0x185BBB7C790) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_RespawnBeacon");
		return ptr;
	}

};


// Class TgGame.TgDeploy_Shield
// 0x185BBB69230
class TgDeploy_Shield
{
public:
	unsigned char                                      UnknownData00[0x185BBB69230];                             // 0x0000(0x185BBB69230) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeploy_Shield");
		return ptr;
	}

};


// Class TgGame.TgProjectile
// 0x185B48293B0
class TgProjectile
{
public:
	unsigned char                                      UnknownData00[0x185B48293B0];                             // 0x0000(0x185B48293B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgProjectile");
		return ptr;
	}

};


// Class TgGame.TgProj_NonSimulated
// 0x185B89447F0
class TgProj_NonSimulated
{
public:
	unsigned char                                      UnknownData00[0x185B89447F0];                             // 0x0000(0x185B89447F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgProj_NonSimulated");
		return ptr;
	}

};


// Class TgGame.TgProj_Simulated
// 0x185B482B0F0
class TgProj_Simulated
{
public:
	unsigned char                                      UnknownData00[0x185B482B0F0];                             // 0x0000(0x185B482B0F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgProj_Simulated");
		return ptr;
	}

};


// Class TgGame.TgProj_Bombardment
// 0x185B62DA6B0
class TgProj_Bombardment
{
public:
	unsigned char                                      UnknownData00[0x185B62DA6B0];                             // 0x0000(0x185B62DA6B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgProj_Bombardment");
		return ptr;
	}

};


// Class TgGame.TgProj_FreeGrenade
// 0x185B482DA90
class TgProj_FreeGrenade
{
public:
	unsigned char                                      UnknownData00[0x185B482DA90];                             // 0x0000(0x185B482DA90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgProj_FreeGrenade");
		return ptr;
	}

};


// Class TgGame.TgProj_SpeedOverTime
// 0x0000
class TgProj_SpeedOverTime
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgProj_SpeedOverTime");
		return ptr;
	}

};


// Class TgGame.TgProj_SpeedOverRange
// 0x0000
class TgProj_SpeedOverRange
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgProj_SpeedOverRange");
		return ptr;
	}

};


// Class TgGame.TgProj_ExtraColliders
// 0x185B61C03A0
class TgProj_ExtraColliders
{
public:
	unsigned char                                      UnknownData00[0x185B61C03A0];                             // 0x0000(0x185B61C03A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgProj_ExtraColliders");
		return ptr;
	}

};


// Class TgGame.TgAudioComponent
// 0x185BBD36040
class TgAudioComponent
{
public:
	unsigned char                                      UnknownData00[0x185BBD36040];                             // 0x0000(0x185BBD36040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAudioComponent");
		return ptr;
	}

};


// Class TgGame.TgAudioComponent_ModByVelocity
// 0x0000
class TgAudioComponent_ModByVelocity
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAudioComponent_ModByVelocity");
		return ptr;
	}

};


// Class TgGame.TgDecalManager
// 0x0000
class TgDecalManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDecalManager");
		return ptr;
	}

};


// Class TgGame.TgEmitter
// 0x185B481E550
class TgEmitter
{
public:
	unsigned char                                      UnknownData00[0x185B481E550];                             // 0x0000(0x185B481E550) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEmitter");
		return ptr;
	}

};


// Class TgGame.TgEmitter_CameraEffect
// 0x185B4820050
class TgEmitter_CameraEffect
{
public:
	unsigned char                                      UnknownData00[0x185B4820050];                             // 0x0000(0x185B4820050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEmitter_CameraEffect");
		return ptr;
	}

};


// Class TgGame.TgEmitter_CameraEffect_DamageBase
// 0x185B481E430
class TgEmitter_CameraEffect_DamageBase
{
public:
	unsigned char                                      UnknownData00[0x185B481E430];                             // 0x0000(0x185B481E430) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEmitter_CameraEffect_DamageBase");
		return ptr;
	}

};


// Class TgGame.TgEmitter_CameraEffect_LowHealth
// 0x185B4820DD0
class TgEmitter_CameraEffect_LowHealth
{
public:
	unsigned char                                      UnknownData00[0x185B4820DD0];                             // 0x0000(0x185B4820DD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEmitter_CameraEffect_LowHealth");
		return ptr;
	}

};


// Class TgGame.TgEmitter_TeamColor
// 0x185B48204D0
class TgEmitter_TeamColor
{
public:
	unsigned char                                      UnknownData00[0x185B48204D0];                             // 0x0000(0x185B48204D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEmitter_TeamColor");
		return ptr;
	}

};


// Class TgGame.TgEmitterSpawnable
// 0x0000
class TgEmitterSpawnable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEmitterSpawnable");
		return ptr;
	}

};


// Class TgGame.TgImpactFx
// 0x185B4829A70
class TgImpactFx
{
public:
	unsigned char                                      UnknownData00[0x185B4829A70];                             // 0x0000(0x185B4829A70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgImpactFx");
		return ptr;
	}

};


// Class TgGame.TgParticleModuleTypeDataLight
// 0x185BA54C040
class TgParticleModuleTypeDataLight
{
public:
	unsigned char                                      UnknownData00[0x185BA54C040];                             // 0x0000(0x185BA54C040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgParticleModuleTypeDataLight");
		return ptr;
	}

};


// Class TgGame.TgPhysicalMaterialProperty
// 0x185B634DA80
class TgPhysicalMaterialProperty
{
public:
	unsigned char                                      UnknownData00[0x185B634DA80];                             // 0x0000(0x185B634DA80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPhysicalMaterialProperty");
		return ptr;
	}

};


// Class TgGame.TgSilhouetteComponentPaladins
// 0x185B482C0B0
class TgSilhouetteComponentPaladins
{
public:
	unsigned char                                      UnknownData00[0x185B482C0B0];                             // 0x0000(0x185B482C0B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSilhouetteComponentPaladins");
		return ptr;
	}

};


// Class TgGame.TgSilhouetteComponentPaladinsDeployable
// 0x0000
class TgSilhouetteComponentPaladinsDeployable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSilhouetteComponentPaladinsDeployable");
		return ptr;
	}

};


// Class TgGame.TgSilhouetteComponentPaladinsPawn
// 0x0000
class TgSilhouetteComponentPaladinsPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSilhouetteComponentPaladinsPawn");
		return ptr;
	}

};


// Class TgGame.TgSilhouetteComponentPayload
// 0x0000
class TgSilhouetteComponentPayload
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSilhouetteComponentPayload");
		return ptr;
	}

};


// Class TgGame.TgSilhouetteManager
// 0x185BCD146F0
class TgSilhouetteManager
{
public:
	unsigned char                                      UnknownData00[0x185BCD146F0];                             // 0x0000(0x185BCD146F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSilhouetteManager");
		return ptr;
	}

};


// Class TgGame.TgSoundGroup
// 0x185BCD18950
class TgSoundGroup
{
public:
	unsigned char                                      UnknownData00[0x185BCD18950];                             // 0x0000(0x185BCD18950) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSoundGroup");
		return ptr;
	}

};


// Class TgGame.TgSpecialFx
// 0x185BBD4A7A0
class TgSpecialFx
{
public:
	unsigned char                                      UnknownData00[0x185BBD4A7A0];                             // 0x0000(0x185BBD4A7A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSpecialFx");
		return ptr;
	}

};


// Class TgGame.TgSpecialFxLightManager
// 0x185BCD16D30
class TgSpecialFxLightManager
{
public:
	unsigned char                                      UnknownData00[0x185BCD16D30];                             // 0x0000(0x185BCD16D30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSpecialFxLightManager");
		return ptr;
	}

};


// Class TgGame.TgEffect
// 0x185B595F0B0
class TgEffect
{
public:
	unsigned char                                      UnknownData00[0x185B595F0B0];                             // 0x0000(0x185B595F0B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffect");
		return ptr;
	}

};


// Class TgGame.TgEffect_Lift
// 0x185B595DEB0
class TgEffect_Lift
{
public:
	unsigned char                                      UnknownData00[0x185B595DEB0];                             // 0x0000(0x185B595DEB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffect_Lift");
		return ptr;
	}

};


// Class TgGame.TgEffectDamage
// 0x185B595E210
class TgEffectDamage
{
public:
	unsigned char                                      UnknownData00[0x185B595E210];                             // 0x0000(0x185B595E210) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectDamage");
		return ptr;
	}

};


// Class TgGame.TgEffectDamage_AstroDOT
// 0x185B595F650
class TgEffectDamage_AstroDOT
{
public:
	unsigned char                                      UnknownData00[0x185B595F650];                             // 0x0000(0x185B595F650) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectDamage_AstroDOT");
		return ptr;
	}

};


// Class TgGame.TgEffectDamage_Execute
// 0x185B5962350
class TgEffectDamage_Execute
{
public:
	unsigned char                                      UnknownData00[0x185B5962350];                             // 0x0000(0x185B5962350) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectDamage_Execute");
		return ptr;
	}

};


// Class TgGame.TgEffectDamage_PresenceDoT
// 0x185B5962C50
class TgEffectDamage_PresenceDoT
{
public:
	unsigned char                                      UnknownData00[0x185B5962C50];                             // 0x0000(0x185B5962C50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectDamage_PresenceDoT");
		return ptr;
	}

};


// Class TgGame.TgEffectHeal
// 0x185B5925BD0
class TgEffectHeal
{
public:
	unsigned char                                      UnknownData00[0x185B5925BD0];                             // 0x0000(0x185B5925BD0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectHeal");
		return ptr;
	}

};


// Class TgGame.TgEffectModifyDeployable
// 0x185B481A9B0
class TgEffectModifyDeployable
{
public:
	unsigned char                                      UnknownData00[0x185B481A9B0];                             // 0x0000(0x185B481A9B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectModifyDeployable");
		return ptr;
	}

};


// Class TgGame.TgEffectModifyEffect
// 0x185B481BA90
class TgEffectModifyEffect
{
public:
	unsigned char                                      UnknownData00[0x185B481BA90];                             // 0x0000(0x185B481BA90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectModifyEffect");
		return ptr;
	}

};


// Class TgGame.TgEffectModifyProperty
// 0x185B481FCF0
class TgEffectModifyProperty
{
public:
	unsigned char                                      UnknownData00[0x185B481FCF0];                             // 0x0000(0x185B481FCF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectModifyProperty");
		return ptr;
	}

};


// Class TgGame.TgEffectModifyProperty_AltFire
// 0x185B9E26EB0
class TgEffectModifyProperty_AltFire
{
public:
	unsigned char                                      UnknownData00[0x185B9E26EB0];                             // 0x0000(0x185B9E26EB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectModifyProperty_AltFire");
		return ptr;
	}

};


// Class TgGame.TgEffectModifyProperty_Child
// 0x0000
class TgEffectModifyProperty_Child
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectModifyProperty_Child");
		return ptr;
	}

};


// Class TgGame.TgEffectModifyProperty_Child_FireMode1
// 0x0000
class TgEffectModifyProperty_Child_FireMode1
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectModifyProperty_Child_FireMode1");
		return ptr;
	}

};


// Class TgGame.TgEffectModifyProperty_Child_FireMode2
// 0x0000
class TgEffectModifyProperty_Child_FireMode2
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectModifyProperty_Child_FireMode2");
		return ptr;
	}

};


// Class TgGame.TgEffectModifyProperty_Child_FireMode3
// 0x0000
class TgEffectModifyProperty_Child_FireMode3
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectModifyProperty_Child_FireMode3");
		return ptr;
	}

};


// Class TgGame.TgEffectPermanent
// 0x185B481E1F0
class TgEffectPermanent
{
public:
	unsigned char                                      UnknownData00[0x185B481E1F0];                             // 0x0000(0x185B481E1F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectPermanent");
		return ptr;
	}

};


// Class TgGame.TgEffectForm
// 0x185B5963790
class TgEffectForm
{
public:
	unsigned char                                      UnknownData00[0x185B5963790];                             // 0x0000(0x185B5963790) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectForm");
		return ptr;
	}

};


// Class TgGame.TgEffectForm_BuffBelt
// 0x185B9E16230
class TgEffectForm_BuffBelt
{
public:
	unsigned char                                      UnknownData00[0x185B9E16230];                             // 0x0000(0x185B9E16230) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectForm_BuffBelt");
		return ptr;
	}

};


// Class TgGame.TgEffectForm_DisablePawn
// 0x185B5962E90
class TgEffectForm_DisablePawn
{
public:
	unsigned char                                      UnknownData00[0x185B5962E90];                             // 0x0000(0x185B5962E90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectForm_DisablePawn");
		return ptr;
	}

};


// Class TgGame.TgEffectForm_Freeze
// 0x185B5963550
class TgEffectForm_Freeze
{
public:
	unsigned char                                      UnknownData00[0x185B5963550];                             // 0x0000(0x185B5963550) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectForm_Freeze");
		return ptr;
	}

};


// Class TgGame.TgEffectForm_WithMeshes
// 0x185B5927490
class TgEffectForm_WithMeshes
{
public:
	unsigned char                                      UnknownData00[0x185B5927490];                             // 0x0000(0x185B5927490) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectForm_WithMeshes");
		return ptr;
	}

};


// Class TgGame.TgEffectGroup
// 0x185B59241F0
class TgEffectGroup
{
public:
	unsigned char                                      UnknownData00[0x185B59241F0];                             // 0x0000(0x185B59241F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectGroup");
		return ptr;
	}

};


// Class TgGame.TgEffectManager
// 0x185BD2657D0
class TgEffectManager
{
public:
	unsigned char                                      UnknownData00[0x185BD2657D0];                             // 0x0000(0x185BD2657D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgEffectManager");
		return ptr;
	}

};


// Class TgGame.TgActorFactory
// 0x185BB4A58F0
class TgActorFactory
{
public:
	unsigned char                                      UnknownData00[0x185BB4A58F0];                             // 0x0000(0x185BB4A58F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgActorFactory");
		return ptr;
	}

};


// Class TgGame.TgBotFactory
// 0x185BBD12280
class TgBotFactory
{
public:
	unsigned char                                      UnknownData00[0x185BBD12280];                             // 0x0000(0x185BBD12280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgBotFactory");
		return ptr;
	}

};


// Class TgGame.TgBotFactory_BonusTrigger
// 0x0000
class TgBotFactory_BonusTrigger
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgBotFactory_BonusTrigger");
		return ptr;
	}

};


// Class TgGame.TgBotFactory_Leashed
// 0x185BBD0F220
class TgBotFactory_Leashed
{
public:
	unsigned char                                      UnknownData00[0x185BBD0F220];                             // 0x0000(0x185BBD0F220) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgBotFactory_Leashed");
		return ptr;
	}

};


// Class TgGame.TgBotFactory_PointCapture
// 0x185BBD10D20
class TgBotFactory_PointCapture
{
public:
	unsigned char                                      UnknownData00[0x185BBD10D20];                             // 0x0000(0x185BBD10D20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgBotFactory_PointCapture");
		return ptr;
	}

};


// Class TgGame.TgBotFactory_Minions
// 0x185BBD12040
class TgBotFactory_Minions
{
public:
	unsigned char                                      UnknownData00[0x185BBD12040];                             // 0x0000(0x185BBD12040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgBotFactory_Minions");
		return ptr;
	}

};


// Class TgGame.TgBotFactorySpawnable
// 0x0000
class TgBotFactorySpawnable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgBotFactorySpawnable");
		return ptr;
	}

};


// Class TgGame.TgDeployableFactory
// 0x185BBB811D0
class TgDeployableFactory
{
public:
	unsigned char                                      UnknownData00[0x185BBB811D0];                             // 0x0000(0x185BBB811D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDeployableFactory");
		return ptr;
	}

};


// Class TgGame.TgDestructibleFactory
// 0x185BBB81890
class TgDestructibleFactory
{
public:
	unsigned char                                      UnknownData00[0x185BBB81890];                             // 0x0000(0x185BBB81890) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDestructibleFactory");
		return ptr;
	}

};


// Class TgGame.TgBotFactoryComponent
// 0x0000
class TgBotFactoryComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgBotFactoryComponent");
		return ptr;
	}

};


// Class TgGame.TgGameplayEventsWriter
// 0x185BC784C40
class TgGameplayEventsWriter
{
public:
	unsigned char                                      UnknownData00[0x185BC784C40];                             // 0x0000(0x185BC784C40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgGameplayEventsWriter");
		return ptr;
	}

};


// Class TgGame.TgAkAudioManagement
// 0x185B85A5C50
class TgAkAudioManagement
{
public:
	unsigned char                                      UnknownData00[0x185B85A5C50];                             // 0x0000(0x185B85A5C50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAkAudioManagement");
		return ptr;
	}

};


// Class TgGame.TgInteractiveAudio
// 0x0000
class TgInteractiveAudio
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInteractiveAudio");
		return ptr;
	}

};


// Class TgGame.TgSoundNotifyActorInterface
// 0x185BB4B1CB0
class TgSoundNotifyActorInterface
{
public:
	unsigned char                                      UnknownData00[0x185BB4B1CB0];                             // 0x0000(0x185BB4B1CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSoundNotifyActorInterface");
		return ptr;
	}

};


// Class TgGame.TgGrabSource
// 0x185B5E92040
class TgGrabSource
{
public:
	unsigned char                                      UnknownData00[0x185B5E92040];                             // 0x0000(0x185B5E92040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgGrabSource");
		return ptr;
	}

};


// Class TgGame.TgSoundEventsManager
// 0x185BCD16670
class TgSoundEventsManager
{
public:
	unsigned char                                      UnknownData00[0x185BCD16670];                             // 0x0000(0x185BCD16670) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSoundEventsManager");
		return ptr;
	}

};


// Class TgGame.TgDroppedItem
// 0x185B5A79FC0
class TgDroppedItem
{
public:
	unsigned char                                      UnknownData00[0x185B5A79FC0];                             // 0x0000(0x185B5A79FC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDroppedItem");
		return ptr;
	}

};


// Class TgGame.TgInventoryManager
// 0x185BC78C020
class TgInventoryManager
{
public:
	unsigned char                                      UnknownData00[0x185BC78C020];                             // 0x0000(0x185BC78C020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryManager");
		return ptr;
	}

};


// Class TgGame.TgInventoryManager_Player
// 0x185BC78D340
class TgInventoryManager_Player
{
public:
	unsigned char                                      UnknownData00[0x185BC78D340];                             // 0x0000(0x185BC78D340) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryManager_Player");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject
// 0x185B8582E50
class TgInventoryObject
{
public:
	unsigned char                                      UnknownData00[0x185B8582E50];                             // 0x0000(0x185B8582E50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Device
// 0x185BC790940
class TgInventoryObject_Device
{
public:
	unsigned char                                      UnknownData00[0x185BC790940];                             // 0x0000(0x185BC790940) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Device");
		return ptr;
	}

};


// Class TgGame.TgInvListener
// 0x0000
class TgInvListener
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AbilityProcBase
// 0x185B63512C0
class TgInventoryObject_Listen_AbilityProcBase
{
public:
	unsigned char                                      UnknownData00[0x185B63512C0];                             // 0x0000(0x185B63512C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AbilityProcBase");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AbilityInstant
// 0x0000
class TgInventoryObject_Listen_AbilityInstant
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AbilityInstant");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Ability
// 0x0000
class TgInventoryObject_Listen_Ability
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Ability");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_UseWhileCCed
// 0x185B63527C0
class TgInventoryObject_Listen_UseWhileCCed
{
public:
	unsigned char                                      UnknownData00[0x185B63527C0];                             // 0x0000(0x185B63527C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_UseWhileCCed");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AbilityEnd
// 0x0000
class TgInventoryObject_Listen_AbilityEnd
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AbilityEnd");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AbilityEndTargetFiremodeOnly
// 0x0000
class TgInventoryObject_Listen_AbilityEndTargetFiremodeOnly
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AbilityEndTargetFiremodeOnly");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ReduceOtherCooldownOnStopFire
// 0x0000
class TgInventoryObject_Listen_ReduceOtherCooldownOnStopFire
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ReduceOtherCooldownOnStopFire");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AbilityStart
// 0x0000
class TgInventoryObject_Listen_AbilityStart
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AbilityStart");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AbilityStart_LowHealth
// 0x0000
class TgInventoryObject_Listen_AbilityStart_LowHealth
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AbilityStart_LowHealth");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Kindling
// 0x0000
class TgInventoryObject_Listen_Kindling
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Kindling");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ReduceOtherCooldownOnStartFire
// 0x0000
class TgInventoryObject_Listen_ReduceOtherCooldownOnStartFire
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ReduceOtherCooldownOnStartFire");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AbilityProcDeployables
// 0x0000
class TgInventoryObject_Listen_AbilityProcDeployables
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AbilityProcDeployables");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AddShieldDamage
// 0x0000
class TgInventoryObject_Listen_AddShieldDamage
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AddShieldDamage");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo
// 0x185BC78EF60
class TgInventoryObject_Listen_Combo
{
public:
	unsigned char                                      UnknownData00[0x185BC78EF60];                             // 0x0000(0x185BC78EF60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Barik
// 0x185BC790A60
class TgInventoryObject_Listen_Combo_Barik
{
public:
	unsigned char                                      UnknownData00[0x185BC790A60];                             // 0x0000(0x185BC790A60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Barik");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_BombKing
// 0x185C1202110
class TgInventoryObject_Listen_Combo_BombKing
{
public:
	unsigned char                                      UnknownData00[0x185C1202110];                             // 0x0000(0x185C1202110) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_BombKing");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Buck
// 0x0000
class TgInventoryObject_Listen_Combo_Buck
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Buck");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Cassie
// 0x185B6355400
class TgInventoryObject_Listen_Combo_Cassie
{
public:
	unsigned char                                      UnknownData00[0x185B6355400];                             // 0x0000(0x185B6355400) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Cassie");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Drogoz
// 0x185B6356900
class TgInventoryObject_Listen_Combo_Drogoz
{
public:
	unsigned char                                      UnknownData00[0x185B6356900];                             // 0x0000(0x185B6356900) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Drogoz");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Evie
// 0x185BC78E9C0
class TgInventoryObject_Listen_Combo_Evie
{
public:
	unsigned char                                      UnknownData00[0x185BC78E9C0];                             // 0x0000(0x185BC78E9C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Evie");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Fernando
// 0x185C1202610
class TgInventoryObject_Listen_Combo_Fernando
{
public:
	unsigned char                                      UnknownData00[0x185C1202610];                             // 0x0000(0x185C1202610) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Fernando");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Grohk
// 0x185B6355700
class TgInventoryObject_Listen_Combo_Grohk
{
public:
	unsigned char                                      UnknownData00[0x185B6355700];                             // 0x0000(0x185B6355700) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Grohk");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Grover
// 0x185C1203470
class TgInventoryObject_Listen_Combo_Grover
{
public:
	unsigned char                                      UnknownData00[0x185C1203470];                             // 0x0000(0x185C1203470) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Grover");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Kinessa
// 0x185BC78FF20
class TgInventoryObject_Listen_Combo_Kinessa
{
public:
	unsigned char                                      UnknownData00[0x185BC78FF20];                             // 0x0000(0x185BC78FF20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Kinessa");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Makoa
// 0x185B6356D80
class TgInventoryObject_Listen_Combo_Makoa
{
public:
	unsigned char                                      UnknownData00[0x185B6356D80];                             // 0x0000(0x185B6356D80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Makoa");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Pip
// 0x185B6356C00
class TgInventoryObject_Listen_Combo_Pip
{
public:
	unsigned char                                      UnknownData00[0x185B6356C00];                             // 0x0000(0x185B6356C00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Pip");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Ruckus
// 0x185B6357080
class TgInventoryObject_Listen_Combo_Ruckus
{
public:
	unsigned char                                      UnknownData00[0x185B6357080];                             // 0x0000(0x185B6357080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Ruckus");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Skye
// 0x185B6356180
class TgInventoryObject_Listen_Combo_Skye
{
public:
	unsigned char                                      UnknownData00[0x185B6356180];                             // 0x0000(0x185B6356180) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Skye");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Viktor
// 0x185B6355040
class TgInventoryObject_Listen_Combo_Viktor
{
public:
	unsigned char                                      UnknownData00[0x185B6355040];                             // 0x0000(0x185B6355040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Viktor");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Combo_Ying
// 0x185B635A080
class TgInventoryObject_Listen_Combo_Ying
{
public:
	unsigned char                                      UnknownData00[0x185B635A080];                             // 0x0000(0x185B635A080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Combo_Ying");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_DeployOnAbility
// 0x185B6357BC0
class TgInventoryObject_Listen_DeployOnAbility
{
public:
	unsigned char                                      UnknownData00[0x185B6357BC0];                             // 0x0000(0x185B6357BC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_DeployOnAbility");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_DeployWithProjectile
// 0x0000
class TgInventoryObject_Listen_DeployWithProjectile
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_DeployWithProjectile");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_DirectHit
// 0x0000
class TgInventoryObject_Listen_DirectHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_DirectHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_DuringAbility
// 0x185C1201D50
class TgInventoryObject_Listen_DuringAbility
{
public:
	unsigned char                                      UnknownData00[0x185C1201D50];                             // 0x0000(0x185C1201D50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_DuringAbility");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ActiveDuringAbility
// 0x0000
class TgInventoryObject_Listen_ActiveDuringAbility
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ActiveDuringAbility");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ActiveDuringAbility_NotFiringInhand
// 0x0000
class TgInventoryObject_Listen_ActiveDuringAbility_NotFiringInhand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ActiveDuringAbility_NotFiringInhand");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ActiveDuringAbility_WhileOutOfCombat
// 0x185B63536C0
class TgInventoryObject_Listen_ActiveDuringAbility_WhileOutOfCombat
{
public:
	unsigned char                                      UnknownData00[0x185B63536C0];                             // 0x0000(0x185B63536C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ActiveDuringAbility_WhileOutOfCombat");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ActiveMovementHit
// 0x0000
class TgInventoryObject_Listen_ActiveMovementHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ActiveMovementHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_BowlingBall
// 0x185B6351C80
class TgInventoryObject_Listen_BowlingBall
{
public:
	unsigned char                                      UnknownData00[0x185B6351C80];                             // 0x0000(0x185B6351C80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_BowlingBall");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_LastStand
// 0x185B6358040
class TgInventoryObject_Listen_LastStand
{
public:
	unsigned char                                      UnknownData00[0x185B6358040];                             // 0x0000(0x185B6358040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_LastStand");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Mount
// 0x0000
class TgInventoryObject_Listen_Mount
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Mount");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_MountShield
// 0x185B635AB00
class TgInventoryObject_Listen_MountShield
{
public:
	unsigned char                                      UnknownData00[0x185B635AB00];                             // 0x0000(0x185B635AB00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_MountShield");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Proximity
// 0x0000
class TgInventoryObject_Listen_Proximity
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Proximity");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Undying
// 0x0000
class TgInventoryObject_Listen_Undying
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Undying");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_DeployedDuringAbility
// 0x0000
class TgInventoryObject_Listen_DeployedDuringAbility
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_DeployedDuringAbility");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_EmitterEffect
// 0x0000
class TgInventoryObject_Listen_EmitterEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_EmitterEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FiringDuringAbility
// 0x0000
class TgInventoryObject_Listen_FiringDuringAbility
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FiringDuringAbility");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FiringDuringAbilityAltMode
// 0x0000
class TgInventoryObject_Listen_FiringDuringAbilityAltMode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FiringDuringAbilityAltMode");
		return ptr;
	}

};


// Class TgGame.TgInvListener_OnDamagedDuringAbility
// 0x0000
class TgInvListener_OnDamagedDuringAbility
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_OnDamagedDuringAbility");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Exhilarate
// 0x0000
class TgInventoryObject_Listen_Exhilarate
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Exhilarate");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireOnKillWithChildDevice
// 0x0000
class TgInventoryObject_Listen_FireOnKillWithChildDevice
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireOnKillWithChildDevice");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireOnMiss
// 0x0000
class TgInventoryObject_Listen_FireOnMiss
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireOnMiss");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireWithProjectile
// 0x0000
class TgInventoryObject_Listen_FireWithProjectile
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireWithProjectile");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FullBurstHit
// 0x185B6357800
class TgInventoryObject_Listen_FullBurstHit
{
public:
	unsigned char                                      UnknownData00[0x185B6357800];                             // 0x0000(0x185B6357800) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FullBurstHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_GiftGiver
// 0x185B6358DC0
class TgInventoryObject_Listen_GiftGiver
{
public:
	unsigned char                                      UnknownData00[0x185B6358DC0];                             // 0x0000(0x185B6358DC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_GiftGiver");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HitStealthTarget
// 0x0000
class TgInventoryObject_Listen_HitStealthTarget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HitStealthTarget");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HitWithDevice
// 0x185B6357680
class TgInventoryObject_Listen_HitWithDevice
{
public:
	unsigned char                                      UnknownData00[0x185B6357680];                             // 0x0000(0x185B6357680) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HitWithDevice");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HitWithDeviceOrChildItems
// 0x0000
class TgInventoryObject_Listen_HitWithDeviceOrChildItems
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HitWithDeviceOrChildItems");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HitWithInhandWhileDeviceFiring
// 0x0000
class TgInventoryObject_Listen_HitWithInhandWhileDeviceFiring
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HitWithInhandWhileDeviceFiring");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ReduceOtherCooldownOnHit
// 0x0000
class TgInventoryObject_Listen_ReduceOtherCooldownOnHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ReduceOtherCooldownOnHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Weaken
// 0x185B635B400
class TgInventoryObject_Listen_Weaken
{
public:
	unsigned char                                      UnknownData00[0x185B635B400];                             // 0x0000(0x185B635B400) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Weaken");
		return ptr;
	}

};


// Class TgGame.TgInvListener_HitWithDeviceFiremode
// 0x0000
class TgInvListener_HitWithDeviceFiremode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_HitWithDeviceFiremode");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HitWithDeviceSpecial
// 0x185B6359840
class TgInventoryObject_Listen_HitWithDeviceSpecial
{
public:
	unsigned char                                      UnknownData00[0x185B6359840];                             // 0x0000(0x185B6359840) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HitWithDeviceSpecial");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HitWithPetDevice
// 0x185B63578C0
class TgInventoryObject_Listen_HitWithPetDevice
{
public:
	unsigned char                                      UnknownData00[0x185B63578C0];                             // 0x0000(0x185B63578C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HitWithPetDevice");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ImpalerArrowHit
// 0x0000
class TgInventoryObject_Listen_ImpalerArrowHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ImpalerArrowHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_LoogieExplodedHit
// 0x185B63599C0
class TgInventoryObject_Listen_LoogieExplodedHit
{
public:
	unsigned char                                      UnknownData00[0x185B63599C0];                             // 0x0000(0x185B63599C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_LoogieExplodedHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_LoogieHit
// 0x185B6359F00
class TgInventoryObject_Listen_LoogieHit
{
public:
	unsigned char                                      UnknownData00[0x185B6359F00];                             // 0x0000(0x185B6359F00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_LoogieHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_MendingSpiritsActive
// 0x185B6357B00
class TgInventoryObject_Listen_MendingSpiritsActive
{
public:
	unsigned char                                      UnknownData00[0x185B6357B00];                             // 0x0000(0x185B6357B00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_MendingSpiritsActive");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_MirrorDamageToHeal
// 0x185B63587C0
class TgInventoryObject_Listen_MirrorDamageToHeal
{
public:
	unsigned char                                      UnknownData00[0x185B63587C0];                             // 0x0000(0x185B63587C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_MirrorDamageToHeal");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_MirrorInhandDamageToHeal
// 0x0000
class TgInventoryObject_Listen_MirrorInhandDamageToHeal
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_MirrorInhandDamageToHeal");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_MirrorPetDamageToHeal
// 0x185B635B700
class TgInventoryObject_Listen_MirrorPetDamageToHeal
{
public:
	unsigned char                                      UnknownData00[0x185B635B700];                             // 0x0000(0x185B635B700) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_MirrorPetDamageToHeal");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_PoisonBolts
// 0x185B635A800
class TgInventoryObject_Listen_PoisonBolts
{
public:
	unsigned char                                      UnknownData00[0x185B635A800];                             // 0x0000(0x185B635A800) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_PoisonBolts");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ReduceSelfDamageDeployable
// 0x0000
class TgInventoryObject_Listen_ReduceSelfDamageDeployable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ReduceSelfDamageDeployable");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ReduceSelfDamageProjectile
// 0x0000
class TgInventoryObject_Listen_ReduceSelfDamageProjectile
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ReduceSelfDamageProjectile");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ReloadCard
// 0x185B635A680
class TgInventoryObject_Listen_ReloadCard
{
public:
	unsigned char                                      UnknownData00[0x185B635A680];                             // 0x0000(0x185B635A680) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ReloadCard");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_TagForLifesteal
// 0x185B635C240
class TgInventoryObject_Listen_TagForLifesteal
{
public:
	unsigned char                                      UnknownData00[0x185B635C240];                             // 0x0000(0x185B635C240) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_TagForLifesteal");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Thunderstruck
// 0x185B635C000
class TgInventoryObject_Listen_Thunderstruck
{
public:
	unsigned char                                      UnknownData00[0x185B635C000];                             // 0x0000(0x185B635C000) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Thunderstruck");
		return ptr;
	}

};


// Class TgGame.TgInvListener_DeathAfterHit
// 0x185B635C300
class TgInvListener_DeathAfterHit
{
public:
	unsigned char                                      UnknownData00[0x185B635C300];                             // 0x0000(0x185B635C300) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_DeathAfterHit");
		return ptr;
	}

};


// Class TgGame.TgInvListener_DeployWithProjectileOnWall
// 0x0000
class TgInvListener_DeployWithProjectileOnWall
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_DeployWithProjectileOnWall");
		return ptr;
	}

};


// Class TgGame.TgInvListener_HeadshotBonusDamage
// 0x0000
class TgInvListener_HeadshotBonusDamage
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_HeadshotBonusDamage");
		return ptr;
	}

};


// Class TgGame.TgInvListener_HitSelfOnDamageOrHeal
// 0x0000
class TgInvListener_HitSelfOnDamageOrHeal
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_HitSelfOnDamageOrHeal");
		return ptr;
	}

};


// Class TgGame.TgInvListener_SetInhandFiremodeAfterDeviceFired
// 0x185B635D680
class TgInvListener_SetInhandFiremodeAfterDeviceFired
{
public:
	unsigned char                                      UnknownData00[0x185B635D680];                             // 0x0000(0x185B635D680) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_SetInhandFiremodeAfterDeviceFired");
		return ptr;
	}

};


// Class TgGame.TgInvListener_SoulChargesActive
// 0x185B635F0C0
class TgInvListener_SoulChargesActive
{
public:
	unsigned char                                      UnknownData00[0x185B635F0C0];                             // 0x0000(0x185B635F0C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_SoulChargesActive");
		return ptr;
	}

};


// Class TgGame.TgInvListener_SoulChargesConsumed
// 0x185B635E940
class TgInvListener_SoulChargesConsumed
{
public:
	unsigned char                                      UnknownData00[0x185B635E940];                             // 0x0000(0x185B635E940) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_SoulChargesConsumed");
		return ptr;
	}

};


// Class TgGame.TgInvListener_TargetOverHealed
// 0x185B635FC00
class TgInvListener_TargetOverHealed
{
public:
	unsigned char                                      UnknownData00[0x185B635FC00];                             // 0x0000(0x185B635FC00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_TargetOverHealed");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AbilityShieldDamage
// 0x0000
class TgInventoryObject_Listen_AbilityShieldDamage
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AbilityShieldDamage");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ActiveDuringDimensionalLink
// 0x185B6353900
class TgInventoryObject_Listen_ActiveDuringDimensionalLink
{
public:
	unsigned char                                      UnknownData00[0x185B6353900];                             // 0x0000(0x185B6353900) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ActiveDuringDimensionalLink");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ActiveWhileInGrass
// 0x185B6351500
class TgInventoryObject_Listen_ActiveWhileInGrass
{
public:
	unsigned char                                      UnknownData00[0x185B6351500];                             // 0x0000(0x185B6351500) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ActiveWhileInGrass");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ActiveWhileOffCooldown
// 0x185B6351980
class TgInventoryObject_Listen_ActiveWhileOffCooldown
{
public:
	unsigned char                                      UnknownData00[0x185B6351980];                             // 0x0000(0x185B6351980) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ActiveWhileOffCooldown");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Accelerant
// 0x0000
class TgInventoryObject_Listen_Accelerant
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Accelerant");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ActiveWhileDeployableActive
// 0x185B6351A40
class TgInventoryObject_Listen_ActiveWhileDeployableActive
{
public:
	unsigned char                                      UnknownData00[0x185B6351A40];                             // 0x0000(0x185B6351A40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ActiveWhileDeployableActive");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ActiveWhileDeployableInactive
// 0x185B6352C40
class TgInventoryObject_Listen_ActiveWhileDeployableInactive
{
public:
	unsigned char                                      UnknownData00[0x185B6352C40];                             // 0x0000(0x185B6352C40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ActiveWhileDeployableInactive");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AtTheReady
// 0x0000
class TgInventoryObject_Listen_AtTheReady
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AtTheReady");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Compensate
// 0x0000
class TgInventoryObject_Listen_Compensate
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Compensate");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Featherweight
// 0x0000
class TgInventoryObject_Listen_Featherweight
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Featherweight");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_LiftOff
// 0x0000
class TgInventoryObject_Listen_LiftOff
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_LiftOff");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_MoraleBoost
// 0x0000
class TgInventoryObject_Listen_MoraleBoost
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_MoraleBoost");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ReduceInhandSelfDamage
// 0x0000
class TgInventoryObject_Listen_ReduceInhandSelfDamage
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ReduceInhandSelfDamage");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Sprint
// 0x0000
class TgInventoryObject_Listen_Sprint
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Sprint");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ExplosiveImpalerArrow
// 0x185B635AE00
class TgInvListener_ExplosiveImpalerArrow
{
public:
	unsigned char                                      UnknownData00[0x185B635AE00];                             // 0x0000(0x185B635AE00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ExplosiveImpalerArrow");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ReplaceCurveSets
// 0x0000
class TgInvListener_ReplaceCurveSets
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ReplaceCurveSets");
		return ptr;
	}

};


// Class TgGame.TgInvListener_SetChildDamageType
// 0x185B635E7C0
class TgInvListener_SetChildDamageType
{
public:
	unsigned char                                      UnknownData00[0x185B635E7C0];                             // 0x0000(0x185B635E7C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_SetChildDamageType");
		return ptr;
	}

};


// Class TgGame.TgInvListener_SetChildFiremode
// 0x0000
class TgInvListener_SetChildFiremode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_SetChildFiremode");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Jolt
// 0x0000
class TgInventoryObject_Listen_Jolt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Jolt");
		return ptr;
	}

};


// Class TgGame.TgInvListener_SetPetFiremode
// 0x0000
class TgInvListener_SetPetFiremode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_SetPetFiremode");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AddDamage
// 0x185B6351380
class TgInventoryObject_Listen_AddDamage
{
public:
	unsigned char                                      UnknownData00[0x185B6351380];                             // 0x0000(0x185B6351380) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AddDamage");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AddDamageMaxHealthPercent
// 0x0000
class TgInventoryObject_Listen_AddDamageMaxHealthPercent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AddDamageMaxHealthPercent");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AddDamagePerTarget
// 0x0000
class TgInventoryObject_Listen_AddDamagePerTarget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AddDamagePerTarget");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AddDamagePlusHit
// 0x0000
class TgInventoryObject_Listen_AddDamagePlusHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AddDamagePlusHit");
		return ptr;
	}

};


// Class TgGame.TgInvListener_AddDamageMissingHealth
// 0x0000
class TgInvListener_AddDamageMissingHealth
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_AddDamageMissingHealth");
		return ptr;
	}

};


// Class TgGame.TgInvListener_AddDamageMissingHealthPercent
// 0x0000
class TgInvListener_AddDamageMissingHealthPercent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_AddDamageMissingHealthPercent");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ConsumeMarksForDamage
// 0x185B635AD40
class TgInvListener_ConsumeMarksForDamage
{
public:
	unsigned char                                      UnknownData00[0x185B635AD40];                             // 0x0000(0x185B635AD40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ConsumeMarksForDamage");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ExtraDamageAboveHealthPercent
// 0x0000
class TgInvListener_ExtraDamageAboveHealthPercent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ExtraDamageAboveHealthPercent");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ExtraDamageBelowHealthPercent
// 0x0000
class TgInvListener_ExtraDamageBelowHealthPercent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ExtraDamageBelowHealthPercent");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ScaleDamageOverDistance
// 0x0000
class TgInvListener_ScaleDamageOverDistance
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ScaleDamageOverDistance");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AdrenalineJunkie
// 0x185B6351B00
class TgInventoryObject_Listen_AdrenalineJunkie
{
public:
	unsigned char                                      UnknownData00[0x185B6351B00];                             // 0x0000(0x185B6351B00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AdrenalineJunkie");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AffectedByDevice
// 0x0000
class TgInventoryObject_Listen_AffectedByDevice
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AffectedByDevice");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AffectedByDeviceActiveWhile
// 0x185B6351BC0
class TgInventoryObject_Listen_AffectedByDeviceActiveWhile
{
public:
	unsigned char                                      UnknownData00[0x185B6351BC0];                             // 0x0000(0x185B6351BC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AffectedByDeviceActiveWhile");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AffectedByDeviceDamage
// 0x0000
class TgInventoryObject_Listen_AffectedByDeviceDamage
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AffectedByDeviceDamage");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AffectedByDeviceKill
// 0x0000
class TgInventoryObject_Listen_AffectedByDeviceKill
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AffectedByDeviceKill");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AffectedByDeviceLifesteal
// 0x185B6353180
class TgInventoryObject_Listen_AffectedByDeviceLifesteal
{
public:
	unsigned char                                      UnknownData00[0x185B6353180];                             // 0x0000(0x185B6353180) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AffectedByDeviceLifesteal");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AffectedByDeviceTarget
// 0x185B6351EC0
class TgInventoryObject_Listen_AffectedByDeviceTarget
{
public:
	unsigned char                                      UnknownData00[0x185B6351EC0];                             // 0x0000(0x185B6351EC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AffectedByDeviceTarget");
		return ptr;
	}

};


// Class TgGame.TgInvListener_AffectedByDeviceApplyEffect
// 0x0000
class TgInvListener_AffectedByDeviceApplyEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_AffectedByDeviceApplyEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AirBlast
// 0x0000
class TgInventoryObject_Listen_AirBlast
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AirBlast");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ArcingBeam
// 0x0000
class TgInventoryObject_Listen_ArcingBeam
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ArcingBeam");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AuraMod
// 0x185B6351680
class TgInventoryObject_Listen_AuraMod
{
public:
	unsigned char                                      UnknownData00[0x185B6351680];                             // 0x0000(0x185B6351680) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AuraMod");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Backstab
// 0x0000
class TgInventoryObject_Listen_Backstab
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Backstab");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_BackstabExtraDamage
// 0x0000
class TgInventoryObject_Listen_BackstabExtraDamage
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_BackstabExtraDamage");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_BarricadeEffect
// 0x0000
class TgInventoryObject_Listen_BarricadeEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_BarricadeEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_BlastShotHitEffect
// 0x185B6352AC0
class TgInventoryObject_Listen_BlastShotHitEffect
{
public:
	unsigned char                                      UnknownData00[0x185B6352AC0];                             // 0x0000(0x185B6352AC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_BlastShotHitEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_CombatRepair
// 0x185B6351F80
class TgInventoryObject_Listen_CombatRepair
{
public:
	unsigned char                                      UnknownData00[0x185B6351F80];                             // 0x0000(0x185B6351F80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_CombatRepair");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Conduit
// 0x185B63581C0
class TgInventoryObject_Listen_Conduit
{
public:
	unsigned char                                      UnknownData00[0x185B63581C0];                             // 0x0000(0x185B63581C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Conduit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_CorvusUltDeployEffect
// 0x0000
class TgInventoryObject_Listen_CorvusUltDeployEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_CorvusUltDeployEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_DefianceHit
// 0x0000
class TgInventoryObject_Listen_DefianceHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_DefianceHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_DeployOnDeployable
// 0x185B6357A40
class TgInventoryObject_Listen_DeployOnDeployable
{
public:
	unsigned char                                      UnknownData00[0x185B6357A40];                             // 0x0000(0x185B6357A40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_DeployOnDeployable");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_DeployOnDeviceHit
// 0x0000
class TgInventoryObject_Listen_DeployOnDeviceHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_DeployOnDeviceHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_DoubleTap
// 0x185B6358C40
class TgInventoryObject_Listen_DoubleTap
{
public:
	unsigned char                                      UnknownData00[0x185B6358C40];                             // 0x0000(0x185B6358C40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_DoubleTap");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_EnergyCharge
// 0x185B6358F40
class TgInventoryObject_Listen_EnergyCharge
{
public:
	unsigned char                                      UnknownData00[0x185B6358F40];                             // 0x0000(0x185B6358F40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_EnergyCharge");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_EquivalentExchange
// 0x0000
class TgInventoryObject_Listen_EquivalentExchange
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_EquivalentExchange");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireInsteadOfDeath
// 0x185B6357440
class TgInventoryObject_Listen_FireInsteadOfDeath
{
public:
	unsigned char                                      UnknownData00[0x185B6357440];                             // 0x0000(0x185B6357440) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireInsteadOfDeath");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireOnDamageInterruptedStealth
// 0x0000
class TgInventoryObject_Listen_FireOnDamageInterruptedStealth
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireOnDamageInterruptedStealth");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireOnKill
// 0x0000
class TgInventoryObject_Listen_FireOnKill
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireOnKill");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireOnElimination
// 0x0000
class TgInventoryObject_Listen_FireOnElimination
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireOnElimination");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireOnLandAfterLeap
// 0x0000
class TgInventoryObject_Listen_FireOnLandAfterLeap
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireOnLandAfterLeap");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireOnLowHealth
// 0x185B6359D80
class TgInventoryObject_Listen_FireOnLowHealth
{
public:
	unsigned char                                      UnknownData00[0x185B6359D80];                             // 0x0000(0x185B6359D80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireOnLowHealth");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireOnTeleport
// 0x0000
class TgInventoryObject_Listen_FireOnTeleport
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireOnTeleport");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FireWithDeployable
// 0x0000
class TgInventoryObject_Listen_FireWithDeployable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FireWithDeployable");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FirstShotAfterMovementAbility
// 0x185B63539C0
class TgInventoryObject_Listen_FirstShotAfterMovementAbility
{
public:
	unsigned char                                      UnknownData00[0x185B63539C0];                             // 0x0000(0x185B63539C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FirstShotAfterMovementAbility");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Exaction
// 0x185B6357140
class TgInventoryObject_Listen_Exaction
{
public:
	unsigned char                                      UnknownData00[0x185B6357140];                             // 0x0000(0x185B6357140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Exaction");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FirstShotDuringOrAfterMovementAbility
// 0x185B63518C0
class TgInventoryObject_Listen_FirstShotDuringOrAfterMovementAbility
{
public:
	unsigned char                                      UnknownData00[0x185B63518C0];                             // 0x0000(0x185B63518C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FirstShotDuringOrAfterMovementAbility");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FirstShotDuringOrAfterStealth
// 0x185B63572C0
class TgInventoryObject_Listen_FirstShotDuringOrAfterStealth
{
public:
	unsigned char                                      UnknownData00[0x185B63572C0];                             // 0x0000(0x185B63572C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FirstShotDuringOrAfterStealth");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FragGrenade
// 0x0000
class TgInventoryObject_Listen_FragGrenade
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FragGrenade");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_GaleStorm
// 0x185B6359480
class TgInventoryObject_Listen_GaleStorm
{
public:
	unsigned char                                      UnknownData00[0x185B6359480];                             // 0x0000(0x185B6359480) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_GaleStorm");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_GourdEffect
// 0x0000
class TgInventoryObject_Listen_GourdEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_GourdEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Headhunter
// 0x0000
class TgInventoryObject_Listen_Headhunter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Headhunter");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HealthByPercent
// 0x185B6358A00
class TgInventoryObject_Listen_HealthByPercent
{
public:
	unsigned char                                      UnknownData00[0x185B6358A00];                             // 0x0000(0x185B6358A00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HealthByPercent");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HealthPCT_In_Range
// 0x185B6359000
class TgInventoryObject_Listen_HealthPCT_In_Range
{
public:
	unsigned char                                      UnknownData00[0x185B6359000];                             // 0x0000(0x185B6359000) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HealthPCT_In_Range");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HitAirborne
// 0x0000
class TgInventoryObject_Listen_HitAirborne
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HitAirborne");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HitAirborneOwner
// 0x0000
class TgInventoryObject_Listen_HitAirborneOwner
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HitAirborneOwner");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_HitOnHeadshot
// 0x0000
class TgInventoryObject_Listen_HitOnHeadshot
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_HitOnHeadshot");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Hustle
// 0x0000
class TgInventoryObject_Listen_Hustle
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Hustle");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_InHand_HitMissStacker
// 0x185B6357980
class TgInventoryObject_Listen_InHand_HitMissStacker
{
public:
	unsigned char                                      UnknownData00[0x185B6357980];                             // 0x0000(0x185B6357980) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_InHand_HitMissStacker");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_LazarusResurrect
// 0x0000
class TgInventoryObject_Listen_LazarusResurrect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_LazarusResurrect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_LoogieExploded
// 0x0000
class TgInventoryObject_Listen_LoogieExploded
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_LoogieExploded");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_MirrorDamageToHealBlock
// 0x185B635A8C0
class TgInventoryObject_Listen_MirrorDamageToHealBlock
{
public:
	unsigned char                                      UnknownData00[0x185B635A8C0];                             // 0x0000(0x185B635A8C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_MirrorDamageToHealBlock");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_NearObjective
// 0x185B6353C00
class TgInventoryObject_Listen_NearObjective
{
public:
	unsigned char                                      UnknownData00[0x185B6353C00];                             // 0x0000(0x185B6353C00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_NearObjective");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AuraNearObjective
// 0x0000
class TgInventoryObject_Listen_AuraNearObjective
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AuraNearObjective");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ReachOut
// 0x0000
class TgInventoryObject_Listen_ReachOut
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ReachOut");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_NearOwnTurret
// 0x185B635CD80
class TgInventoryObject_Listen_NearOwnTurret
{
public:
	unsigned char                                      UnknownData00[0x185B635CD80];                             // 0x0000(0x185B635CD80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_NearOwnTurret");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_OppressorMineEffect
// 0x0000
class TgInventoryObject_Listen_OppressorMineEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_OppressorMineEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_OutOfCombat
// 0x185B635A5C0
class TgInventoryObject_Listen_OutOfCombat
{
public:
	unsigned char                                      UnknownData00[0x185B635A5C0];                             // 0x0000(0x185B635A5C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_OutOfCombat");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_PetAbility
// 0x0000
class TgInventoryObject_Listen_PetAbility
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_PetAbility");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_AugmentPetHit
// 0x0000
class TgInventoryObject_Listen_AugmentPetHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_AugmentPetHit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Unveil
// 0x0000
class TgInventoryObject_Listen_Unveil
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Unveil");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_PetAbility_Deploy
// 0x0000
class TgInventoryObject_Listen_PetAbility_Deploy
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_PetAbility_Deploy");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_PetAbilityWhileDeployableActive
// 0x185B635CA80
class TgInventoryObject_Listen_PetAbilityWhileDeployableActive
{
public:
	unsigned char                                      UnknownData00[0x185B635CA80];                             // 0x0000(0x185B635CA80) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_PetAbilityWhileDeployableActive");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_PetDied
// 0x0000
class TgInventoryObject_Listen_PetDied
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_PetDied");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_PipConsequential
// 0x185B635BDC0
class TgInventoryObject_Listen_PipConsequential
{
public:
	unsigned char                                      UnknownData00[0x185B635BDC0];                             // 0x0000(0x185B635BDC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_PipConsequential");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_RainOfFire
// 0x0000
class TgInventoryObject_Listen_RainOfFire
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_RainOfFire");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ReversalEffect
// 0x0000
class TgInventoryObject_Listen_ReversalEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ReversalEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_SalvoExplode
// 0x0000
class TgInventoryObject_Listen_SalvoExplode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_SalvoExplode");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Scramble
// 0x185B635C540
class TgInventoryObject_Listen_Scramble
{
public:
	unsigned char                                      UnknownData00[0x185B635C540];                             // 0x0000(0x185B635C540) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Scramble");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ShellShieldEffect
// 0x0000
class TgInventoryObject_Listen_ShellShieldEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ShellShieldEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_ShieldEffect
// 0x0000
class TgInventoryObject_Listen_ShieldEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_ShieldEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_SizeOfTheFight
// 0x0000
class TgInventoryObject_Listen_SizeOfTheFight
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_SizeOfTheFight");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_SmokeScreenEffect
// 0x0000
class TgInventoryObject_Listen_SmokeScreenEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_SmokeScreenEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_SomethingToProve
// 0x185B635B7C0
class TgInventoryObject_Listen_SomethingToProve
{
public:
	unsigned char                                      UnknownData00[0x185B635B7C0];                             // 0x0000(0x185B635B7C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_SomethingToProve");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_SpawnTeamHealthNugget
// 0x185BC790160
class TgInventoryObject_Listen_SpawnTeamHealthNugget
{
public:
	unsigned char                                      UnknownData00[0x185BC790160];                             // 0x0000(0x185BC790160) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_SpawnTeamHealthNugget");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_FirstAidKit
// 0x0000
class TgInventoryObject_Listen_FirstAidKit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_FirstAidKit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_SpringBloom
// 0x0000
class TgInventoryObject_Listen_SpringBloom
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_SpringBloom");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Stack
// 0x185BC78F3E0
class TgInventoryObject_Listen_Stack
{
public:
	unsigned char                                      UnknownData00[0x185BC78F3E0];                             // 0x0000(0x185BC78F3E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Stack");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Get_Nugget
// 0x0000
class TgInventoryObject_Listen_Get_Nugget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Get_Nugget");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_StackPerPetAlive
// 0x185BC7917E0
class TgInventoryObject_Listen_StackPerPetAlive
{
public:
	unsigned char                                      UnknownData00[0x185BC7917E0];                             // 0x0000(0x185BC7917E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_StackPerPetAlive");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_StandingStill
// 0x0000
class TgInventoryObject_Listen_StandingStill
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_StandingStill");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_StandingStillSelfEffect
// 0x185B635B100
class TgInventoryObject_Listen_StandingStillSelfEffect
{
public:
	unsigned char                                      UnknownData00[0x185B635B100];                             // 0x0000(0x185B635B100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_StandingStillSelfEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_StatusIsOnTarget
// 0x0000
class TgInventoryObject_Listen_StatusIsOnTarget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_StatusIsOnTarget");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_StickyBombDetonate
// 0x0000
class TgInventoryObject_Listen_StickyBombDetonate
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_StickyBombDetonate");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_TotemEffect
// 0x0000
class TgInventoryObject_Listen_TotemEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_TotemEffect");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_TripWire
// 0x0000
class TgInventoryObject_Listen_TripWire
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_TripWire");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_TrueGrit
// 0x0000
class TgInventoryObject_Listen_TrueGrit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_TrueGrit");
		return ptr;
	}

};


// Class TgGame.TgInventoryObject_Listen_Unyielding
// 0x185B635C6C0
class TgInventoryObject_Listen_Unyielding
{
public:
	unsigned char                                      UnknownData00[0x185B635C6C0];                             // 0x0000(0x185B635C6C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInventoryObject_Listen_Unyielding");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ActiveDeployableEffect
// 0x185B635C0C0
class TgInvListener_ActiveDeployableEffect
{
public:
	unsigned char                                      UnknownData00[0x185B635C0C0];                             // 0x0000(0x185B635C0C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ActiveDeployableEffect");
		return ptr;
	}

};


// Class TgGame.TgInvListener_AddHealing
// 0x0000
class TgInvListener_AddHealing
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_AddHealing");
		return ptr;
	}

};


// Class TgGame.TgInvListener_AddHealingAboveorBelowHealthPercent
// 0x0000
class TgInvListener_AddHealingAboveorBelowHealthPercent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_AddHealingAboveorBelowHealthPercent");
		return ptr;
	}

};


// Class TgGame.TgInvListener_AddHealingMissingHealthPercent
// 0x0000
class TgInvListener_AddHealingMissingHealthPercent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_AddHealingMissingHealthPercent");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ApplyAoeWithHit
// 0x0000
class TgInvListener_ApplyAoeWithHit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ApplyAoeWithHit");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ApplyHitSpecialOnKill
// 0x0000
class TgInvListener_ApplyHitSpecialOnKill
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ApplyHitSpecialOnKill");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ApplyHitSpecialOnKillOrElimination
// 0x0000
class TgInvListener_ApplyHitSpecialOnKillOrElimination
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ApplyHitSpecialOnKillOrElimination");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ConsecutiveInhandHits
// 0x185B635B580
class TgInvListener_ConsecutiveInhandHits
{
public:
	unsigned char                                      UnknownData00[0x185B635B580];                             // 0x0000(0x185B635B580) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ConsecutiveInhandHits");
		return ptr;
	}

};


// Class TgGame.TgInvListener_DeployOnElimination
// 0x0000
class TgInvListener_DeployOnElimination
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_DeployOnElimination");
		return ptr;
	}

};


// Class TgGame.TgInvListener_HitSelfInsteadOfDeath
// 0x0000
class TgInvListener_HitSelfInsteadOfDeath
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_HitSelfInsteadOfDeath");
		return ptr;
	}

};


// Class TgGame.TgInvListener_HitSelfOnHeadshot
// 0x0000
class TgInvListener_HitSelfOnHeadshot
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_HitSelfOnHeadshot");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ModifyDeployableHealth
// 0x0000
class TgInvListener_ModifyDeployableHealth
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ModifyDeployableHealth");
		return ptr;
	}

};


// Class TgGame.TgInvListener_OnShieldDeployableDestroyed
// 0x0000
class TgInvListener_OnShieldDeployableDestroyed
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_OnShieldDeployableDestroyed");
		return ptr;
	}

};


// Class TgGame.TgInvListener_RedirectDamageToDeployables
// 0x185B635E340
class TgInvListener_RedirectDamageToDeployables
{
public:
	unsigned char                                      UnknownData00[0x185B635E340];                             // 0x0000(0x185B635E340) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_RedirectDamageToDeployables");
		return ptr;
	}

};


// Class TgGame.TgInvListener_ShieldLifesteal
// 0x0000
class TgInvListener_ShieldLifesteal
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgInvListener_ShieldLifesteal");
		return ptr;
	}

};


// Class TgGame.TgPickupFactory
// 0x185B61B48E0
class TgPickupFactory
{
public:
	unsigned char                                      UnknownData00[0x185B61B48E0];                             // 0x0000(0x185B61B48E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPickupFactory");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_AIFreeze
// 0x185BA144CB0
class TgSeqAct_AIFreeze
{
public:
	unsigned char                                      UnknownData00[0x185BA144CB0];                             // 0x0000(0x185BA144CB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_AIFreeze");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_AIMoveToActor
// 0x185BA142F70
class TgSeqAct_AIMoveToActor
{
public:
	unsigned char                                      UnknownData00[0x185BA142F70];                             // 0x0000(0x185BA142F70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_AIMoveToActor");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_AITargetActor
// 0x185BA144E30
class TgSeqAct_AITargetActor
{
public:
	unsigned char                                      UnknownData00[0x185BA144E30];                             // 0x0000(0x185BA144E30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_AITargetActor");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_BeginWaitForLookAt
// 0x185B61D9540
class TgSeqAct_BeginWaitForLookAt
{
public:
	unsigned char                                      UnknownData00[0x185B61D9540];                             // 0x0000(0x185B61D9540) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_BeginWaitForLookAt");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_ClientLoadDevices
// 0x185BA144FB0
class TgSeqAct_ClientLoadDevices
{
public:
	unsigned char                                      UnknownData00[0x185BA144FB0];                             // 0x0000(0x185BA144FB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_ClientLoadDevices");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_CloseHUDMenus
// 0x185B61D8460
class TgSeqAct_CloseHUDMenus
{
public:
	unsigned char                                      UnknownData00[0x185B61D8460];                             // 0x0000(0x185B61D8460) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_CloseHUDMenus");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_DefenseWaveSpawner
// 0x185BA142430
class TgSeqAct_DefenseWaveSpawner
{
public:
	unsigned char                                      UnknownData00[0x185BA142430];                             // 0x0000(0x185BA142430) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_DefenseWaveSpawner");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_EndMission
// 0x0000
class TgSeqAct_EndMission
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_EndMission");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_FillUltimateEnergy
// 0x185B61D9AE0
class TgSeqAct_FillUltimateEnergy
{
public:
	unsigned char                                      UnknownData00[0x185B61D9AE0];                             // 0x0000(0x185B61D9AE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_FillUltimateEnergy");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_ForceClientTutorialAction
// 0x185B830A700
class TgSeqAct_ForceClientTutorialAction
{
public:
	unsigned char                                      UnknownData00[0x185B830A700];                             // 0x0000(0x185B830A700) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_ForceClientTutorialAction");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_GetLocalPlayerController
// 0x185B61D86A0
class TgSeqAct_GetLocalPlayerController
{
public:
	unsigned char                                      UnknownData00[0x185B61D86A0];                             // 0x0000(0x185B61D86A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_GetLocalPlayerController");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_GetMaterialInst
// 0x185BA147B30
class TgSeqAct_GetMaterialInst
{
public:
	unsigned char                                      UnknownData00[0x185BA147B30];                             // 0x0000(0x185BA147B30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_GetMaterialInst");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_GetPlayerCount
// 0x185BA1461B0
class TgSeqAct_GetPlayerCount
{
public:
	unsigned char                                      UnknownData00[0x185BA1461B0];                             // 0x0000(0x185BA1461B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_GetPlayerCount");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_GetTaskForceCount
// 0x185BA1467B0
class TgSeqAct_GetTaskForceCount
{
public:
	unsigned char                                      UnknownData00[0x185BA1467B0];                             // 0x0000(0x185BA1467B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_GetTaskForceCount");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_GiveCredits
// 0x185B61D88E0
class TgSeqAct_GiveCredits
{
public:
	unsigned char                                      UnknownData00[0x185B61D88E0];                             // 0x0000(0x185B61D88E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_GiveCredits");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_GiveFullVitals
// 0x0000
class TgSeqAct_GiveFullVitals
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_GiveFullVitals");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_MapOutroFinished
// 0x0000
class TgSeqAct_MapOutroFinished
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_MapOutroFinished");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_NavIndicator
// 0x185B94F88C0
class TgSeqAct_NavIndicator
{
public:
	unsigned char                                      UnknownData00[0x185B94F88C0];                             // 0x0000(0x185B94F88C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_NavIndicator");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_PingMinimap
// 0x185B94F9040
class TgSeqAct_PingMinimap
{
public:
	unsigned char                                      UnknownData00[0x185B94F9040];                             // 0x0000(0x185B94F9040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_PingMinimap");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_PlayFullBodyAnim
// 0x185BA1469F0
class TgSeqAct_PlayFullBodyAnim
{
public:
	unsigned char                                      UnknownData00[0x185BA1469F0];                             // 0x0000(0x185BA1469F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_PlayFullBodyAnim");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_ProgressTo
// 0x185BA146AB0
class TgSeqAct_ProgressTo
{
public:
	unsigned char                                      UnknownData00[0x185BA146AB0];                             // 0x0000(0x185BA146AB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_ProgressTo");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_PushMatinee
// 0x185BA146FF0
class TgSeqAct_PushMatinee
{
public:
	unsigned char                                      UnknownData00[0x185BA146FF0];                             // 0x0000(0x185BA146FF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_PushMatinee");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_RequestMission
// 0x185BA145AF0
class TgSeqAct_RequestMission
{
public:
	unsigned char                                      UnknownData00[0x185BA145AF0];                             // 0x0000(0x185BA145AF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_RequestMission");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_ResetCooldowns
// 0x185BCD0CFB0
class TgSeqAct_ResetCooldowns
{
public:
	unsigned char                                      UnknownData00[0x185BCD0CFB0];                             // 0x0000(0x185BCD0CFB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_ResetCooldowns");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_RespawnAllPlayers
// 0x185BA147830
class TgSeqAct_RespawnAllPlayers
{
public:
	unsigned char                                      UnknownData00[0x185BA147830];                             // 0x0000(0x185BA147830) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_RespawnAllPlayers");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SendPlayerTrackingEvent
// 0x185BA14B070
class TgSeqAct_SendPlayerTrackingEvent
{
public:
	unsigned char                                      UnknownData00[0x185BA14B070];                             // 0x0000(0x185BA14B070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SendPlayerTrackingEvent");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetCreditGainBlock
// 0x185BA148F70
class TgSeqAct_SetCreditGainBlock
{
public:
	unsigned char                                      UnknownData00[0x185BA148F70];                             // 0x0000(0x185BA148F70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetCreditGainBlock");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetEnergyGainBlock
// 0x185BA1488B0
class TgSeqAct_SetEnergyGainBlock
{
public:
	unsigned char                                      UnknownData00[0x185BA1488B0];                             // 0x0000(0x185BA1488B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetEnergyGainBlock");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetHexState
// 0x185BA148130
class TgSeqAct_SetHexState
{
public:
	unsigned char                                      UnknownData00[0x185BA148130];                             // 0x0000(0x185BA148130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetHexState");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetInputEnabled
// 0x185BCD0F290
class TgSeqAct_SetInputEnabled
{
public:
	unsigned char                                      UnknownData00[0x185BCD0F290];                             // 0x0000(0x185BCD0F290) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetInputEnabled");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetMapLane
// 0x185BA1485B0
class TgSeqAct_SetMapLane
{
public:
	unsigned char                                      UnknownData00[0x185BA1485B0];                             // 0x0000(0x185BA1485B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetMapLane");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetMissionTime
// 0x185BA149E70
class TgSeqAct_SetMissionTime
{
public:
	unsigned char                                      UnknownData00[0x185BA149E70];                             // 0x0000(0x185BA149E70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetMissionTime");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetPlayerLevel
// 0x185BA148730
class TgSeqAct_SetPlayerLevel
{
public:
	unsigned char                                      UnknownData00[0x185BA148730];                             // 0x0000(0x185BA148730) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetPlayerLevel");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetPlayerMesh
// 0x185BA1487F0
class TgSeqAct_SetPlayerMesh
{
public:
	unsigned char                                      UnknownData00[0x185BA1487F0];                             // 0x0000(0x185BA1487F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetPlayerMesh");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetPlayerMeshVisible
// 0x185BCD10A30
class TgSeqAct_SetPlayerMeshVisible
{
public:
	unsigned char                                      UnknownData00[0x185BCD10A30];                             // 0x0000(0x185BCD10A30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetPlayerMeshVisible");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetUIClock
// 0x185BA1497B0
class TgSeqAct_SetUIClock
{
public:
	unsigned char                                      UnknownData00[0x185BA1497B0];                             // 0x0000(0x185BA1497B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetUIClock");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SetUITextBox
// 0x185BA14A0B0
class TgSeqAct_SetUITextBox
{
public:
	unsigned char                                      UnknownData00[0x185BA14A0B0];                             // 0x0000(0x185BA14A0B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SetUITextBox");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_SpawnProjectile
// 0x185BCD0F830
class TgSeqAct_SpawnProjectile
{
public:
	unsigned char                                      UnknownData00[0x185BCD0F830];                             // 0x0000(0x185BCD0F830) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_SpawnProjectile");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_TemporaryAddDevice
// 0x185BA14CB70
class TgSeqAct_TemporaryAddDevice
{
public:
	unsigned char                                      UnknownData00[0x185BA14CB70];                             // 0x0000(0x185BA14CB70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_TemporaryAddDevice");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_TemporaryRemoveDevice
// 0x185BA14CC30
class TgSeqAct_TemporaryRemoveDevice
{
public:
	unsigned char                                      UnknownData00[0x185BA14CC30];                             // 0x0000(0x185BA14CC30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_TemporaryRemoveDevice");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_ToggleStaticMeshSilhouette
// 0x185BCD0E3F0
class TgSeqAct_ToggleStaticMeshSilhouette
{
public:
	unsigned char                                      UnknownData00[0x185BCD0E3F0];                             // 0x0000(0x185BCD0E3F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_ToggleStaticMeshSilhouette");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_TrainingAwards
// 0x185BA14DE30
class TgSeqAct_TrainingAwards
{
public:
	unsigned char                                      UnknownData00[0x185BA14DE30];                             // 0x0000(0x185BA14DE30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_TrainingAwards");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_TriggerBots
// 0x185BA14CDB0
class TgSeqAct_TriggerBots
{
public:
	unsigned char                                      UnknownData00[0x185BA14CDB0];                             // 0x0000(0x185BA14CDB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_TriggerBots");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_TutorialHighlighter
// 0x185B830B600
class TgSeqAct_TutorialHighlighter
{
public:
	unsigned char                                      UnknownData00[0x185B830B600];                             // 0x0000(0x185B830B600) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_TutorialHighlighter");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_TutorialInstruction
// 0x185BA14D9B0
class TgSeqAct_TutorialInstruction
{
public:
	unsigned char                                      UnknownData00[0x185BA14D9B0];                             // 0x0000(0x185BA14D9B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_TutorialInstruction");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_TutorialTips
// 0x185BA14BBB0
class TgSeqAct_TutorialTips
{
public:
	unsigned char                                      UnknownData00[0x185BA14BBB0];                             // 0x0000(0x185BA14BBB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_TutorialTips");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_UIAlert
// 0x185C0A20090
class TgSeqAct_UIAlert
{
public:
	unsigned char                                      UnknownData00[0x185C0A20090];                             // 0x0000(0x185C0A20090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_UIAlert");
		return ptr;
	}

};


// Class TgGame.TgSeqAct_UIElementVisibility
// 0x185BA14DA70
class TgSeqAct_UIElementVisibility
{
public:
	unsigned char                                      UnknownData00[0x185BA14DA70];                             // 0x0000(0x185BA14DA70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqAct_UIElementVisibility");
		return ptr;
	}

};


// Class TgGame.TgSeqCond_And
// 0x0000
class TgSeqCond_And
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqCond_And");
		return ptr;
	}

};


// Class TgGame.TgSeqCond_CompareDamageType
// 0x0000
class TgSeqCond_CompareDamageType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqCond_CompareDamageType");
		return ptr;
	}

};


// Class TgGame.TgSeqCond_CompareDeviceId
// 0x185BA14D230
class TgSeqCond_CompareDeviceId
{
public:
	unsigned char                                      UnknownData00[0x185BA14D230];                             // 0x0000(0x185BA14D230) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqCond_CompareDeviceId");
		return ptr;
	}

};


// Class TgGame.TgSeqCond_HasCondition
// 0x185BA14B370
class TgSeqCond_HasCondition
{
public:
	unsigned char                                      UnknownData00[0x185BA14B370];                             // 0x0000(0x185BA14B370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqCond_HasCondition");
		return ptr;
	}

};


// Class TgGame.TgSeqCond_IsHuman
// 0x0000
class TgSeqCond_IsHuman
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqCond_IsHuman");
		return ptr;
	}

};


// Class TgGame.TgSeqCond_IsSecuring
// 0x0000
class TgSeqCond_IsSecuring
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqCond_IsSecuring");
		return ptr;
	}

};


// Class TgGame.TgSeqCond_IsSpectating
// 0x0000
class TgSeqCond_IsSpectating
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqCond_IsSpectating");
		return ptr;
	}

};


// Class TgGame.TgSeqCond_Or
// 0x0000
class TgSeqCond_Or
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqCond_Or");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_ClientGameOver
// 0x0000
class TgSeqEvent_ClientGameOver
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_ClientGameOver");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_DeployableFired
// 0x0000
class TgSeqEvent_DeployableFired
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_DeployableFired");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_EnergyUpdated
// 0x185BBB50090
class TgSeqEvent_EnergyUpdated
{
public:
	unsigned char                                      UnknownData00[0x185BBB50090];                             // 0x0000(0x185BBB50090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_EnergyUpdated");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_Escort_Despawn_Success
// 0x185B60D8D20
class TgSeqEvent_Escort_Despawn_Success
{
public:
	unsigned char                                      UnknownData00[0x185B60D8D20];                             // 0x0000(0x185B60D8D20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_Escort_Despawn_Success");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_FiringDevice
// 0x0000
class TgSeqEvent_FiringDevice
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_FiringDevice");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_LevelFadedIn
// 0x0000
class TgSeqEvent_LevelFadedIn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_LevelFadedIn");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_MissionTimer
// 0x185BCD10250
class TgSeqEvent_MissionTimer
{
public:
	unsigned char                                      UnknownData00[0x185BCD10250];                             // 0x0000(0x185BCD10250) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_MissionTimer");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_MissionTimeRemaining
// 0x185BA150D70
class TgSeqEvent_MissionTimeRemaining
{
public:
	unsigned char                                      UnknownData00[0x185BA150D70];                             // 0x0000(0x185BA150D70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_MissionTimeRemaining");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_Named
// 0x185BA14FC30
class TgSeqEvent_Named
{
public:
	unsigned char                                      UnknownData00[0x185BA14FC30];                             // 0x0000(0x185BA14FC30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_Named");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_PayloadMissionEvents
// 0x185BCD10370
class TgSeqEvent_PayloadMissionEvents
{
public:
	unsigned char                                      UnknownData00[0x185BCD10370];                             // 0x0000(0x185BCD10370) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_PayloadMissionEvents");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_PlayerMoved
// 0x185BCD0CB30
class TgSeqEvent_PlayerMoved
{
public:
	unsigned char                                      UnknownData00[0x185BCD0CB30];                             // 0x0000(0x185BCD0CB30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_PlayerMoved");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_SpawnLanePusher
// 0x185BA151070
class TgSeqEvent_SpawnLanePusher
{
public:
	unsigned char                                      UnknownData00[0x185BA151070];                             // 0x0000(0x185BA151070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_SpawnLanePusher");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_SpawnWise
// 0x185BA14E1F0
class TgSeqEvent_SpawnWise
{
public:
	unsigned char                                      UnknownData00[0x185BA14E1F0];                             // 0x0000(0x185BA14E1F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_SpawnWise");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_TakeDamage
// 0x185BCD0E750
class TgSeqEvent_TakeDamage
{
public:
	unsigned char                                      UnknownData00[0x185BCD0E750];                             // 0x0000(0x185BCD0E750) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_TakeDamage");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_TaskForceInactive
// 0x0000
class TgSeqEvent_TaskForceInactive
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_TaskForceInactive");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_TeamInactive
// 0x0000
class TgSeqEvent_TeamInactive
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_TeamInactive");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_TicketCountUpdated
// 0x0000
class TgSeqEvent_TicketCountUpdated
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_TicketCountUpdated");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_UI_Event
// 0x185BCD0DE50
class TgSeqEvent_UI_Event
{
public:
	unsigned char                                      UnknownData00[0x185BCD0DE50];                             // 0x0000(0x185BCD0DE50) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_UI_Event");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_UpdateLanePusherCount
// 0x185B60D78E0
class TgSeqEvent_UpdateLanePusherCount
{
public:
	unsigned char                                      UnknownData00[0x185B60D78E0];                             // 0x0000(0x185B60D78E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_UpdateLanePusherCount");
		return ptr;
	}

};


// Class TgGame.TgSeqEvent_Used
// 0x0000
class TgSeqEvent_Used
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqEvent_Used");
		return ptr;
	}

};


// Class TgGame.TgSeqOp_MathCalc
// 0x185BA153770
class TgSeqOp_MathCalc
{
public:
	unsigned char                                      UnknownData00[0x185BA153770];                             // 0x0000(0x185BA153770) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqOp_MathCalc");
		return ptr;
	}

};


// Class TgGame.TgSeqVar_DamageType
// 0x185C19B01E0
class TgSeqVar_DamageType
{
public:
	unsigned char                                      UnknownData00[0x185C19B01E0];                             // 0x0000(0x185C19B01E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqVar_DamageType");
		return ptr;
	}

};


// Class TgGame.TgSeqVar_Player
// 0x185BA151EB0
class TgSeqVar_Player
{
public:
	unsigned char                                      UnknownData00[0x185BA151EB0];                             // 0x0000(0x185BA151EB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqVar_Player");
		return ptr;
	}

};


// Class TgGame.TgSeqVar_RouteNumber
// 0x0000
class TgSeqVar_RouteNumber
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSeqVar_RouteNumber");
		return ptr;
	}

};


// Class TgGame.TgTrigger_AIControlledCharacters
// 0x0000
class TgTrigger_AIControlledCharacters
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgTrigger_AIControlledCharacters");
		return ptr;
	}

};


// Class TgGame.TgTrigger_Instance
// 0x185BCD22250
class TgTrigger_Instance
{
public:
	unsigned char                                      UnknownData00[0x185BCD22250];                             // 0x0000(0x185BCD22250) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgTrigger_Instance");
		return ptr;
	}

};


// Class TgGame.TgTrigger_PlayerControlledCharacters
// 0x0000
class TgTrigger_PlayerControlledCharacters
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgTrigger_PlayerControlledCharacters");
		return ptr;
	}

};


// Class TgGame.TgTrigger_Use
// 0x185BCD1ED70
class TgTrigger_Use
{
public:
	unsigned char                                      UnknownData00[0x185BCD1ED70];                             // 0x0000(0x185BCD1ED70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgTrigger_Use");
		return ptr;
	}

};


// Class TgGame.Interface_AIAnnotation
// 0x185BB49E990
class Interface_AIAnnotation
{
public:
	unsigned char                                      UnknownData00[0x185BB49E990];                             // 0x0000(0x185BB49E990) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.Interface_AIAnnotation");
		return ptr;
	}

};


// Class TgGame.TgAudioOcclusionActor
// 0x185BBD36A60
class TgAudioOcclusionActor
{
public:
	unsigned char                                      UnknownData00[0x185BBD36A60];                             // 0x0000(0x185BBD36A60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAudioOcclusionActor");
		return ptr;
	}

};


// Class TgGame.TgLanePylon
// 0x185B6360500
class TgLanePylon
{
public:
	unsigned char                                      UnknownData00[0x185B6360500];                             // 0x0000(0x185B6360500) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgLanePylon");
		return ptr;
	}

};


// Class TgGame.TgTeamBlocker
// 0x185B9E081F0
class TgTeamBlocker
{
public:
	unsigned char                                      UnknownData00[0x185B9E081F0];                             // 0x0000(0x185B9E081F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgTeamBlocker");
		return ptr;
	}

};


// Class TgGame.TgDoorMarker
// 0x185B5960850
class TgDoorMarker
{
public:
	unsigned char                                      UnknownData00[0x185B5960850];                             // 0x0000(0x185B5960850) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDoorMarker");
		return ptr;
	}

};


// Class TgGame.TgNavigationPoint
// 0x185BB73B310
class TgNavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x185BB73B310];                             // 0x0000(0x185BB73B310) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgNavigationPoint");
		return ptr;
	}

};


// Class TgGame.TgActionPoint
// 0x185BB73BA90
class TgActionPoint
{
public:
	unsigned char                                      UnknownData00[0x185BB73BA90];                             // 0x0000(0x185BB73BA90) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgActionPoint");
		return ptr;
	}

};


// Class TgGame.TgAIAnnotation
// 0x185BB4AA570
class TgAIAnnotation
{
public:
	unsigned char                                      UnknownData00[0x185BB4AA570];                             // 0x0000(0x185BB4AA570) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAIAnnotation");
		return ptr;
	}

};


// Class TgGame.TgAssaultPoint
// 0x185BBA84D40
class TgAssaultPoint
{
public:
	unsigned char                                      UnknownData00[0x185BBA84D40];                             // 0x0000(0x185BBA84D40) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAssaultPoint");
		return ptr;
	}

};


// Class TgGame.TgCoverPoint
// 0x185B5028940
class TgCoverPoint
{
public:
	unsigned char                                      UnknownData00[0x185B5028940];                             // 0x0000(0x185B5028940) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCoverPoint");
		return ptr;
	}

};


// Class TgGame.TgNavigationPointSpawnable
// 0x0000
class TgNavigationPointSpawnable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgNavigationPointSpawnable");
		return ptr;
	}

};


// Class TgGame.TgPointOfInterest
// 0x185B62D5DF0
class TgPointOfInterest
{
public:
	unsigned char                                      UnknownData00[0x185B62D5DF0];                             // 0x0000(0x185B62D5DF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPointOfInterest");
		return ptr;
	}

};


// Class TgGame.TgNavMeshPath_AlongLane
// 0x185BC792200
class TgNavMeshPath_AlongLane
{
public:
	unsigned char                                      UnknownData00[0x185BC792200];                             // 0x0000(0x185BC792200) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgNavMeshPath_AlongLane");
		return ptr;
	}

};


// Class TgGame.TgPathfinder
// 0x185BC7981A0
class TgPathfinder
{
public:
	unsigned char                                      UnknownData00[0x185BC7981A0];                             // 0x0000(0x185BC7981A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPathfinder");
		return ptr;
	}

};


// Class TgGame.TgPathfinderWalker
// 0x185BC79AC60
class TgPathfinderWalker
{
public:
	unsigned char                                      UnknownData00[0x185BC79AC60];                             // 0x0000(0x185BC79AC60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPathfinderWalker");
		return ptr;
	}

};


// Class TgGame.TgPathPreviewActor
// 0x185BC7968E0
class TgPathPreviewActor
{
public:
	unsigned char                                      UnknownData00[0x185BC7968E0];                             // 0x0000(0x185BC7968E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPathPreviewActor");
		return ptr;
	}

};


// Class TgGame.TgPathPreviewRenderingComponent
// 0x0000
class TgPathPreviewRenderingComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPathPreviewRenderingComponent");
		return ptr;
	}

};


// Class TgGame.TgSkeletalMeshActor
// 0x185BC7956E0
class TgSkeletalMeshActor
{
public:
	unsigned char                                      UnknownData00[0x185BC7956E0];                             // 0x0000(0x185BC7956E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkeletalMeshActor");
		return ptr;
	}

};


// Class TgGame.TgSkeletalMeshActorSpawnable
// 0x0000
class TgSkeletalMeshActorSpawnable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkeletalMeshActorSpawnable");
		return ptr;
	}

};


// Class TgGame.TgNavRouteIndicator
// 0x185BC797F60
class TgNavRouteIndicator
{
public:
	unsigned char                                      UnknownData00[0x185BC797F60];                             // 0x0000(0x185BC797F60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgNavRouteIndicator");
		return ptr;
	}

};


// Class TgGame.TgSpawnTeleporterExit
// 0x185B501E500
class TgSpawnTeleporterExit
{
public:
	unsigned char                                      UnknownData00[0x185B501E500];                             // 0x0000(0x185B501E500) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSpawnTeleporterExit");
		return ptr;
	}

};


// Class TgGame.TgSplineActor
// 0x185BCD1E7D0
class TgSplineActor
{
public:
	unsigned char                                      UnknownData00[0x185BCD1E7D0];                             // 0x0000(0x185BCD1E7D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSplineActor");
		return ptr;
	}

};


// Class TgGame.TgStartPoint
// 0x185B50205A0
class TgStartPoint
{
public:
	unsigned char                                      UnknownData00[0x185B50205A0];                             // 0x0000(0x185B50205A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgStartPoint");
		return ptr;
	}

};


// Class TgGame.TgTeamPlayerStart
// 0x185BCD1F550
class TgTeamPlayerStart
{
public:
	unsigned char                                      UnknownData00[0x185BCD1F550];                             // 0x0000(0x185BCD1F550) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgTeamPlayerStart");
		return ptr;
	}

};


// Class TgGame.TgTeleporter
// 0x185BCD1F1F0
class TgTeleporter
{
public:
	unsigned char                                      UnknownData00[0x185BCD1F1F0];                             // 0x0000(0x185BCD1F1F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgTeleporter");
		return ptr;
	}

};


// Class TgGame.TgAudioPawnDialogue
// 0x185BBD36280
class TgAudioPawnDialogue
{
public:
	unsigned char                                      UnknownData00[0x185BBD36280];                             // 0x0000(0x185BBD36280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgAudioPawnDialogue");
		return ptr;
	}

};


// Class TgGame.TgCombatActor
// 0x185BB4B02D0
class TgCombatActor
{
public:
	unsigned char                                      UnknownData00[0x185BB4B02D0];                             // 0x0000(0x185BB4B02D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgCombatActor");
		return ptr;
	}

};


// Class TgGame.TgControlModule
// 0x185B5022880
class TgControlModule
{
public:
	unsigned char                                      UnknownData00[0x185B5022880];                             // 0x0000(0x185B5022880) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule");
		return ptr;
	}

};


// Class TgGame.TgControlModule_BaseEngine
// 0x185B5024FE0
class TgControlModule_BaseEngine
{
public:
	unsigned char                                      UnknownData00[0x185B5024FE0];                             // 0x0000(0x185B5024FE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_BaseEngine");
		return ptr;
	}

};


// Class TgGame.TgControlModule_Dead
// 0x185B5022D00
class TgControlModule_Dead
{
public:
	unsigned char                                      UnknownData00[0x185B5022D00];                             // 0x0000(0x185B5022D00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_Dead");
		return ptr;
	}

};


// Class TgGame.TgControlModule_Free
// 0x185B5027860
class TgControlModule_Free
{
public:
	unsigned char                                      UnknownData00[0x185B5027860];                             // 0x0000(0x185B5027860) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_Free");
		return ptr;
	}

};


// Class TgGame.TgControlModule_Spectator
// 0x185B5029360
class TgControlModule_Spectator
{
public:
	unsigned char                                      UnknownData00[0x185B5029360];                             // 0x0000(0x185B5029360) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_Spectator");
		return ptr;
	}

};


// Class TgGame.TgControlModule_SpectatorLockedView
// 0x185B5010AC0
class TgControlModule_SpectatorLockedView
{
public:
	unsigned char                                      UnknownData00[0x185B5010AC0];                             // 0x0000(0x185B5010AC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_SpectatorLockedView");
		return ptr;
	}

};


// Class TgGame.TgControlModule_SpectatorOverview
// 0x185B5025A00
class TgControlModule_SpectatorOverview
{
public:
	unsigned char                                      UnknownData00[0x185B5025A00];                             // 0x0000(0x185B5025A00) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_SpectatorOverview");
		return ptr;
	}

};


// Class TgGame.TgControlModule_TopDown
// 0x185B50297E0
class TgControlModule_TopDown
{
public:
	unsigned char                                      UnknownData00[0x185B50297E0];                             // 0x0000(0x185B50297E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_TopDown");
		return ptr;
	}

};


// Class TgGame.TgControlModule_ThirdPerson
// 0x185B50210E0
class TgControlModule_ThirdPerson
{
public:
	unsigned char                                      UnknownData00[0x185B50210E0];                             // 0x0000(0x185B50210E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_ThirdPerson");
		return ptr;
	}

};


// Class TgGame.TgControlModule_Feared
// 0x185B5021320
class TgControlModule_Feared
{
public:
	unsigned char                                      UnknownData00[0x185B5021320];                             // 0x0000(0x185B5021320) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_Feared");
		return ptr;
	}

};


// Class TgGame.TgControlModule_FrontFacingCamera
// 0x185B5029000
class TgControlModule_FrontFacingCamera
{
public:
	unsigned char                                      UnknownData00[0x185B5029000];                             // 0x0000(0x185B5029000) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_FrontFacingCamera");
		return ptr;
	}

};


// Class TgGame.TgControlModule_Koga
// 0x185B50283A0
class TgControlModule_Koga
{
public:
	unsigned char                                      UnknownData00[0x185B50283A0];                             // 0x0000(0x185B50283A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_Koga");
		return ptr;
	}

};


// Class TgGame.TgControlModule_Stoker
// 0x185B5026AE0
class TgControlModule_Stoker
{
public:
	unsigned char                                      UnknownData00[0x185B5026AE0];                             // 0x0000(0x185B5026AE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_Stoker");
		return ptr;
	}

};


// Class TgGame.TgControlModule_Stunned
// 0x185B5025100
class TgControlModule_Stunned
{
public:
	unsigned char                                      UnknownData00[0x185B5025100];                             // 0x0000(0x185B5025100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_Stunned");
		return ptr;
	}

};


// Class TgGame.TgControlModule_StunDisoriented
// 0x185B5027CE0
class TgControlModule_StunDisoriented
{
public:
	unsigned char                                      UnknownData00[0x185B5027CE0];                             // 0x0000(0x185B5027CE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_StunDisoriented");
		return ptr;
	}

};


// Class TgGame.TgControlModule_StunTaunted
// 0x185B5027AA0
class TgControlModule_StunTaunted
{
public:
	unsigned char                                      UnknownData00[0x185B5027AA0];                             // 0x0000(0x185B5027AA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgControlModule_StunTaunted");
		return ptr;
	}

};


// Class TgGame.TgDropShadowDecalComponent
// 0x185BB4AC190
class TgDropShadowDecalComponent
{
public:
	unsigned char                                      UnknownData00[0x185BB4AC190];                             // 0x0000(0x185BB4AC190) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDropShadowDecalComponent");
		return ptr;
	}

};


// Class TgGame.TgMaterialStack
// 0x185B5E92820
class TgMaterialStack
{
public:
	unsigned char                                      UnknownData00[0x185B5E92820];                             // 0x0000(0x185B5E92820) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgMaterialStack");
		return ptr;
	}

};


// Class TgGame.TgMeshCompInterface_MaterialStack
// 0x185B89326D0
class TgMeshCompInterface_MaterialStack
{
public:
	unsigned char                                      UnknownData00[0x185B89326D0];                             // 0x0000(0x185B89326D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgMeshCompInterface_MaterialStack");
		return ptr;
	}

};


// Class TgGame.TgPaladinsController
// 0x185BB4A3F10
class TgPaladinsController
{
public:
	unsigned char                                      UnknownData00[0x185BB4A3F10];                             // 0x0000(0x185BB4A3F10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPaladinsController");
		return ptr;
	}

};


// Class TgGame.TgPawn
// 0x185B93A0350
class TgPawn
{
public:
	unsigned char                                      UnknownData00[0x185B93A0350];                             // 0x0000(0x185B93A0350) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn");
		return ptr;
	}

};


// Class TgGame.TgPawn_Biped
// 0x185B8590530
class TgPawn_Biped
{
public:
	unsigned char                                      UnknownData00[0x185B8590530];                             // 0x0000(0x185B8590530) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Biped");
		return ptr;
	}

};


// Class TgGame.TgPawn_Character
// 0x185B85965F0
class TgPawn_Character
{
public:
	unsigned char                                      UnknownData00[0x185B85965F0];                             // 0x0000(0x185B85965F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Character");
		return ptr;
	}

};


// Class TgGame.TgPawn_LanePusherBase
// 0x185BC7660A0
class TgPawn_LanePusherBase
{
public:
	unsigned char                                      UnknownData00[0x185BC7660A0];                             // 0x0000(0x185BC7660A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_LanePusherBase");
		return ptr;
	}

};


// Class TgGame.TgPawn_LanePusher
// 0x185B619B080
class TgPawn_LanePusher
{
public:
	unsigned char                                      UnknownData00[0x185B619B080];                             // 0x0000(0x185B619B080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_LanePusher");
		return ptr;
	}

};


// Class TgGame.TgPawn_Juggernaut
// 0x185B6199FA0
class TgPawn_Juggernaut
{
public:
	unsigned char                                      UnknownData00[0x185B6199FA0];                             // 0x0000(0x185B6199FA0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Juggernaut");
		return ptr;
	}

};


// Class TgGame.TgPawn_SiegeEngine_Payload
// 0x185B61AE040
class TgPawn_SiegeEngine_Payload
{
public:
	unsigned char                                      UnknownData00[0x185B61AE040];                             // 0x0000(0x185B61AE040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_SiegeEngine_Payload");
		return ptr;
	}

};


// Class TgGame.TgPawn_SiegeEngine_CaptureAndPayload
// 0x185B61AE280
class TgPawn_SiegeEngine_CaptureAndPayload
{
public:
	unsigned char                                      UnknownData00[0x185B61AE280];                             // 0x0000(0x185B61AE280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_SiegeEngine_CaptureAndPayload");
		return ptr;
	}

};


// Class TgGame.TgPawn_SiegeEngine_Wedge
// 0x185BA57F4C0
class TgPawn_SiegeEngine_Wedge
{
public:
	unsigned char                                      UnknownData00[0x185BA57F4C0];                             // 0x0000(0x185BA57F4C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_SiegeEngine_Wedge");
		return ptr;
	}

};


// Class TgGame.TgPawn_SiegeEngine_Payload_Crusade
// 0x0000
class TgPawn_SiegeEngine_Payload_Crusade
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_SiegeEngine_Payload_Crusade");
		return ptr;
	}

};


// Class TgGame.TgPawn_LanePusherRace
// 0x185B61A04E0
class TgPawn_LanePusherRace
{
public:
	unsigned char                                      UnknownData00[0x185B61A04E0];                             // 0x0000(0x185B61A04E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_LanePusherRace");
		return ptr;
	}

};


// Class TgGame.TgPawn_HHGate
// 0x185BA563800
class TgPawn_HHGate
{
public:
	unsigned char                                      UnknownData00[0x185BA563800];                             // 0x0000(0x185BA563800) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_HHGate");
		return ptr;
	}

};


// Class TgGame.TgPawn_Pet
// 0x185B61A31E0
class TgPawn_Pet
{
public:
	unsigned char                                      UnknownData00[0x185B61A31E0];                             // 0x0000(0x185B61A31E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Pet");
		return ptr;
	}

};


// Class TgGame.TgPawn_Turret
// 0x185B61B07A0
class TgPawn_Turret
{
public:
	unsigned char                                      UnknownData00[0x185B61B07A0];                             // 0x0000(0x185B61B07A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Turret");
		return ptr;
	}

};


// Class TgGame.TgPawn_Turret_Flamethrower
// 0x0000
class TgPawn_Turret_Flamethrower
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Turret_Flamethrower");
		return ptr;
	}

};


// Class TgGame.TgPawn_Turret_Flamethrower_Mini
// 0x0000
class TgPawn_Turret_Flamethrower_Mini
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Turret_Flamethrower_Mini");
		return ptr;
	}

};


// Class TgGame.TgPawn_Turret_Mega
// 0x185B5437650
class TgPawn_Turret_Mega
{
public:
	unsigned char                                      UnknownData00[0x185B5437650];                             // 0x0000(0x185B5437650) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Turret_Mega");
		return ptr;
	}

};


// Class TgGame.TgPawn_VoodooTotem
// 0x185B61B5F60
class TgPawn_VoodooTotem
{
public:
	unsigned char                                      UnknownData00[0x185B61B5F60];                             // 0x0000(0x185B61B5F60) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_VoodooTotem");
		return ptr;
	}

};


// Class TgGame.TgPawn_Structure
// 0x185B5437CE0
class TgPawn_Structure
{
public:
	unsigned char                                      UnknownData00[0x185B5437CE0];                             // 0x0000(0x185B5437CE0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Structure");
		return ptr;
	}

};


// Class TgGame.TgPawn_TowerBase
// 0x185B61AF360
class TgPawn_TowerBase
{
public:
	unsigned char                                      UnknownData00[0x185B61AF360];                             // 0x0000(0x185B61AF360) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_TowerBase");
		return ptr;
	}

};


// Class TgGame.TgPawn_Tower
// 0x185B61AE4C0
class TgPawn_Tower
{
public:
	unsigned char                                      UnknownData00[0x185B61AE4C0];                             // 0x0000(0x185B61AE4C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Tower");
		return ptr;
	}

};


// Class TgGame.TgPawn_SiegeWall
// 0x185B61B1E20
class TgPawn_SiegeWall
{
public:
	unsigned char                                      UnknownData00[0x185B61B1E20];                             // 0x0000(0x185B61B1E20) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_SiegeWall");
		return ptr;
	}

};


// Class TgGame.TgPawn_SiegeWall_Base
// 0x185B61B3260
class TgPawn_SiegeWall_Base
{
public:
	unsigned char                                      UnknownData00[0x185B61B3260];                             // 0x0000(0x185B61B3260) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_SiegeWall_Base");
		return ptr;
	}

};


// Class TgGame.TgPawn_SiegeWall_Inner
// 0x185B61B2960
class TgPawn_SiegeWall_Inner
{
public:
	unsigned char                                      UnknownData00[0x185B61B2960];                             // 0x0000(0x185B61B2960) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_SiegeWall_Inner");
		return ptr;
	}

};


// Class TgGame.TgPawn_SiegeWall_Outer
// 0x185B61B2180
class TgPawn_SiegeWall_Outer
{
public:
	unsigned char                                      UnknownData00[0x185B61B2180];                             // 0x0000(0x185B61B2180) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_SiegeWall_Outer");
		return ptr;
	}

};


// Class TgGame.TgPawn_Tower_FA
// 0x185B61AFFC0
class TgPawn_Tower_FA
{
public:
	unsigned char                                      UnknownData00[0x185B61AFFC0];                             // 0x0000(0x185B61AFFC0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawn_Tower_FA");
		return ptr;
	}

};


// Class TgGame.TgPawnMod
// 0x185B8940A10
class TgPawnMod
{
public:
	unsigned char                                      UnknownData00[0x185B8940A10];                             // 0x0000(0x185B8940A10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawnMod");
		return ptr;
	}

};


// Class TgGame.TgPawnMod_FxAudio
// 0x185B8944490
class TgPawnMod_FxAudio
{
public:
	unsigned char                                      UnknownData00[0x185B8944490];                             // 0x0000(0x185B8944490) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPawnMod_FxAudio");
		return ptr;
	}

};


// Class TgGame.TgSpectatorController
// 0x185BBB53E70
class TgSpectatorController
{
public:
	unsigned char                                      UnknownData00[0x185BBB53E70];                             // 0x0000(0x185BBB53E70) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSpectatorController");
		return ptr;
	}

};


// Class TgGame.TgDemoRecSpectator
// 0x185BBB5BA30
class TgDemoRecSpectator
{
public:
	unsigned char                                      UnknownData00[0x185BBB5BA30];                             // 0x0000(0x185BBB5BA30) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDemoRecSpectator");
		return ptr;
	}

};


// Class TgGame.TgDemoRecSpectator_Debug
// 0x185BBA52700
class TgDemoRecSpectator_Debug
{
public:
	unsigned char                                      UnknownData00[0x185BBA52700];                             // 0x0000(0x185BBA52700) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgDemoRecSpectator_Debug");
		return ptr;
	}

};


// Class TgGame.TgPlayerInput
// 0x185B61BC5C0
class TgPlayerInput
{
public:
	unsigned char                                      UnknownData00[0x185B61BC5C0];                             // 0x0000(0x185B61BC5C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPlayerInput");
		return ptr;
	}

};


// Class TgGame.TgSpectatorInput
// 0x185BCD1A690
class TgSpectatorInput
{
public:
	unsigned char                                      UnknownData00[0x185BCD1A690];                             // 0x0000(0x185BCD1A690) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSpectatorInput");
		return ptr;
	}

};


// Class TgGame.TgPropActor
// 0x185B8947610
class TgPropActor
{
public:
	unsigned char                                      UnknownData00[0x185B8947610];                             // 0x0000(0x185B8947610) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgPropActor");
		return ptr;
	}

};


// Class TgGame.TgSkeletalMeshActor_Loader
// 0x185BCD15590
class TgSkeletalMeshActor_Loader
{
public:
	unsigned char                                      UnknownData00[0x185BCD15590];                             // 0x0000(0x185BCD15590) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgGame.TgSkeletalMeshActor_Loader");
		return ptr;
	}

};


